[
    {
      "basic_info": {
        "name": "Amina",
        "age": 12,
        "tech_comfort_level": "low"
      },
      "contextual_info": {
          "vulnerability_type_brief_description": "Structural and institutional exclusion - Discrimination due to refugee status",
        "privacy_awareness_level": "low",
        "information_cared_about": ["location", "immigration status", "identity documents"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - afraid to identify to receive assistance",
          "Privacy vs. Disclosure of identity - risk of stigma or denial of aid"
        ],
        "privacy_responses": [
          {
            "response": "Apathy",
            "description": "Feels surveillance is inevitable, so avoids acting or reporting."
          },
          {
            "response": "Non-use",
            "description": "Avoids official portals or apps to not expose status."
          }
        ],
        "costs_and_consequences": [
          "Missed access to legal aid, medical care, or language support",
          "Continued vulnerability without reporting abuse or needs"
        ]
      },
      "additional_privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
              "Privacy vs. Safety - reluctance to disclose refugee status to protect from harassment or threats",
              "Privacy vs. Community engagement - fear of harassment reduces participation in supportive spaces",
              "Privacy vs. Public presence - online hostility pressures refugees to retreat from digital spaces"
        ],
        "privacy_responses": [
          {
              "response": "Avoidance of disclosure",
              "description": "Chooses not to share refugee status or personal information online or with unfamiliar organizations."
          },
          {
              "response": "Self-censorship",
              "description": "Avoids posting personal stories or identifiable details online to prevent harassment or doxxing."
          },
          {
              "response": "Withdrawal from platforms",
              "description": "Stops using social media after repeated harassment tied to refugee identity."
          }
        ],
        "costs_and_consequences": [
              "Limited ability to use digital services that could provide beneficial resources",
              "Loss of emotional and social support from online communities",
              "Reduced access to information, opportunities, and advocacy networks"
          ]
      },
      "stories": [
        {
          "persona_identity": "Amina is a 12-year-old girl and middle-school student who recently resettled as a refugee; she is vulnerable to discrimination tied to her status. Her tech comfort level is low because she relies on shared devices and struggles with English and digital settings.",
          "story": "Wanting to feel included at school, Amina turned on sharing in the app so she could see what friends listen to and be seen too. She then connected the app to her Facebook account to find familiar people. Soon after, a classmate known for teasing her started mentioning the songs she played and a playlist name that hinted at her refugee status. When Amina tried to stop that classmate from appearing in her friend updates, the app kept them there because they were imported from Facebook. She felt exposed and powerless, and began deleting personal playlists and avoiding the app.",
          "information_leaked": "Her music profile and recent listening activity (track and playlist titles), timing of her listening, and connections to Facebook contacts; a playlist title hinting at refugee/asylum status, allowing others to infer sensitive identity information.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow4",
              "step_causing_harm": [
                "Step 4: Find 'Share my listening activity' and switch the toggle button to ON."
              ],
              "design_problems": [
                "Vague wording and no just-in-time warning that enabling sharing will make activity visible to all current and future connected contacts.",
                "No age-appropriate default privacy (sharing should be off and locked down for a minor).",
                "No granular audience control (cannot limit sharing to select people before connecting other networks)."
              ]
            },
            {
              "function": 2,
              "flow_id": "flow1",
              "step_causing_harm": [
                "Step 2: Click the 'Add Friends' button.",
                "Step 4: Enter Facebook account information and click 'Log In' (account successfully linked and friends synced)."
              ],
              "design_problems": [
                "Strong nudge to add friends via Facebook without clearly explaining that syncing expands the audience for already-enabled sharing.",
                "No explicit, prominent consent screen describing exactly who will see Amina's activity after the link, nor a chance to set audience limits first.",
                "Cross-platform contact sync occurs in one step without granular controls (e.g., import none/some, or exclude specific contacts)."
              ]
            },
            {
              "function": 4,
              "flow_id": "flow3",
              "step_causing_harm": [
                "Step 3: Click on the 'Unfollow' button (selected user is a synced Facebook friend; they still appear in Friend Activity)."
              ],
              "design_problems": [
                "Misleading control: 'Unfollow' suggests removal but does not remove Facebook-synced users from Friend Activity.",
                "Lack of clear feedback or guidance that only 'Block' will remove a synced Facebook contact from Friend Activity visibility.",
                "No dedicated 'Remove from Friend Activity' control, undermining user expectations and control."
              ]
            }
          ],
          "leakage_source": "The music app's Friend Activity feature and its Facebook integration after Amina enabled sharing.",
          "leak_to": "Her Facebook-synced contacts who use the app and have Friend Activity enabled, including a school classmate who has teased her before.",
          "harms": [
            {
              "harm": "Reputational harms",
              "cause": "Playlist titles and listening choices visible to synced contacts enable peers to infer her refugee status, prompting ridicule."
            },
            {
              "harm": "Psychological harms - emotional distress",
              "cause": "Unexpected exposure of sensitive identity cues to classmates causes anxiety, shame, and fear of further harassment."
            },
            {
              "harm": "Autonomy harms - thwarted expectations and lack of control",
              "cause": "The app nudges sharing and contact sync without clear audience warnings, and 'Unfollow' fails to remove Facebook-synced users, preventing meaningful control."
            },
            {
              "harm": "Discrimination harms",
              "cause": "Visibility of signals tied to refugee status enables targeted xenophobic comments and social exclusion."
            },
            {
              "harm": "Relationship harms",
              "cause": "Peers use her visible activity to ostracize her, straining school relationships and reducing her willingness to engage."
            }
          ],
          "consequences": "Amina deletes revealing playlists, avoids using the app, and self-censors her listening to prevent future exposure. She loses a helpful outlet for language practice and comfort, further isolating her and reinforcing withdrawal from digital spaces where support might be available."
        }
      ]
    },
    {
      "basic_info": {
        "name": "Eleanor",
        "age": 72,
        "tech_comfort_level": "low"
      },
      "contextual_info": {
        "vulnerability_type_brief_description": "Intersectional identities and characteristics - Elderly individual with cognitive decline",
        "privacy_awareness_level": "low",
        "information_cared_about": ["health data", "location", "financial transactions"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Autonomy - carers may monitor devices to protect",
          "Privacy vs. Support - needs remote monitoring but fears intrusion"
        ],
        "privacy_responses": [
          {
            "response": "Third-party protections",
            "description": "Relies on caregivers to manage device access and privacy."
          },
          {
            "response": "Physical workarounds",
            "description": "Uses simple devices with limited connectivity to reduce exposure."
          }
        ],
        "costs_and_consequences": [
          "Loss of independence and personal control",
          "Potential exclusion from beneficial tech innovations"
        ]
      },
      "additional_privacy_responses_and_costs": {
          "privacy_tensions_with_short_description": [
              "Privacy vs. Safety - protective monitoring may feel invasive",
              "Privacy vs. Dependence - reliance on others for privacy controls may lead to oversharing",
              "Privacy vs. Autonomy - safety measures may undermine dignity"
          ],
          "privacy_responses": [
              {
                  "response": "Selective adoption",
                  "description": "Chooses only certain monitoring tools or disables features to reduce intrusion."
              },
              {
                  "response": "Delegated privacy control",
                  "description": "Allows trusted individuals to set and manage device and account privacy preferences."
              },
              {
                  "response": "Consent safeguards",
                  "description": "Seeks clear explanations and agreements before enabling monitoring features."
              }
          ],
          "costs_and_consequences": [
              "Reduced protection from safety-focused monitoring systems",
              "Increased risk of falling victim to scams or fraud",
              "Potential over-disclosure of personal information",
              "Loss of awareness about personal data handling",
              "Possible reduced safety if tracking features are limited or disabled",
              "Emotional distress over loss of dignity"
          ]
      },
      "stories": [
        {
          "persona_identity": "Eleanor (she/her) is a retired librarian and widow in her 70s experiencing mild cognitive decline; as an elderly person with memory lapses, she relies on others for tech setup, which contributes to her low tech comfort because she struggles to remember settings and their consequences.",
          "story": "Eleanor wants to feel closer to family, so she turns on sharing in the music app and later starts a private session to listen to sensitive wellness playlists without anyone seeing. After hours pass, the private session ends without her noticing. The next day she connects her account to Facebook to find familiar faces. As soon as the connection is made, her recent listening—including support playlists related to memory issues and anxiety—appears to people she knows. When her caregiver brings it up and questions her choices, Eleanor tries to remove them from the feed but can't, leaving her feeling exposed and powerless.",
          "information_leaked": "Recent and current listening activity (track and playlist titles, artists, timestamps within the past 7 days) that reveal inferences about mental health and cognitive decline (e.g., anxiety and memory-support content).",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow4",
              "step_causing_harm": [
                "Step 4: Find 'Share my listening activity' and switch the toggle button to ON."
              ],
              "design_problems": [
                "Enabling sharing lacks clear, just-in-time explanation that the setting applies to all current and future friends (including Facebook connections) and persists across sessions.",
                "Prompting users to enable sharing is framed as a way to connect, without surfacing the scope of exposure or offering granular controls."
              ]
            },
            {
              "function": 3,
              "flow_id": "flow4",
              "step_causing_harm": [
                "Step 3: The system confirms the Private Session has remained active for 6 hours and automatically ends it."
              ],
              "design_problems": [
                "Private Session auto-expires without a prominent, persistent alert; the status change is easy to miss, especially for users with memory or attention challenges.",
                "No option to extend Private Session or set a reminder, increasing the chance of unintentional sharing afterward."
              ]
            },
            {
              "function": 2,
              "flow_id": "flow1",
              "step_causing_harm": [
                "Step 4: Enter Facebook account information and click 'Log In'."
              ],
              "design_problems": [
                "Linking Facebook immediately syncs contacts and enables mutual visibility without granular consent (e.g., choose which friends to add or a share-only vs. view-only mode).",
                "No post-link confirmation summarizing who can now see your activity or offering a one-click 'keep my activity hidden' safeguard."
              ]
            },
            {
              "function": 4,
              "flow_id": "flow1",
              "step_causing_harm": [
                "Step 2: Click on the 'Following' button (on a synced Facebook friend) with the intent to remove them from the feed."
              ],
              "design_problems": [
                "Unfollowing does not remove synced Facebook friends from the feed, violating user expectations.",
                "The interface does not explain the difference between app followers and synced Facebook connections or offer a clear pathway to revoke cross-network visibility."
              ]
            }
          ],
          "leakage_source": "The music app's Friend Activity sharing mechanism after Eleanor enabled sharing and linked Facebook.",
          "leak_to": "Her live-in caregiver and other Facebook contacts who also use the music app and have friend activity enabled.",
          "harms": [
            {
              "harm": "Reputational harms",
              "cause": "Sensitive listening history (wellness and cognitive-support content) is exposed to acquaintances via the Friend Activity feed, enabling judgments about her health."
            },
            {
              "harm": "Psychological harms — emotional distress",
              "cause": "Sudden, unexpected exposure of private listening leads to embarrassment and anxiety when confronted by her caregiver."
            },
            {
              "harm": "Autonomy harms — thwarted expectations and lack of control",
              "cause": "Ambiguous sharing controls, Private Session auto-expiry, and sticky cross-network connections undermine her intent to keep listening private."
            },
            {
              "harm": "Relationship harms",
              "cause": "Caregiver increases surveillance and restricts Eleanor's device use after seeing her listening activity."
            },
            {
              "harm": "Autonomy harms — chilling effects",
              "cause": "Eleanor begins avoiding mental health and memory-support content for fear it will be shared again."
            }
          ],
          "consequences": "Her caregiver tightens device oversight and resets app settings, Eleanor stops using supportive audio programs, feels embarrassed and less independent, and withdraws from online social features, reducing her access to helpful resources."
        }
      ]
    },
    {
      "basic_info": {
        "name": "Jamal",
        "age": 15,
        "tech_comfort_level": "high"
      },
      "contextual_info": {
        "vulnerability_type_brief_description": "Intersectional identities and characteristics - Child navigating social media",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["posts", "location tagging", "social connections"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Self-expression - wants to post but fears visibility by adults",
          "Privacy vs. Support - parental monitoring vs peer privacy"
        ],
        "privacy_responses": [
          {
            "response": "Withholding disclosure",
            "description": "Omits identifying info and avoids location tags."
          },
          {
            "response": "Controlling disclosure",
            "description": "Uses private accounts or separate pseudonymous profiles."
          }
        ],
        "costs_and_consequences": [
          "Less authentic social engagement",
          "Mental load managing multiple profiles"
        ]
      },
      "additional_privacy_responses_and_costs": {
          "privacy_tensions_with_short_description": [
              "Privacy vs. Self-expression - limits public sharing to maintain control over personal identifiers",
              "Privacy vs. Support - avoids location sharing to limit monitoring",
              "Privacy vs. Platform engagement - lack of effective tools can discourage participation"
          ],
          "privacy_responses": [
              {
                  "response": "Selective audience sharing",
                  "description": "Shares personal or sensitive content only with trusted contacts or private lists."
              },
              {
                  "response": "Account separation",
                  "description": "Maintains distinct profiles for different audiences, such as parents and peers."
              },
              {
                  "response": "Tool-based boundary regulation",
                  "description": "Uses available platform settings to manage visibility across different social circles."
              }
          ],
          "costs_and_consequences": [
              "Reduced potential for wider recognition or engagement on posts",
              "Ongoing effort to maintain multiple accounts and manage distinct audiences",
              "Possible reduced participation in online spaces due to fear of unintended exposure"
          ]
      },
      "stories": [
        {
          "persona_identity": "Jamal is a 15-year-old boy, a high school sophomore and aspiring beatmaker; as a minor navigating social media he's in a vulnerable group, and his tech comfort is high because he edits music on his laptop and manages separate profiles for peers and adults.",
          "story": "After school, Jamal opens his music app to check what people are listening to and notices his coach's name in the activity feed. Remembering that his own listening is visible to friends, he tries to remove the coach from his view so he won't draw attention from adults. He unfollows the coach, expecting that to sever the connection. The coach's name doesn't go away, and Jamal doesn't realize the connection persists through Facebook syncing. At practice the next day, the coach casually references the late-night tracks Jamal played, making it clear he still sees Jamal's activity. Jamal feels exposed and starts second-guessing what he listens to and when.",
          "information_leaked": "Jamal's listening activity (recent tracks with explicit labels, recency/timing of playback within the last 7 days) and social connection to an adult contact (his coach) via Facebook sync.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow6",
              "step_causing_harm": [
                "Step 1: Tap the Friend Activity icon; system finds mutual-followed or Facebook-synced friends sharing activity and displays the feed."
              ],
              "design_problems": [
                "Cross-platform Facebook syncing is opaque; it creates persistent visibility links that are not clearly explained to minors.",
                "Implied reciprocity: surfacing Facebook-synced contacts in the feed suggests symmetric visibility without clarifying control boundaries."
              ]
            },
            {
              "function": 4,
              "flow_id": "flow3",
              "step_causing_harm": [
                "Step 3: Click 'Unfollow'; system detects the person is a Facebook-synced friend and keeps them in the Friend Activity feed."
              ],
              "design_problems": [
                "Unfollow does not break Facebook-synced visibility, but the app provides no warning or guidance.",
                "Mismatch between user mental model and system behavior: 'Unfollow' suggests removing access, yet visibility persists.",
                "Lack of a clear, child-appropriate control to revoke visibility from Facebook-synced adults without full account disconnection."
              ]
            }
          ],
          "leakage_source": "The music app's automatic sharing of listening activity to Facebook-synced contacts and the app's persistence of that link despite unfollowing.",
          "leak_to": "Jamal's high school coach (an adult Facebook contact).",
          "harms": [
            {
              "harm": "Reputational harm",
              "cause": "The coach infers Jamal's late-night listening patterns and explicit music tastes from the Friend Activity feed."
            },
            {
              "harm": "Psychological harm — emotional distress",
              "cause": "Feeling watched by an adult in a leisure space intended for peers creates embarrassment and anxiety."
            },
            {
              "harm": "Autonomy harm — thwarted expectations and lack of control",
              "cause": "The app implies unfollowing will remove someone, but Facebook sync keeps them connected, undermining Jamal's attempt to control his audience."
            },
            {
              "harm": "Relationship harm",
              "cause": "Adult oversight of Jamal's personal music choices strains the student-coach relationship and invites monitoring."
            },
            {
              "harm": "Autonomy harm — chilling effects",
              "cause": "Jamal self-censors his listening to avoid being judged, reducing his freedom to explore music."
            }
          ],
          "consequences": "The coach comments about Jamal's late-night playlist at practice, embarrassing him; Jamal stops playing certain artists, avoids night listening, and withdraws from sharing with peers, increasing his mental load to manage audiences and diminishing his enjoyment of the app."
        }
      ]
    },
    {
      "basic_info": {
        "name": "Liam",
        "age": 35,
        "tech_comfort_level": "medium"
      },
      "contextual_info": {
        "vulnerability_type_brief_description": "Intersectional identities and characteristics - Individual with chronic illness",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["medical records", "symptom logs", "treatment plans"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - sharing health data for care vs exposure",
          "Privacy vs. Disclosure of identity - risk of insurer misuse"
        ],
        "privacy_responses": [
          {
            "response": "Withholding disclosure",
            "description": "Shares only limited health info in online forums."
          },
          {
            "response": "Asking for help",
            "description": "Seeks advice from trusted patient communities discreetly."
          }
        ],
        "costs_and_consequences": [
          "Less tailored advice or misdiagnosis online",
          "Risk trusting poor-quality info"
        ]
      },
      "additional_privacy_responses_and_costs": {
          "privacy_tensions_with_short_description": [
              "Privacy vs. Disclosure of identity - limiting audience to avoid potential discrimination",
              "Privacy vs. Support - need for detailed disclosure for advice vs. risk of permanent public exposure",
              "Privacy vs. Data utility - limiting online sharing to prevent insurer access"
          ],
          "privacy_responses": [
              {
                  "response": "Selective visibility controls",
                  "description": "Uses friend lists or restricted groups to control who can see health-related posts."
              },
              {
                  "response": "Partial disclosure",
                  "description": "Omits identifiable health details while still describing symptoms or situations."
              },
              {
                  "response": "Restrictive sharing",
                  "description": "Avoids uploading detailed symptom logs or treatment histories to online platforms."
              }
          ],
          "costs_and_consequences": [
              "Reduced reach of health-related posts, potentially limiting peer support",
              "Potential for less accurate or relevant responses from community members",
              "Loss of potential benefits from aggregated health data analysis",
              "Reduced ability to track health trends across time digitally"
          ]
      },
      "stories": [
        {
          "persona_identity": "Liam is a 35-year-old man working as a project coordinator at a mid-size marketing firm. He lives with a chronic illness, which heightens his sensitivity to health-related disclosures. His tech comfort level is medium—he's confident with everyday productivity apps but often misses nuanced privacy controls in consumer apps.",
          "story": "Liam turned on the app's friend activity feed so he could keep up with what his close friends were listening to, and he enabled sharing to be part of the social experience. Later that day he started a private session to listen to chronic-illness management podcasts during a flare. Hours after he forgot about it, the private session timed out without him realizing, and the app resumed broadcasting his listening. A coworker, connected through Facebook, noticed and mentioned it at the office. Embarrassed and worried about being judged at work, Liam tried to remove that coworker from his view and connection, but the Facebook-linked connection kept the coworker in his orbit. The app's defaults and confusing connections made it hard for Liam to control who could see sensitive listening tied to his health.",
          "information_leaked": "Liam's listening activity and history (e.g., chronic-illness management podcasts/playlists and related episode titles), timestamps/recency of listening, and the fact that he is actively engaging with health-related content on the music app.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow2",
              "step_causing_harm": [
                "Step 4: Turn on 'See what your friends are playing' which triggers a prompt encouraging sharing.",
                "Step 7: Switch 'Share my listening activity' to ON, enabling broadcast of Liam's listening to friends and Facebook-synced contacts."
              ],
              "design_problems": [
                "Nudging language and a prominent prompt encourage enabling sharing without clarifying the full audience (including Facebook-synced contacts).",
                "Ambiguous 'friends' terminology obscures whether coworkers from Facebook will see activity.",
                "No scoped sharing option (e.g., share with a subset or exclude specific contacts) before turning sharing ON."
              ]
            },
            {
              "function": 3,
              "flow_id": "flow4",
              "step_causing_harm": [
                "Step 3: Private Session automatically ends after 6 hours, silently reverting Liam to public sharing while he continues listening to sensitive content."
              ],
              "design_problems": [
                "Timeout reverts to sharing without a clear, persistent warning or opt-in confirmation.",
                "Reliance on passive status cues rather than proactive alerts when privacy mode ends.",
                "Default 'Share my listening activity' resumes automatically; no grace period or countdown to prevent unintended disclosure."
              ]
            },
            {
              "function": 4,
              "flow_id": "flow3",
              "step_causing_harm": [
                "Step 3: Click 'Unfollow' (on a Facebook-synced coworker), which does not remove the connection or prevent them from seeing Liam's activity."
              ],
              "design_problems": [
                "Unfollow control does not break Facebook-synced visibility; behavior is not explained.",
                "No clear path to remove or narrowly restrict Facebook-synced contacts without resorting to heavy-handed blocking.",
                "Feed management (who you see) is conflated with visibility control (who sees you), leading to false expectations of privacy."
              ]
            }
          ],
          "leakage_source": "The music app's Friend Activity sharing feature automatically broadcasting activity after Private Session expiry to followers and Facebook-synced contacts.",
          "leak_to": "A coworker connected via Facebook sync (and potentially other Facebook-synced contacts).",
          "harms": [
            {
              "harm": "Reputational harm",
              "cause": "The app auto-shared health-related listening after Private Session expired, allowing a coworker to infer Liam's chronic health struggles."
            },
            {
              "harm": "Psychological harm — emotional distress",
              "cause": "Unexpected exposure of sensitive listening created anxiety and embarrassment at work."
            },
            {
              "harm": "Autonomy harm — failure to inform and thwarted expectations",
              "cause": "Private Session auto-ended without a clear, timely alert; sharing resumed by default, undermining Liam's privacy expectations."
            },
            {
              "harm": "Autonomy harm — lack of control",
              "cause": "Facebook-synced connections persist despite unfollowing, preventing Liam from selectively excluding specific contacts."
            },
            {
              "harm": "Relationship harm",
              "cause": "Coworker's knowledge of sensitive listening prompted workplace gossip and changed colleague behavior toward Liam."
            },
            {
              "harm": "Discrimination harm (risk)",
              "cause": "Coworker awareness of health-related content increases the risk of biased assumptions about reliability or workload capacity."
            }
          ],
          "consequences": "A coworker referenced Liam's health-related listening in a team chat, leading to awkward conversations and reduced trust. Liam avoided volunteering for visible projects, worried about being seen as less reliable. He curtailed sharing and stopped engaging with supportive health content on the app, losing valuable coping resources and peer advice."
        }
      ]
    },
    {
      "basic_info": {
        "name": "Arjun",
        "age": 28,
        "tech_comfort_level": "medium"
      },
      "contextual_info": {
        "vulnerability_type_brief_description": "Intersectional identities and characteristics - Person with physical disability",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["accessibility needs", "mobility data", "assistive device usage"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - assistive services need data access",
          "Privacy vs. Disclosure of identity - disability status may be stigmatizing"
        ],
        "privacy_responses": [
          {
            "response": "Controlling disclosure",
            "description": "Uses platforms where disability info held privately."
          },
          {
            "response": "Non-use",
            "description": "Avoids platforms that force outing of disability status."
          }
        ],
        "costs_and_consequences": [
          "Reduced access to some supportive apps",
          "Social isolation or missing communities"
        ]
      },
      "additional_privacy_responses_and_costs": {
          "privacy_tensions_with_short_description": [
              "Privacy vs. Disclosure of identity - providing accessibility info can expose disability status",
              "Privacy vs. Accessibility - accessible authentication may involve revealing impairment",
              "Privacy vs. Public participation - avoiding certain spaces to prevent unwanted exposure"
          ],
          "privacy_responses": [
              {
                  "response": "Use of privacy-centered tools",
                  "description": "Chooses assistants or platforms that explain privacy practices without requesting extra personal data."
              },
              {
                  "response": "Avoidance of certain authentication methods",
                  "description": "Chooses authentication approaches that do not require public demonstration of impairment."
              },
              {
                  "response": "Avoidance of monitored spaces",
                  "description": "Does not enter locations with camera-based systems that could capture assistive device use."
              }
          ],
          "costs_and_consequences": [
              "May limit engagement with platforms that lack accessible, privacy-respecting information features",
              "Potential difficulty accessing devices securely",
              "Increased dependency on less convenient authentication solutions",
              "Reduced access to public services or events",
              "Potential social isolation from avoiding monitored environments"
          ]
      },
      "stories": [
        {
          "persona_identity": "Arjun is a 28-year-old man who works as a community arts coordinator and uses a wheelchair; as a disabled professional, he's in a vulnerability group where disclosure of disability may carry stigma. His tech comfort is medium because he regularly uses assistive tools but prefers straightforward, clearly explained settings.",
          "story": "Arjun wanted to keep up with what his coworkers were listening to, so he enabled the app's friend activity feature and turned on sharing to see their updates. Later that night, while preparing materials for an accessibility workshop, he switched to a private mode and listened to disability support podcasts and mobility-focused playlists for several hours. The private mode ended automatically, and the app resumed sharing his listening in the morning. Coworkers who follow him opened the app and saw a string of disability-related titles tied to his account, which he never intended to share beyond that private session.",
          "information_leaked": "Specific listening history items (e.g., disability support podcasts, wheelchair workout and mobility-therapy playlists), time-of-day and recency of listening (morning feed updates after late-night session), and inferences about disability status and rehabilitation routines via playlist/episode titles.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow2",
              "step_causing_harm": [
                "Step 7: Switch 'Share my listening activity' to ON, which enables ongoing broadcast of Arjun's listening to mutual-followed friends."
              ],
              "design_problems": [
                "Expectation mismatch: Sharing is presented as part of seeing friends' activity without clearly emphasizing that Arjun's activity will be broadcast to followers.",
                "Risky defaults are not surfaced: public exposure of recent artists is on by default and not highlighted alongside sharing.",
                "No audience controls or per-listen sensitivity settings at the moment of enabling sharing."
              ]
            },
            {
              "function": 3,
              "flow_id": "flow4",
              "step_causing_harm": [
                "Step 3: Private Session automatically ends after 6 hours, causing listening to resume broadcasting without an explicit, accessible alert."
              ],
              "design_problems": [
                "Auto-expiration silently reverts to sharing without a clear, persistent notification or consent renewal.",
                "Status change relies on a subtle visual indicator that is easy to miss for users with accessibility needs.",
                "No option to auto-extend or lock Private Session, nor a warning countdown before it ends."
              ]
            }
          ],
          "leakage_source": "The music app's Friend Activity system automatically resuming sharing after Private Session expiration.",
          "leak_to": "Mutual-followed coworkers on the music app who check their Friend Activity feed.",
          "harms": [
            {
              "harm": "Reputational harm",
              "cause": "The app publicly signals disability-related listening, enabling colleagues to infer sensitive health information."
            },
            {
              "harm": "Psychological harm - emotional distress",
              "cause": "Unintended disclosure produces anxiety and embarrassment when coworkers comment on the content."
            },
            {
              "harm": "Autonomy harm - thwarted expectations and lack of control",
              "cause": "Ambiguous sharing setup and silent Private Session expiry undermine Arjun's attempt to control who sees his listening."
            },
            {
              "harm": "Relationship harms",
              "cause": "Coworkers' perceptions shift after exposure to sensitive listening, straining professional dynamics."
            },
            {
              "harm": "Discrimination harms",
              "cause": "Managers may subtly deprioritize Arjun for public-facing tasks after inferring disability-related needs from the feed."
            }
          ],
          "consequences": "A coworker mentions the disability support content in a team chat; Arjun feels exposed and stops using the app socially. His manager quietly removes him from an upcoming client presentation, and he withdraws from music-sharing groups to avoid further exposure, increasing social isolation."
        }
      ]
    },
    {
      "basic_info": {
        "name": "Maya",
        "age": 30,
        "tech_comfort_level": "high"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Intersectional identities and characteristics - Gender non-conforming individual",
        "privacy_awareness_level": "high",
        "information_cared_about": ["gender identity", "social media footprint", "dating profiles"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Disclosure of identity - outing exposes to harassment",
          "Privacy vs. Support - wants community but risks doxxing"
        ],
        "privacy_responses": [
          {
            "response": "Controlling disclosure",
            "description": "Maintains anonymous or pseudonym profiles focused on identity support."
          },
          {
          "response": "Privacy-enhancing technologies",
            "description": "Uses anonymous services and encrypted messaging."
          }
        ],
        "costs_and_consequences": [
          "Difficulty building personal connections under pseudonym",
          "Technical overhead and stress"
        ]
    },
    "additional_privacy_responses_and_costs": {
          "privacy_tensions_with_short_description": [
              "Privacy vs. Disclosure of identity - fear of being outed through online activity",
              "Privacy vs. Support - desire for connection vs. risk of exposure",
              "Privacy vs. Community visibility - activism increases risk of targeting"
          ],
          "privacy_responses": [
              {
                "response": "Limiting online disclosures",
                "description": "Carefully restricts the amount of personal or identity-related information shared online."
              },
              {
                "response": "Pseudonymous use",
                "description": "Creates and maintains anonymous or pseudonym dating profiles to seek support or connections without disclosure."
              },
              {
                "response": "Non-use of services",
                "description": "Avoids platforms perceived as risky due to potential exposure."
              },
              {
                "response": "Reliance on encrypted communication",
                "description": "Uses encrypted messaging apps and anonymous platforms to safeguard activist communication."
              }
          ],
          "costs_and_consequences": [
              "Restricted opportunities for authentic self-expression online",
              "Difficulty forming meaningful connections under pseudonym",
              "Exclusion from supportive or compatible dating communities",
              "Added technical burden of managing secure communication tools",
              "Stress from navigating constant threats of harassment"
          ]
    },
    "stories": [
      {
        "persona_identity": "Maya (they/them) is a gender non-conforming UX researcher at a fintech startup. Their high tech comfort comes from years of testing privacy features professionally, yet their visible LGBTQ+ activism and nonconformity heighten their vulnerability to outing and workplace bias.",
        "story": "Seeking connection with queer musicians and friends, Maya enabled the app's friend activity features and turned on sharing so they could reciprocate. They immediately noticed a coworker in the feed and tried to remove that person, assuming it would also limit what the coworker could see. Later, hoping to find more supportive friends, Maya connected the app to Facebook, which silently linked their real name and expanded who could view their listening. Within hours, the coworker saw identity‑revealing playlists and mentioned them in a team chat. Maya turned on a private session afterward, but the disclosure had already happened.",
        "information_leaked": "Real name (via Facebook linkage), listening activity (playlist and track titles related to LGBTQ+ identity), recent listening timestamps, and social graph connections on the app (coworker link via Facebook sync).",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": [
              "Step 7: Find 'Share my listening activity' and switch the toggle button to ON."
            ],
            "design_problems": [
              "No explicit pre-confirmation of who will see the activity (e.g., coworkers synced via Facebook or mutual follows).",
              "No granular controls at enable time (cannot exclude specific contacts or limit by group).",
              "Framing nudges users to enable sharing without clarifying identity linkage risks."
            ]
          },
          {
            "function": 4,
            "flow_id": "flow3",
            "step_causing_harm": [
              "Step 3: Click on the 'Unfollow' button (on a Facebook-synced friend), which does not remove their visibility in Friend Activity."
            ],
            "design_problems": [
              "Ambiguous semantics: 'Unfollow' does not sever Facebook-based visibility but looks like it should.",
              "No clear notice that Facebook-synced contacts remain connected regardless of unfollow.",
              "No easy, per-contact \"hide me from this person\" control without resorting to hard Block."
            ]
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 4: Enter Facebook account information and click 'Log In' (which links real-name identity and auto-syncs contacts who can see activity)."
            ],
            "design_problems": [
              "Assurance focuses on not posting to Facebook, while downplaying in-app exposure to Facebook friends.",
              "No granular selection of which Facebook friends to sync; no preview of what profile identity will be shown.",
              "Implicit, broad consent to expand the audience for shared activity without highlighting outing risks."
            ]
          },
          {
            "function": 3,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 2: Click 'Private Session' (creates a false sense of safety because previously shared activity remains visible to others)."
            ],
            "design_problems": [
              "No clear disclosure that Private Session is not retroactive and won't remove past activity already exposed.",
              "Short-lived session with auto-expiry not surfaced at the moment of activation, undermining control."
            ]
          }
        ],
        "leakage_source": "The music app's Friend Activity sharing and Facebook contact sync (platform design and defaults).",
        "leak_to": "A coworker connected via Facebook sync (and, secondarily, colleagues who were shown the coworker's chat message about Maya's listening).",
        "harms": [
          {
            "harm": "Reputational Harms",
            "cause": "Linking Facebook identity to the app and globally sharing listening activity exposed identity-revealing playlists to a coworker."
          },
          {
            "harm": "Psychological Harms — Emotional Distress",
            "cause": "Unanticipated exposure triggered anxiety and fear of targeted harassment after the coworker's public mention."
          },
          {
            "harm": "Autonomy Harms — Thwarted Expectations & Lack of Control",
            "cause": "'Unfollow' failed to sever visibility for a Facebook-synced contact, and Private Session did not retroactively hide past activity."
          },
          {
            "harm": "Relationship Harms",
            "cause": "Coworker's disclosure in a team chat strained workplace relationships and trust."
          },
          {
            "harm": "Discrimination Harms",
            "cause": "Exposure of gender identity in a professional context increased the risk of bias in assignments and evaluations."
          }
        ],
        "consequences": "A coworker commented on Maya's identity-related listening in a team chat, leading to embarrassment, stress, and a meeting with their manager. Maya stopped listening to LGBTQ+ content at work (chilling effect), spent hours reconfiguring settings, and created a separate, pseudonymous account. They filed a complaint with the app and now avoid connecting social accounts, at the cost of reduced community discovery."
      }
     ]
    },
    {
      "basic_info": {
        "name": "Elena",
        "age": 29,
        "tech_comfort_level": "medium"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Socioeconomic disadvantage - Unemployed single parent",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["financial records", "benefit claims", "contact info"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - welfare requires sharing data",
          "Disclosure vs. Stigma - revealing unemployment brings judgment"
        ],
        "privacy_responses": [
          {
            "response": "Withholding disclosure",
            "description": "Redacts or simplifies info on public-facing forms or forums."
          },
          {
          "response": "Privacy-enhancing technologies",
            "description": "Uses alias emails, avoids linking social profiles to forms."
          }
        ],
        "costs_and_consequences": [
          "Delays in benefit processing",
          "Complex account setup and management"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [],
      "privacy_responses": [
          {
            "response": "",
            "description": ""
          }
      ],
      "costs_and_consequences": []
    },
    "stories": [
      {
        "persona_identity": "Elena is a 29-year-old woman, an unemployed retail associate and single parent seeking intermittent gig work, which places her in a socioeconomic disadvantage. She has medium tech comfort because she uses mainstream apps daily but avoids deeper settings and integrations she finds confusing.",
        "story": "Trying to unwind after her child's bedtime, Elena opens the section that shows what her friends are listening to and notices a school parent she knows through Facebook. Wanting distance, she tries to remove this person from her connections, but they still remain tied to her account through the Facebook link. Later, Elena turns on a mode intended to hide her listening and relaxes to job-search podcasts and budgeting playlists. Hours afterward, the mode ends without her noticing, and her new listening resumes being visible. The school parent sees it, infers that Elena is struggling financially, and spreads the impression among other parents, costing Elena a babysitting opportunity and leaving her embarrassed.",
        "information_leaked": "Elena's real name and profile presence on the app; her recent listening activity and timestamps within the past 7 days (e.g., job-search podcasts, budgeting/benefits playlists); inferences about financial hardship and unemployment stress; her ongoing activity visibility due to private mode auto-expiring.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow6",
            "step_causing_harm": [
              "Step 1: Tap the Friend Activity icon at the top-right corner of the app window, located to the left of the Profile icon."
            ],
            "design_problems": [
              "The app presents friends' activity without clearly indicating that Elena's own activity may be shared by default to connected friends.",
              "No explicit, in-context notice of reciprocity (that viewing others often coincides with being visible to them).",
              "No easy access to current sharing status from the Friend Activity view."
            ]
          },
          {
            "function": 4,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 2: Click on the 'Following' button"
            ],
            "design_problems": [
              "Unclear distinction between unfollowing within the app and the persistence of a Facebook-synced connection.",
              "No warning that unfollowing a Facebook-synced friend does not remove them from visibility lists or stop mutual visibility.",
              "Lack of a dedicated control to remove or mute Facebook-synced contacts from Friend Activity."
            ]
          },
          {
            "function": 3,
            "flow_id": "flow4",
            "step_causing_harm": [
              "Step 3: The system continuously checks whether the Private Session has remained active for 6 hours and confirms that it has (session auto-ends)."
            ],
            "design_problems": [
              "Private Session auto-expires without a prominent, persistent alert or opt-in reminder to renew.",
              "Reversion to sharing is silent and immediate, reinstating visibility to friends without confirmation.",
              "Defaults favor sharing over privacy, and there is no scheduling or auto-renew option for longer private listening windows."
            ]
          }
        ],
        "leakage_source": "The music app's Friend Activity sharing and Facebook sync integration, combined with default sharing and an auto-expiring private mode.",
        "leak_to": "A Facebook-synced school parent acquaintance who views Elena's Friend Activity.",
        "harms": [
          {
            "harm": "Reputational harms",
            "cause": "Visible listening patterns (e.g., job-search and benefits-related content) enable stigmatizing inferences about Elena's financial status."
          },
          {
            "harm": "Economic harms",
            "cause": "The acquaintance, perceiving instability, withdraws a paid babysitting gig and discourages others in their parent group from hiring Elena."
          },
          {
            "harm": "Autonomy harms — Failure to Inform, Thwarted Expectations, Lack of Control",
            "cause": "The app does not clarify that unfollowing does not sever Facebook-synced visibility and silently ends private listening, resuming sharing without clear notice."
          },
          {
            "harm": "Psychological harms — Emotional distress",
            "cause": "Elena experiences anxiety and embarrassment after learning others have seen her sensitive listening history."
          },
          {
            "harm": "Relationship harms",
            "cause": "Trust frays with other parents after gossip based on what her listening reveals."
          }
        ],
        "consequences": "Elena loses a childcare job, feels ashamed in her school-parent community, and begins censoring her own listening, avoiding helpful podcasts and playlists to prevent further judgment."
      }
     ]
    },
    {
      "basic_info": {
        "name": "Noah",
        "age": 40,
        "tech_comfort_level": "low"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Socioeconomic disadvantage - Low literacy adult",
        "privacy_awareness_level": "low",
        "information_cared_about": ["identity", "financial data", "basic navigation data"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Accessibility - cannot understand consent forms",
          "Privacy vs. Support - wants services but unsure what gives away info"
        ],
        "privacy_responses": [
          {
            "response": "Apathy",
            "description": "Clicks through defaults or avoids use entirely."
          },
          {
          "response": "Non-use",
            "description": "Avoids apps and platforms perceived complex."
          }
        ],
        "costs_and_consequences": [
          "Exclusion from digital services or aid",
          "Misunderstanding of terms leading to unexpected exposure"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
          "Privacy vs. Accessibility - complexity of privacy notices forces bypassing them",
          "Privacy vs. Support - uncertainty about what data is shared prevents engagement with services"
      ],
      "privacy_responses": [
          {
            "response": "Click-through behavior",
            "description": "Skips over or accepts default privacy settings without reading notices."
          },
          {
            "response": "Avoidance of digital services",
            "description": "Chooses not to engage with apps or platforms that feel overwhelming due to text-heavy privacy or security requirements."
          }
      ],
      "costs_and_consequences": [
          "Inadvertent exposure of sensitive data",
          "No awareness of the scope of consent provided",
          "Exclusion from useful services and opportunities",
          "Increased vulnerability due to reliance on offline or informal alternatives"
      ]
    },
    "stories": [
      {
        "persona_identity": "Noah is a 40-year-old man working night shifts as a warehouse picker. As a low-literacy adult facing socioeconomic pressures, he struggles to read dense settings and notices, which explains his low tech comfort.",
        "story": "Noah turns on the music app's friend activity view to keep up with coworkers and notices a colleague he'd rather not share with. He tries to remove that person but they still show up in his list, which he takes to mean the problem is solved. To be safe, he starts a private session during his shift. The next day, wanting more people to follow for music tips, he links the app to Facebook. After the private session expires, his listening—like a playlist about dealing with debt—becomes visible to the newly synced coworkers, including his supervisor. A coworker jokes about his 'money stress' music, and Noah realizes the app has been showing his activity to them despite his attempts to stay private.",
        "information_leaked": "Noah's username and profile on the music app; his current and recent (past 7 days) listening activity, including playlist and track titles suggestive of financial stress; timestamps/activity recency; newly linked social graph via Facebook (which coworkers he is connected to).",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow3",
            "step_causing_harm": [
              "Step 4: Turn on 'See what your friends are playing', which encourages social visibility without clarifying it doesn't control Noah's own sharing."
            ],
            "design_problems": [
              "Ambiguous mental model: The feature name implies reciprocity and may mislead low-literacy users into thinking viewing ≈ controlling what others see.",
              "No inline disclosure about how Noah's own sharing works or where to turn it off."
            ]
          },
          {
            "function": 4,
            "flow_id": "flow3",
            "step_causing_harm": [
              "Step 3: Click 'Unfollow' on a Facebook-synced friend, but the person still appears and remains connected."
            ],
            "design_problems": [
              "Misleading feedback: The person remains visible; no clear explanation that Facebook-synced links persist and that 'unfollow' doesn't stop them from seeing Noah's activity.",
              "No clear pathway or prompt to block or to review/disable Noah's own sharing after the unsuccessful unfollow."
            ]
          },
          {
            "function": 3,
            "flow_id": "flow6",
            "step_causing_harm": [
              "Step 5: Start a Private Session (temporary protection).",
              "Step 6: Private Session automatically ends after 6 hours, silently restoring sharing."
            ],
            "design_problems": [
              "Temporary privacy with silent expiry: After the padlock disappears, sharing resumes by default without a clear, persistent warning.",
              "Critical setting ('Share my listening activity' defaults to ON in Social) is not surfaced when starting or ending Private Session, creating a trap for low-literacy users."
            ]
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 4: Log in and connect Facebook, which immediately syncs coworkers and expands the audience for Noah's default-on listening sharing after Private Session ends."
            ],
            "design_problems": [
              "Consent bundling: The flow emphasizes 'Connect with Facebook' without a clear, plain-language notice that Facebook friends will see Noah's listening in-app.",
              "No just-in-time prompt to review or toggle 'Share my listening activity' before completing the connection.",
              "Reassurance framing ('We'll never post to Facebook') distracts from the in-app exposure risk."
            ]
          }
        ],
        "leakage_source": "The music app's Friend Activity system and default-on 'Share my listening activity' setting activated after Private Session expiry, amplified by the Facebook connection.",
        "leak_to": "Facebook-synced coworkers and the shift supervisor within the music app's Friend Activity feed, including the coworker Noah tried to unfollow.",
        "harms": [
          {
            "harm": "Reputational Harms",
            "cause": "Supervisors and coworkers infer financial problems from playlist titles and recent listening visible through the app's Friend Activity after syncing."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Public exposure of sensitive listening leads to embarrassment and anxiety."
          },
          {
            "harm": "Autonomy Harms - Failure to Inform",
            "cause": "The app does not clearly explain that viewing friends does not control one's own sharing and that Private Session is temporary and defaults back to sharing."
          },
          {
            "harm": "Autonomy Harms - Lack of Control",
            "cause": "Unfollow fails for Facebook-synced contacts and the app does not offer an obvious, accessible route to prevent those contacts from seeing Noah's activity before completing Facebook sync."
          },
          {
            "harm": "Relationship Harms",
            "cause": "Coworkers and a supervisor see sensitive music choices, straining workplace dynamics."
          },
          {
            "harm": "Economic Harms",
            "cause": "Workplace perception issues risk fewer favorable shifts or opportunities due to stigma from visible listening activity."
          }
        ],
        "consequences": "Noah is teased at work and worries his supervisor now doubts his reliability. He avoids the app, loses the social and motivational benefits of music at work, and fears his hours may be affected. He feels less willing to use digital services, reinforcing exclusion and ongoing stress."
      }
    ]
  },
  {
    "basic_info": {
      "name": "Rosa",
      "age": 55,
      "tech_comfort_level": "low"
    },
    "contextual_info": {
      "vulnerability_type_brief_description": "Socioeconomic disadvantage - Rural subsistence farmer",
      "privacy_awareness_level": "low",
      "information_cared_about": ["land ownership records", "income", "location"]
    },
    "privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
        "Privacy vs. Inclusion - agricultural platforms collect economic data",
        "Privacy vs. Location - geo-tracking may expose farm lands"
      ],
      "privacy_responses": [
        {
          "response": "Non-use",
          "description": "Rejects farm-management apps fearing data exposure."
        }
      ],
      "costs_and_consequences": [
        "Missed productivity tools or weather alerts",
        "Continued digital exclusion from markets"
      ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
          "Privacy vs. Location - data collection can expose land and operational details",
          "Privacy vs. Inclusion - uncertainty over data ownership and control",
          "Privacy vs. Land security - disclosure risks exploitation or land seizure"
      ],
      "privacy_responses": [
          {
            "response": "Skeptical engagement",
            "description": "Approaches digital tools with caution or avoids them due to fear of exploitation."
          },
          {
            "response": "Avoidance of data sharing",
            "description": "Chooses not to upload or share farm data on platforms due to lack of clarity on data use."
          },
          {
            "response": "Withholding sensitive details",
            "description": "Avoids sharing land ownership or income data with platforms or external actors."
          }
      ],
      "costs_and_consequences": [
          "Loss of potential benefits from data-driven farming solutions",
          "Exclusion from markets and support programs requiring digital participation",
          "Reduced access to financial or developmental programs requiring documentation of farm data",
          "Persistent mistrust in digitalization efforts"
      ]
    },
    "stories": [
      {
        "persona_identity": "Rosa is a 55-year-old woman and rural subsistence farmer in a socioeconomically disadvantaged community; her low tech comfort stems from spotty internet access and limited experience with apps.",
        "story": "Rosa opens a music app on a shared computer to hear the songs her niece recommends. To make the feed work, she turns on sharing for her listening. Still seeing no one she knows, she links the app to her Facebook so it can find familiar faces. Within minutes, local contacts who also use the app can see what she's been playing. A nearby land broker, synced through Facebook, notices her recent listening around farm-debt help and land transfer checklists and concludes she may be preparing to sell. He shows up at her field that afternoon with a pressure-filled low offer, and word spreads through the local co-op that Rosa might be in financial trouble.",
        "information_leaked": "Real identity linked to her music profile via Facebook; her real-time and recent listening activity (track/playlist names and timestamps) visible to synced Facebook contacts on the app; inferred financial stress and possible intentions regarding land transfer based on playlist themes; active hours indicating when she's at home or working.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow4",
            "step_causing_harm": [
              "Step 4: Find 'Share my listening activity' and switch it ON."
            ],
            "design_problems": [
              "Ambiguous audience disclosure—does not clearly state who will see her activity once sharing is on.",
              "No granular controls (e.g., per-friend visibility) before enabling sharing.",
              "Sharing remains active even before user understands its scope."
            ]
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 4: Enter Facebook account information and log in, which links identities and instantly exposes her activity to synced contacts."
            ],
            "design_problems": [
              "Framing emphasizes 'won't post to Facebook' while obscuring in-app exposure to Facebook contacts.",
              "No pre-connection warning that recent listening (up to 7 days) will be immediately visible to all matched contacts.",
              "No chance to review or limit which Facebook contacts will see activity before syncing.",
              "Default expands the audience without requiring renewed consent for sharing already enabled in the app."
            ]
          }
        ],
        "leakage_source": "The music app's Friend Activity sharing combined with Facebook account syncing.",
        "leak_to": "Synced Facebook contacts who use the music app, including a local land broker and members of Rosa's agricultural co-op.",
        "harms": [
          {
            "harm": "Economic harm",
            "cause": "The app links her identity and auto-shares listening themes suggesting financial stress, enabling a land broker to pressure her with a low offer."
          },
          {
            "harm": "Reputational harm",
            "cause": "Local contacts infer she is selling or in debt from her visible listening, damaging her standing in the co-op."
          },
          {
            "harm": "Psychological harm (emotional distress)",
            "cause": "Unexpected publicity of sensitive interests causes anxiety and fear of exploitation."
          },
          {
            "harm": "Autonomy harm (thwarted expectations and lack of control)",
            "cause": "Unclear audience and instant expansion of sharing after Facebook sync undermine her ability to control who sees her activity."
          },
          {
            "harm": "Relationship harm",
            "cause": "Rumors triggered by visible listening strain ties with neighbors and cooperative members."
          }
        ],
        "consequences": "Rosa is pressured by a broker to accept a lowball land deal, loses trust in local networks as rumors spread, experiences heightened anxiety, and retreats from using digital services—furthering her exclusion from tools and programs that could support her farm."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Leo",
        "age": 17,
        "tech_comfort_level": "high"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Socioeconomic disadvantage - Urban poor teenager",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["social ties", "financial help", "school info"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - school support apps require personal info",
          "Privacy vs. Disclosure of identity - peers might judge background"
        ],
        "privacy_responses": [
          {
            "response": "Withholding disclosure",
            "description": "Uses minimal profile info or anonymous submission."
          },
          {
            "response": "Controlling disclosure",
            "description": "Uses different accounts for school, social, and support."
          }
        ],
        "costs_and_consequences": [
          "Fragmented identity across platforms",
          "Mental effort managing clones"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
          "Privacy vs. Support - access to school apps requires sharing personal details",
          "Privacy vs. Disclosure of identity - fear of peer judgment drives careful control of visibility",
          "Privacy vs. Opportunity - online presence offers benefits but risks surveillance"
      ],
      "privacy_responses": [
          {
            "response": "Reluctant compliance",
            "description": "Shares required data for educational access despite not fully understanding risks."
          },
          {
            "response": "Audience restriction",
            "description": "Uses privacy settings or anonymous posting to limit who can view sensitive content."
          },
          {
            "response": "Self-censorship",
            "description": "Avoids posting about sensitive topics like finances or school struggles to prevent stigma or monitoring."
          }
      ],
      "costs_and_consequences": [
          "Unaware of long-term implications of student data collection",
          "Emotional and cognitive effort in maintaining multiple accounts",
          "Fragmented identity across platforms",
          "Loss of authentic expression",
          "Missed opportunities for support due to withholding information"
      ]
    },
    "stories": [
      {
        "persona_identity": "Leo is a 17-year-old male high school student from a low-income urban neighborhood; he's highly tech-comfortable because he's self-taught, juggling multiple accounts and settings to manage privacy while accessing free tools and support online.",
        "story": "Trying to see what classmates are listening to, Leo turns on sharing so he can use the app's friend feed. It looks empty, so he assumes nothing of his is visible. Later he links his Facebook to find friends, and his recent listening— including a playlist about emergency grants for students—instantly becomes visible to those synced contacts. A classmate notices and starts teasing him in a group chat. Panicked, Leo switches to a private session to hide future activity, but the damage is already done and the recent history remains exposed to those who already saw it.",
        "information_leaked": "Leo's current and recent listening activity (tracks and playlists from the last 7 days), including a playlist about financial hardship resources, along with inferences about his socioeconomic status and school struggles.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow4",
            "step_causing_harm": [
              "Step 4: Switch 'Share my listening activity' to ON while the feed appears empty, leading Leo to believe nothing is visible."
            ],
            "design_problems": [
              "The sharing toggle provides no clear, just-in-time warning that enabling it will expose activity to any future synced friends.",
              "Empty feed state creates a misleading safety cue (thwarted expectations) that nothing will be shared.",
              "No minor-sensitive defaults or protective prompts given Leo's age."
            ]
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 4: Logging into Facebook to connect accounts, which immediately grants many Facebook contacts visibility into Leo's already-enabled listening activity."
            ],
            "design_problems": [
              "No post-connection interstitial summarizing who will gain access and that sharing is currently ON.",
              "Default is broad, immediate sharing to all synced contacts (no granular approval per contact).",
              "No delay or option to review/clear recent listening before exposure."
            ]
          },
          {
            "function": 3,
            "flow_id": "flow1",
            "step_causing_harm": [
              "N/A - mitigation only; the private session is enabled after the leak and does not retroactively hide recent activity."
            ],
            "design_problems": [
              "Private Session offers no retroactive clearing of the last 7 days of activity.",
              "The quick-enable path provides no clear notice about the 6-hour limit or that past listening remains visible."
            ]
          }
        ],
        "leakage_source": "The music app's Friend Activity auto-sharing after Facebook sync (platform-level disclosure), subsequently amplified by a classmate who noticed the feed.",
        "leak_to": "Newly synced Facebook contacts on the app (classmates, after-school counselor, coach); at least one classmate who shared the information in a group chat.",
        "harms": [
          {
            "harm": "Reputational harms",
            "cause": "The app auto-shares Leo's listening history to a wide set of synced contacts without a clear, pre-exposure review step, enabling peers to infer financial hardship."
          },
          {
            "harm": "Psychological harms - emotional distress",
            "cause": "Unexpected exposure of sensitive listening creates embarrassment and anxiety, worsened by peer teasing."
          },
          {
            "harm": "Autonomy harms - thwarted expectations and lack of control",
            "cause": "The empty feed and lack of warnings when turning on sharing mislead Leo about visibility; post-connection exposure occurs before he can review or limit access."
          },
          {
            "harm": "Relationship harms",
            "cause": "Peers' teasing and stigma in school social circles following the exposure of sensitive listening."
          }
        ],
        "consequences": "Leo is mocked in a group chat, deletes the sensitive playlist, and avoids listening to helpful resources on the app. He tightens his settings and self-censors, increasing the mental burden of managing accounts and missing out on potentially valuable support information."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Layla",
        "age": 19,
        "tech_comfort_level": "medium"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Socioeconomic disadvantage - Housing-insecure youth",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["location", "shelter history", "service usage"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - shelter services require registration",
          "Privacy vs. Disclosure of identity - fears data used against housing status"
        ],
        "privacy_responses": [
          {
            "response": "Withholding disclosure",
            "description": "Shares only essential info when asked."
          },
          {
            "response": "Asking for help",
            "description": "Inquires privately from known support organizations."
          }
        ],
        "costs_and_consequences": [
          "Reduced access to certain support if incomplete",
          "Risk of trusting unreliable guidance"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
          "Privacy vs. Support - data disclosure required for access to shelter or services",
          "Privacy vs. Location safety - phones provide support access but risk exposure of movement or shelter locations",
          "Privacy vs. Digital continuity - erasing digital traces protects privacy but disrupts records"
      ],
      "privacy_responses": [
          {
            "response": "Minimal disclosure",
            "description": "Shares only what is absolutely necessary during intake processes to reduce risk."
          },
          {
            "response": "Limiting phone use",
            "description": "Restricts use of apps or services perceived as risky in order to protect sensitive data."
          },
          {
            "response": "Data deletion and wiping",
            "description": "Actively removes sensitive information from devices to prevent exposure."
          }
      ],
      "costs_and_consequences": [
          "Incomplete disclosures may restrict access to critical resources",
          "Persistent mistrust of service providers",
          "Reduced access to safety-enhancing features and communication tools",
          "Isolation from potential support networks",
          "Loss of valuable records or communication history",
          "Additional stress from needing constant digital hygiene practices"
      ]
    },
    "stories": [
      {
        "persona_identity": "Layla is a 19-year-old woman working part-time at a café; as a housing-insecure youth, she's cautious about what she shares. Her tech comfort is medium because she's used phones and apps at libraries and shelters but hasn't had consistent guidance or stable access.",
        "story": "Layla turns on friend activity in her music app to feel connected and switches on sharing so mutual friends can see what she's listening to. Later that night she starts a private session while playing a calming playlist published by the local youth shelter, assuming it will stay private. After several hours, the private session silently ends and her listening is once again visible. Worried about who can see her activity, she unfollows a classmate to reduce exposure. The next day, hoping to find a mentor, she connects her Facebook to add more friends; the app pulls in many contacts, including that same classmate and a coworker. Because sharing is on, they immediately see her recent plays, including the shelter's playlist, revealing she's using those services.",
        "information_leaked": "Her use of a local youth shelter's services (inferred from listening to a shelter-branded playlist), approximate late-night activity patterns, and ongoing engagement with support resources via the music app.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow5",
            "step_causing_harm": [
              "Step 4: Switch 'Share my listening activity' to ON, enabling her activity to be visible to friends."
            ],
            "design_problems": [
              "Scope ambiguity: the toggle does not clearly explain who will see activity now or after new connections are added.",
              "Nudge framing: prompts encourage enabling sharing without a just-in-time summary of exposure."
            ]
          },
          {
            "function": 3,
            "flow_id": "flow4",
            "step_causing_harm": [
              "Step 3: Private Session automatically ends after 6 hours without a persistent alert, returning her to public sharing."
            ],
            "design_problems": [
              "Silent auto-expiration with only a subtle icon change; no prominent reminder or renewal prompt.",
              "Expectation mismatch: users can believe they remain private overnight when they do not."
            ]
          },
          {
            "function": 4,
            "flow_id": "flow2",
            "step_causing_harm": [
              "Step 2: Unfollowing a mutual friend removes them from her feed but does not prevent their reappearance via future Facebook sync."
            ],
            "design_problems": [
              "Fragmented control: unfollow lacks warning that Facebook sync can re-add the same person as a separate connection type.",
              "No 'hide me from this person' or cross-channel block option to persist across connection mechanisms."
            ]
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 4: Successful Facebook login auto-syncs many contacts without selection, instantly exposing her current listening (since sharing is ON) to those contacts."
            ],
            "design_problems": [
              "Bundled consent: no granular selection of which Facebook friends to add.",
              "Misleading reassurance: message focuses on not posting to Facebook, obscuring in-app exposure to Facebook friends.",
              "No post-sync privacy checkpoint to confirm or limit who can see her activity."
            ]
          }
        ],
        "leakage_source": "The music app's default sharing settings combined with Facebook auto-sync and the silent expiration of Private Session.",
        "leak_to": "Newly synced Facebook friends (e.g., a classmate and a café coworker) and any mutual in-app friends who can view her activity.",
        "harms": [
          {
            "harm": "Reputational harm",
            "cause": "Friend Activity reveals she listens to a shelter-branded playlist, letting acquaintances infer she uses housing support."
          },
          {
            "harm": "Psychological harm (emotional distress)",
            "cause": "Loss of control over who sees sensitive listening triggers anxiety about gossip and stigma."
          },
          {
            "harm": "Autonomy harms (failure to inform, thwarted expectations, lack of control)",
            "cause": "Private Session auto-ends without clear notice; unfollowing does not prevent reappearance after Facebook sync; sharing scope is unclear when enabling and after syncing."
          },
          {
            "harm": "Relationship harms",
            "cause": "Coworkers/classmates gain sensitive knowledge that can strain social and workplace interactions."
          }
        ],
        "consequences": "A coworker makes a comment about the shelter playlist, prompting rumors; Layla avoids the shelter's digital resources and stops using the app, losing a coping tool and support links, while experiencing increased stress and mistrust of online services."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Samir",
        "age": 33,
        "tech_comfort_level": "low"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Internal and experiential factors - Survivor of domestic violence",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["location", "communications", "support usage"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - contacting services may alert abuser",
        "Privacy vs. Autonomy - needs to hide usage from partner",
        "Privacy vs. Safety - surveillance forces reliance on insecure or temporary devices"
        ],
        "privacy_responses": [
          {
            "response": "Physical workarounds",
            "description": "Uses hidden browser history, private mode, or borrowed device."
          },
          {
          "response": "Non-use",
            "description": "Avoids apps that could leave trace."
        },
        {
          "response": "Use of borrowed devices",
          "description": "Communicates through public or borrowed devices to prevent abuser detection."
          }
        ],
        "costs_and_consequences": [
          "Harder to seek help quickly",
        "Isolation and continued risk",
        "Inconsistent and less reliable access to digital resources",
        "Added stress from secrecy and fear of being discovered"
      ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
        "Privacy vs. Support - surveillance deters safe communication with services",
        "Privacy vs. Autonomy - requires trusted outsiders to secure devices",
        "Privacy vs. Safety - surveillance forces reliance on insecure or temporary devices"
      ],
      "privacy_responses": [
        {
          "response": "Abandoning device use",
          "description": "Stops or minimizes use of personal devices suspected of being monitored."
        },
        {
          "response": "Seeking professional support",
          "description": "Relies on clinicians or advocates for secure device setup and monitoring checks."
        },
        {
          "response": "Use of borrowed devices",
          "description": "Communicates through public or borrowed devices to prevent abuser detection."
        }
      ],
      "costs_and_consequences": [
          "Reduced ability to access timely help",
          "Heightened isolation due to limited communication",
          "Dependency on external assistance to maintain digital safety",
          "Possible delays in regaining safe communication",
          "Inconsistent and less reliable access to digital resources",
          "Added stress from secrecy and fear of being discovered"
      ]
    },
    "stories": [
      {
        "persona_identity": "Samir is a 33-year-old man working as a night-shift cashier; as a survivor of domestic violence, he often relies on borrowed computers and avoids complex settings, which contributes to his low tech comfort because he fears misconfiguring privacy options.",
        "story": "Using a borrowed desktop at a community center, Samir opened his music app to distract himself and see what friends were listening to. The app prompted him to turn on sharing so he could view others' activity, and he agreed, assuming he could stay hidden by starting a private session. Later, wanting to find more familiar faces, he connected his Facebook account so his contacts would appear in the feed. That connection also brought in his abusive ex-partner, who could now see Samir's listening whenever private mode ended. After the private session automatically expired hours later, Samir's listening to a support-related playlist became visible to that ex-partner. That night, he received a threatening message referencing the exact tracks he had played, revealing that the app had exposed what he'd hoped to keep private.",
        "information_leaked": "Real-time and recent listening activity (track and playlist titles), support-related content consumption, timing patterns of app use, and implied location or support-seeking behavior inferred from playlist names.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": [
              "Step 7: Find 'Share my listening activity' and switch the toggle button to ON."
            ],
            "design_problems": [
              "Nudging to enable sharing in order to view friends' activity couples two separate choices.",
              "No clear, prominent warning about who exactly will see the user's activity once sharing is on.",
              "No per-contact controls or immediate opt-out for sensitive contacts."
            ]
          },
          {
            "function": 3,
            "flow_id": "flow4",
            "step_causing_harm": [
              "Step 3: Private Session automatically ends after 6 hours, removing protection without an explicit re-consent."
            ],
            "design_problems": [
              "Auto-expiration of private mode without a persistent, high-salience warning or countdown.",
              "Reliance on a small status icon that is easy to miss for critical privacy state.",
              "Default reversion to public sharing instead of maintaining the last privacy-preserving state."
            ]
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 4: Enter Facebook account information and link accounts, which imports all Facebook friends into the app's social graph."
            ],
            "design_problems": [
              "All-or-nothing Facebook import with no pre-sync review or blocklist to prevent high-risk contacts from being added.",
              "Reassurance about not posting to Facebook obscures the risk of in-app exposure to Facebook contacts.",
              "No just-in-time alert that specific high-risk contacts will gain visibility of listening once private mode ends."
            ]
          }
        ],
        "leakage_source": "The music app's Friend Activity feature, after Samir enabled sharing and linked his Facebook contacts.",
        "leak_to": "Samir's abusive ex-partner (still connected via Facebook), and potentially other Facebook contacts on the app.",
        "harms": [
          {
            "harm": "Physical harms (increased risk of being located or confronted).",
            "cause": "The app exposed sensitive listening patterns and support-seeking content to a high-risk contact after private mode automatically expired."
          },
          {
            "harm": "Psychological harms (emotional distress and fear).",
            "cause": "Unexpected visibility of intimate listening choices to the abuser generated anxiety and intimidation."
          },
          {
            "harm": "Autonomy harms (failure to inform, lack of control, thwarted expectations).",
            "cause": "Coupled settings, ambiguous disclosures, and auto-expiring privacy led to unintended sharing without clear, ongoing consent."
          },
          {
            "harm": "Relationship harms (harassment escalation).",
            "cause": "The abuser used the exposed listening details to reinitiate unwanted contact and threats."
          }
        ],
        "consequences": "Samir received threatening messages referencing his support-related listening, stopped using the app, avoided seeking help through audio resources, and further isolated himself due to fear of being tracked, delaying access to support and increasing stress."
      }
    ]
  },
  {
    "basic_info": {
      "name": "Joy",
      "age": 38,
      "tech_comfort_level": "medium"
    },
    "contextual_info": {
      "vulnerability_type_brief_description": "Internal and experiential factors - Formerly incarcerated individual",
      "privacy_awareness_level": "moderate",
      "information_cared_about": ["criminal record", "rehabilitation history", "job applications"]
    },
    "privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
        "Privacy vs. Support - reentry services require sharing records",
        "Privacy vs. Disclosure of identity - fear stigma by employers"
      ],
      "privacy_responses": [
        {
          "response": "Controlling disclosure",
          "description": "Sets up separate contact information for job-search and activism."
        },
        {
          "response": "Privacy lies",
          "description": "Minimizes detail about conviction when possible."
        }
      ],
      "costs_and_consequences": [
        "Legal risk if false info discovered",
        "Emotional burden of managing identity"
      ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
          "Privacy vs. Disclosure of identity - fear of ongoing monitoring after release",
          "Privacy vs. Support - digital engagement needed for reentry but feared for exposure",
          "Privacy vs. Employment - digital applications risk exposing incarceration history"
      ],
      "privacy_responses": [
          {
            "response": "Self-censorship",
            "description": "Avoids sensitive details in communication due to fear of monitoring or later repercussions."
          },
          {
            "response": "Multiple identities",
            "description": "Creates distinct online accounts to separate personal life from reentry support or job search."
          },
          {
            "response": "Reluctance to apply online",
            "description": "Avoids digital job applications to prevent automatic rejection or stigma."
          }
      ],
      "costs_and_consequences": [
          "Emotional strain from suppressing authentic communication",
          "Fear of lasting surveillance undermines trust in digital tools",
          "Managing fragmented digital identities requires ongoing effort",
          "Limited openness can reduce opportunities for authentic social or professional connections",
          "Missed access to employment opportunities",
          "Continued economic vulnerability due to reluctance to use digital reentry systems"
      ]
    },
    "stories": [
      {
        "persona_identity": "Joy (she/her) is a 38-year-old community center kitchen assistant rebuilding her life after incarceration; she's a medium-tech user who learned to navigate apps through reentry classes and can handle everyday features but often misses hidden privacy controls.",
        "story": "Preparing for a job interview, Joy wanted to see what friends were listening to and ended up enabling sharing so her own listening would appear to people connected to her. To find more friends, she linked her account to Facebook. That night, she started a private session to quietly listen to reentry support content that helps her manage stress, assuming it would stay private. Hours later, the private session ended without her noticing, and her ongoing listening was broadcast to people synced from Facebook. The next day, a Facebook acquaintance who works for a staffing partner of the employer she applied to saw Joy's activity and inferred her reentry status. When Joy tried to remove that person from her feed, the connection persisted because it was tied to Facebook. She felt exposed and powerless as the information spread beyond what she intended.",
        "information_leaked": "Joy's real-name identity (via Facebook linkage) tied to her music app profile; her listening activity and recently played reentry-related content; timestamps indicating when she was active; her network ties to Facebook acquaintances now visible through the music app.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": [
              "Step 7: Find 'Share my listening activity' and switch the toggle to ON."
            ],
            "design_problems": [
              "Couples the desire to view friends' activity with enabling sharing of the user's own activity, creating unclear reciprocity.",
              "Insufficient just-in-time explanation of who exactly will see the user's listening once sharing is enabled.",
              "No granular audience controls (e.g., limit to specific people) at the moment of enabling."
            ]
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 4: Enter Facebook account information and click 'Log In' (successful link)."
            ],
            "design_problems": [
              "Broad Facebook sync expands the audience instantly without granular selection (e.g., choose which friends to connect).",
              "Lack of a clear pre-link warning that Facebook friends who use the app may now see the user's listening due to the active sharing setting.",
              "No onboarding step to review visibility defaults after connecting Facebook."
            ]
          },
          {
            "function": 3,
            "flow_id": "flow4",
            "step_causing_harm": [
              "Step 3: System confirms Private Session has reached 6 hours and automatically ends."
            ],
            "design_problems": [
              "Auto-expiry of Private Session resumes sharing by default without a prominent alert or opt-in confirmation.",
              "Reliance on a subtle status indicator rather than an interruption or reminder before exposure resumes.",
              "No option to set Private Session to persist until explicitly turned off."
            ]
          },
          {
            "function": 4,
            "flow_id": "flow3",
            "step_causing_harm": [
              "Step 3: Click on the 'Unfollow' button; system identifies the user as a synced Facebook friend and the person remains visible/connected."
            ],
            "design_problems": [
              "Unfollow does not sever Facebook-based connections, but this is not made clear to the user.",
              "No inline option to remove or edit Facebook sync for that individual from the same screen.",
              "Creates an illusion of control: the user expects unfollowing to stop mutual visibility, but it does not."
            ]
          }
        ],
        "leakage_source": "The music app's Friend Activity feature, which broadcast Joy's listening after she enabled sharing and linked Facebook, and then resumed sharing when Private Session auto-expired.",
        "leak_to": "A Facebook acquaintance who works as a staffing coordinator at a local employer (and potentially other synced Facebook friends who use the app).",
        "harms": [
          {
            "harm": "Reputational Harms",
            "cause": "The app tied Joy's real-name Facebook identity to her listening history and surfaced reentry-related content to acquaintances who could infer her incarceration history."
          },
          {
            "harm": "Economic Harms",
            "cause": "The staffing coordinator used the information to negatively reassess Joy's candidacy, contributing to a lost job opportunity."
          },
          {
            "harm": "Psychological Harms — Emotional Distress",
            "cause": "Unexpected exposure of sensitive listening triggered anxiety and shame, especially given her efforts to control disclosure."
          },
          {
            "harm": "Autonomy Harms — Thwarted Expectations and Lack of Control",
            "cause": "Sharing was turned on while she was pursuing friend discovery; Private Session ended automatically; and unfollowing did not remove a Facebook-synced connection, undermining her control."
          },
          {
            "harm": "Relationship Harms",
            "cause": "The acquaintance's discovery strained Joy's professional relationship with a potential employer and damaged trust in her social network."
          }
        ],
        "consequences": "Joy's application was quietly dropped by the staffing partner. She withdrew from using the app for support content, disconnected from helpful communities, and created yet another account to compartmentalize her identity—adding to emotional burden and ongoing effort to manage privacy. She missed a near-term income opportunity and became more reluctant to engage with digital tools she needs for reentry."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Ben",
        "age": 27,
        "tech_comfort_level": "medium"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Internal and experiential factors - Person with severe anxiety",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["mental health data", "support group usage", "location"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - mental health apps track usage",
          "Privacy vs. Disclosure of identity - stigma about anxiety"
        ],
        "privacy_responses": [
          {
            "response": "Withholding disclosure",
            "description": "Avoids linking real identity to mental health apps."
          },
          {
          "response": "Privacy-enhancing technologies",
          "description": "Uses anonymous accounts or privacy-respecting platforms."
          }
        ],
        "costs_and_consequences": [
          "Less personalized recommendations",
          "Difficult to maintain continuity in support"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
          "Privacy vs. Support - monitoring features undermine sense of safety",
          "Privacy vs. Disclosure of identity - anonymity helps manage anxiety but limits openness",
          "Privacy vs. Mental well-being - breaches amplify anxiety symptoms"
      ],
      "privacy_responses": [
        {
          "response": "Avoidance of apps",
          "description": "Chooses not to use certain mental health apps that track too much personal data."
        },
        {
          "response": "Anonymous communication",
          "description": "Engages in support groups or online spaces using anonymous or text-only interactions to manage anxiety."
        },
        {
          "response": "Heightened caution",
          "description": "Becomes more cautious about where and how personal information is shared online after exposure to breaches."
        }
      ],
      "costs_and_consequences": [
          "Missed opportunities for supportive digital interventions",
          "Increased anxiety from perception of being surveilled",
          "Restricted ability to form deeper or more personal online connections",
          "Reinforcement of avoidance behaviors tied to anxiety",
          "Chronic stress from fear of potential misuse of data",
          "Reduced engagement with digital platforms due to breach concerns"
      ]
    },
    "stories": [
      {
        "persona_identity": "Ben is a 27-year-old male customer support representative who manages severe anxiety; his job's constant digital communication increases stress. He has medium tech comfort because he uses desktop tools at work daily but avoids advanced settings that might trigger mistakes or data exposure.",
        "story": "Trying to feel less isolated during a rough week, Ben turned on sharing in the music app so he could see what friends were listening to and feel connected. He unfollowed one acquaintance to limit who he saw, which reassured him. Later, he used the app's Facebook connection to find more people to follow. Without realizing it, this immediately let his Facebook contacts on the app see that he was listening to anxiety coping playlists and mental health podcasts under his real name. A coworker noticed and mentioned it in a team chat, leaving Ben shaken and embarrassed.",
        "information_leaked": "Ben's real identity linked to his account; the fact he listens to mental health content (e.g., anxiety coping playlists, meditation tracks, therapy podcasts); recent listening timestamps and frequency patterns; the existence of specific mental-health-themed playlists in his library.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": [
              "Step 7: Find 'Share my listening activity' and switch the toggle button to ON."
            ],
            "design_problems": [
              "Ambiguous scope: Turning on 'Share my listening activity' doesn't warn that future Facebook-connections will immediately gain visibility of current listening.",
              "No granular controls: Cannot pre-limit visibility to specific groups before enabling sharing.",
              "Conflation: Seeing friends' activity and broadcasting one's own are intertwined in setup, nudging users to share."
            ]
          },
          {
            "function": 4,
            "flow_id": "flow2",
            "step_causing_harm": [
              "Step 2: Click on the 'Following' button (successfully unfollows a mutual friend, creating a false sense that visibility is now limited)."
            ],
            "design_problems": [
              "Scope opacity: Removing one person provides no disclosure that new connections (e.g., via Facebook sync later) will still see future activity.",
              "Missing guidance: No prompts linking to audience controls or warning about broader sharing rules after unfollowing."
            ]
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 4: Enter Facebook account information and click 'Log In' (successful connection automatically syncs contacts and exposes Ben's ongoing listening to them because sharing was already ON)."
            ],
            "design_problems": [
              "Default broadcast: Auto-syncing immediately expands the audience without explicit re-consent to share activity with newly added contacts.",
              "Misleading reassurance: Messaging about not posting to Facebook omits that in-app visibility to Facebook friends increases.",
              "No per-contact or category-based opt-in: Lacks a step to choose which Facebook contacts can see activity before enabling sync."
            ]
          }
        ],
        "leakage_source": "The music app's Friend Activity feature and Facebook sync integration (system defaults and auto-sharing behavior).",
        "leak_to": "A coworker who is a Facebook contact and uses the music app, as well as other Facebook friends who use the app.",
        "harms": [
          {
            "harm": "Psychological harm (emotional distress, anxiety spike).",
            "cause": "The app auto-broadcasts sensitive listening activity to newly synced contacts, revealing mental health struggles without clear, contextual consent."
          },
          {
            "harm": "Reputational harm.",
            "cause": "Coworkers can infer mental health status from visible listening, creating stigma at work."
          },
          {
            "harm": "Autonomy harms (Thwarted Expectations; Lack of Control; Failure to Inform).",
            "cause": "Interface fails to explain that enabling sharing plus later Facebook syncing expands the audience; removal of one friend does not protect against new connections."
          },
          {
            "harm": "Relationship harm.",
            "cause": "A coworker discusses Ben's listening in a team setting, straining professional relationships."
          }
        ],
        "consequences": "Ben experiences a panic episode, deletes playlists and turns features off, and avoids the app—reducing his self-care routines. At work, he becomes quieter in meetings after the incident, and his manager shifts him away from client-facing tasks due to perceived instability."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Alice",
        "age": 68,
        "tech_comfort_level": "low"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Internal and experiential factors - Socially isolated senior",
        "privacy_awareness_level": "low",
      "information_cared_about": ["contact list", "location check-ins", "health alerts"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - family wants tracking for safety",
          "Privacy vs. Autonomy - resists location-sharing"
        ],
        "privacy_responses": [
          {
          "response": "Third-party protections",
            "description": "Family sets up monitoring apps on her behalf."
          },
          {
            "response": "Apathy",
            "description": "Does not engage with settings or privacy features."
          }
        ],
        "costs_and_consequences": [
          "Loss of independence",
        "Potential over-monitoring with limited consent"
      ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
          "Privacy vs. Autonomy - reliance on others reduces independence",
          "Privacy vs. Safety - older adults deprioritize privacy for perceived safety",
          "Privacy vs. Support - monitoring helps detect loneliness but compromises personal space"
      ],
      "privacy_responses": [
          {
            "response": "Delegated control",
            "description": "Relies on family or caregivers to configure monitoring and privacy settings."
          },
          {
            "response": "Apathy toward privacy",
            "description": "Chooses not to engage with privacy settings or protections, seeing them as unnecessary."
          },
          {
            "response": "Conditional acceptance of monitoring",
            "description": "Agrees to passive monitoring only when framed as supportive, despite discomfort with constant observation."
          }
      ],
      "costs_and_consequences": [
          "Loss of independence in decision-making",
          "Potential exposure to monitoring without informed consent",
          "Increased exposure to potential misuse of personal data",
          "Weaker control over how personal information is shared",
          "Loss of sense of privacy in the home",
          "Potential misinterpretation of personal behaviors leading to unnecessary interventions"
      ]
    },
    "stories": [
      {
        "persona_identity": "Alice is a 68-year-old retired school librarian and grandmother. As a socially isolated senior, she's vulnerable to over-monitoring by family; her low tech comfort comes from relying on others to set up devices and rarely exploring settings herself.",
        "story": "Feeling lonely one evening, Alice tried to see what her family was listening to and followed in-app prompts to start sharing and connect her account to Facebook so she could find familiar faces. Almost immediately, her late-night plays of grief and insomnia playlists became visible to her Facebook contacts who also use the music app. Her son, alarmed, contacted neighbors and her doctor to check on her. Embarrassed, Alice attempted to remove him from seeing her listening activity but learned he remained linked through Facebook. She then turned on a private listening mode to stop further sharing, but the damage was done, leaving her feeling exposed and less inclined to use the app for the calming content she relies on.",
        "information_leaked": "Alice's current and recent listening activity (track and playlist titles), time-of-day patterns of use (late-night sessions), her display name/profile as linked to Facebook, and the linkage to her Facebook friend graph (exposing which contacts can see her activity).",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 7: Find 'Share my listening activity' and switch the toggle button to ON."
            ],
            "design_problems": [
              "Ambiguous guidance normalizes turning on sharing without clarifying who will see it once contacts are added.",
              "No just-in-time warning that enabling sharing will expose recent listening to all synced contacts after connection."
            ]
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 4: Enter Facebook account information and click 'Log In' (successful authorization links Facebook friend list and enables their visibility in Friend Activity)."
            ],
            "design_problems": [
              "Message about not posting to Facebook may mislead users into thinking there's no cross-audience exposure inside the music app.",
              "No audience review or granular controls at connect-time (e.g., choose which contacts can see or be seen).",
              "No confirmation that enabling sharing + Facebook sync means newly synced contacts can immediately see recent listening."
            ]
          },
          {
            "function": 4,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 2: Click on the 'Following' button (system identifies the person as a synced Facebook friend; the person still appears and can see activity)."
            ],
            "design_problems": [
              "Unfollow does not remove visibility for synced Facebook friends, contradicting user expectations.",
              "No clear path or explanation to hide activity from specific synced contacts without blocking.",
              "Lack of feedback explaining why the person still has access after unfollowing."
            ]
          },
          {
            "function": 3,
            "flow_id": "flow1",
            "step_causing_harm": [],
            "design_problems": []
          }
        ],
        "leakage_source": "The music app's Friend Activity feature after enabling sharing and syncing Facebook friends.",
        "leak_to": "Alice's Facebook contacts who use the music app and have Friend Activity enabled, including her adult son and a nearby neighbor.",
        "harms": [
          {
            "harm": "Psychological harm (emotional distress and embarrassment).",
            "cause": "The app surfaces Alice's late-night, health-related listening to synced contacts without clear, granular consent at the moment of connection."
          },
          {
            "harm": "Autonomy harm (failure to inform, lack of control, thwarted expectations).",
            "cause": "The app does not clearly explain that turning on sharing plus Facebook sync immediately exposes recent listening to many contacts, and it prevents easy removal of specific synced contacts."
          },
          {
            "harm": "Relationship harm.",
            "cause": "Family and neighbors interpret her listening as a crisis, escalating interventions that strain trust and increase surveillance."
          },
          {
            "harm": "Reputational harm.",
            "cause": "Health-related and grief-themed listening is visible to community contacts, inviting stigma or judgment."
          },
          {
            "harm": "Autonomy harm (chilling effects).",
            "cause": "After the incident, Alice avoids using the app for supportive audio, reducing beneficial activities."
          }
        ],
        "consequences": "Her son triggers a wellness check and pushes for stricter monitoring on her devices, leading to increased surveillance and loss of independence. Alice feels ashamed and stops listening to the calming playlists that helped her sleep, worsening her sense of isolation."
      }
      ]
    },
    {
      "basic_info": {
        "name": "David",
        "age": 31,
        "tech_comfort_level": "medium"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Internal and experiential factors - Individual with history of addiction",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["support group attendance", "treatment history", "peer network"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - support groups want attendance logs",
          "Privacy vs. Disclosure of identity - fear stigma in community"
        ],
        "privacy_responses": [
          {
            "response": "Privacy lies",
            "description": "Gives ambiguous details or pseudonymous attendance."
          },
          {
            "response": "Controlling disclosure",
            "description": "Keeps separate email/accounts for recovery chats."
          }
        ],
        "costs_and_consequences": [
          "Potential breach of trust if deception revealed",
          "Labor managing multiple identities"
        ]
    },
    "additional_privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Treatment Access - telehealth sites requiring disclosure risk exposing sensitive data",
          "Privacy vs. Stigma - fear of information leakage to employers or insurers"
        ],
        "privacy_responses": [
          {
          "response": "Selective platform use",
          "description": "Chooses telehealth services with stronger privacy policies or avoids those known for third-party tracking."
          },
          {
          "response": "Limiting disclosure online",
          "description": "Minimizes details shared on telehealth platforms to reduce risk of exposure."
          }
        ],
        "costs_and_consequences": [
          "Restricted access to potentially helpful telehealth resources",
          "Increased mental burden from evaluating privacy policies",
          "Persistent fear of data misuse leading to delayed or avoided treatment"
      ]
    },
    "stories": [
      {
        "persona_identity": "David is a 31-year-old man working as a warehouse shift lead; he's in recovery from opioid addiction, which heightens his sensitivity to stigma. He's medium-tech-comfortable because he uses logistics software and common apps at work, but he's not confident about nuanced privacy controls.",
        "story": "Looking for a little motivation during a long shift, David turned on the app's friend activity feature to feel connected and, following the app's prompts, enabled sharing so the feed would work. A coworker who's also his Facebook contact soon messaged him about a recovery playlist David had just played, joking about it in the team chat. David, who usually keeps recovery life strictly separate with alternate accounts, tried to remove this coworker from his feed, but the person stayed connected through the Facebook sync. Feeling exposed and unable to control who sees his listening, David stopped playing recovery tracks at work and skipped an online support session that evening to avoid further exposure.",
        "information_leaked": "Real-time and recent listening activity tied to David's identity (including recovery-themed playlists and episodes), timing of playback that can suggest support-group routines, and recently played artists shown on his public profile by default.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": [
              "Step 7: Switch 'Share my listening activity' to ON, which broadcasts David's listening to synced Facebook and mutual-followed contacts."
            ],
            "design_problems": [
              "No clear audience selector or explanation that Facebook-synced contacts will immediately see activity when sharing is enabled.",
              "Privacy-sensitive defaults (e.g., 'Show my recently played artists on my public profile') are ON, quietly broadening exposure.",
              "Social nudge to enable sharing to make the feature useful, without guardrails or a preview of who will see the data."
            ]
          },
          {
            "function": 4,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 2: Click on 'Following' to remove the coworker, which does not sever Facebook-synced connections or stop them from seeing David's activity."
            ],
            "design_problems": [
              "Unfollow behaves differently for Facebook-synced contacts without explaining that they remain connected.",
              "No per-contact exclusion or immediate block path for synced contacts; the management model is opaque, prolonging unwanted exposure."
            ]
          }
        ],
        "leakage_source": "The music app's Friend Activity feature auto-sharing to Facebook-synced contacts after David enabled 'Share my listening activity.'",
        "leak_to": "A coworker who is a synced Facebook friend in the app.",
        "harms": [
          {
            "harm": "Reputational harms",
            "cause": "Coworker infers David's addiction history from recovery-themed listening broadcast by the app."
          },
          {
            "harm": "Psychological harms — emotional distress",
            "cause": "Unexpected exposure of sensitive recovery behavior triggers anxiety and embarrassment."
          },
          {
            "harm": "Autonomy harms — lack of control and thwarted expectations",
            "cause": "Enabling sharing lacks clear audience controls, and unfollowing does not remove Facebook-synced contacts, preventing effective control."
          },
          {
            "harm": "Relationship harms",
            "cause": "Workplace dynamics are strained by teasing and potential gossip following the exposure."
          },
          {
            "harm": "Autonomy harms — chilling effects",
            "cause": "David curtails beneficial recovery listening and avoids support activity to prevent further leakage."
          }
        ],
        "consequences": "After the coworker comments in a team chat, David stops using recovery playlists at work and skips a scheduled online support session, increasing his stress and undermining his recovery routine."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Kiran",
        "age": 34,
        "tech_comfort_level": "medium"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Structural and institutional exclusion - Disenfranchised ethnic minority",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["ethnic identity", "public records", "education history"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Disclosure of identity - registry data may be discriminatory",
          "Privacy vs. Support - identity needed for benefits but risky"
        ],
        "privacy_responses": [
          {
            "response": "Withholding disclosure",
            "description": "Uses partial identity when signing up for services."
          },
          {
            "response": "Privacy lies",
            "description": "Provides ambiguity around ethnic background."
          }
        ],
        "costs_and_consequences": [
          "Denied or delayed access to services",
          "Risk of detection or misrepresentation"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
        "Privacy vs. Disclosure of ethnic identity - disclosing can invite discrimination",
        "Privacy vs. Access to support - withholding identity may block benefits"
      ],
      "privacy_responses": [
        {
          "response": "Withholding or altering disclosure",
          "description": "Participants avoided or modified details about their ethnic identity to minimize risks of discrimination while using online services."
        },
        {
          "response": "Strategic ambiguity",
          "description": "Some individuals employed vagueness or partial disclosure as a tactic to protect themselves from profiling while still attempting to access services."
        }
      ],
      "costs_and_consequences": [
          "Restricted or delayed access to essential services due to incomplete disclosure",
          "Increased stress and fear of discriminatory treatment if disclosure occurs",
          "Risk of being flagged for misrepresentation when providing ambiguous or false information"
      ]
    },
    "stories": [
      {
        "persona_identity": "Kiran (he/him) is a 34-year-old public library program coordinator from a disenfranchised ethnic minority. He's medium in tech comfort because he uses desktop apps daily for scheduling and virtual workshops but avoids digging into complex privacy settings.",
        "story": "Kiran enabled his app's friend activity feature so he could keep up with what colleagues were discovering. To make the feed work, he turned on sharing of his own listening. Later that week, he started a private session before playing a long mix of protest songs and heritage-language tracks while preparing lesson plans. After several hours, the private session expired without a clear alert, and the app resumed broadcasting his listening to followers. A coworker who follows him on the app saw the updates, which hinted at Kiran's ethnic background and political interests. Word spread at work, and the change in how some colleagues treated him was immediate.",
        "information_leaked": "Kiran's real-time and recent listening activity (track names, playlists, timestamps), genres and language revealing his ethnic identity and political interests; visibility to mutual followers and any previously synced friends.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": [
              "Step 7: Find 'Share my listening activity' and switch the toggle button to ON."
            ],
            "design_problems": [
              "Bundling: To view friends' activity, the app nudges users toward enabling their own sharing.",
              "Lack of audience controls: No granular choice (e.g., exclude coworkers) when turning sharing on.",
              "Insufficient warning: No clear, just-in-time explanation that turning this on broadcasts activity to all followers and synced contacts."
            ]
          },
          {
            "function": 3,
            "flow_id": "flow4",
            "step_causing_harm": [
              "Step 3: System ends the Private Session automatically after 6 hours."
            ],
            "design_problems": [
              "Silent expiry: Private Session auto-ends without a proactive, persistent alert.",
              "Risky default reversion: After expiry, sharing resumes automatically instead of defaulting to privacy.",
              "Ambiguous status cue: The small icon change is easy to miss during long listening sessions."
            ]
          }
        ],
        "leakage_source": "The music app's Friend Activity feed and its default-sharing behavior after Private Session expiry.",
        "leak_to": "Mutual followers on the app, including a coworker who follows Kiran; any previously synced social contacts who can see his activity.",
        "harms": [
          {
            "harm": "Reputational harm",
            "cause": "The app publicly surfaced listening that signals ethnic identity and political views to workplace contacts."
          },
          {
            "harm": "Psychological harm (emotional distress)",
            "cause": "Unexpected exposure led to anxiety about being judged and singled out at work."
          },
          {
            "harm": "Autonomy harm (thwarted expectations and failure to inform)",
            "cause": "Design tied viewing friends to sharing and auto-ended privacy mode without clear notification, undermining informed control."
          },
          {
            "harm": "Discrimination harm",
            "cause": "The visible listening cues enabled bias from colleagues, potentially impacting opportunities or treatment."
          },
          {
            "harm": "Relationship harm",
            "cause": "Coworkers' perceptions shifted after seeing sensitive listening activity, straining professional relationships."
          }
        ],
        "consequences": "Kiran received cool comments about his music, was excluded from a public-facing program he'd requested, and now avoids using the app at work. He feels pressure to self-censor and plans to create a new account with obscured identity, at the cost of losing his existing network."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Jose",
        "age": 26,
        "tech_comfort_level": "high"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Intersectional identities and characteristics - Migrant laborer",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["immigration status", "location tracking", "work history"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - some platforms require status disclosure",
        "Privacy vs. Autonomy - surveillance via location-based check-ins"
        ],
        "privacy_responses": [
          {
            "response": "Controlling disclosure",
            "description": "Uses separate phone or SIM to minimize linking."
          },
          {
            "response": "Privacy lies",
            "description": "Provides generic information in employer-platforms."
          }
        ],
        "costs_and_consequences": [
          "Less reliable communication with official services",
          "Risk of sanctions if status exposed"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
          "Privacy vs. Employment Security - disclosure of immigration status as a condition of work",
          "Privacy vs. Autonomy - constant monitoring by smart devices limits freedom",
          "Privacy vs. Support Access - platforms require sensitive disclosures for services"
      ],
      "privacy_responses": [
        {
          "response": "Minimizing disclosure",
          "description": "Withholds or downplays sensitive details like immigration documents unless strictly required."
        },
        {
          "response": "Strategic avoidance",
          "description": "Alters behavior or avoids certain areas of the home to reduce exposure to monitoring devices."
        },
        {
          "response": "Use of pseudonyms",
          "description": "Creates alternate accounts or uses different names to safeguard identity while accessing services."
        }
      ],
      "costs_and_consequences": [
        "Fear of job loss if disclosure is resisted",
        "Persistent anxiety about exposure of immigration status",
        "Loss of personal autonomy in living spaces",
        "Emotional stress from continuous monitoring",
        "Difficulty in accessing official services with pseudonymous accounts",
        "Risk of being denied support if information is inconsistent"
      ]
    },
    "stories": [
      {
        "persona_identity": "Jose is a 26-year-old male construction worker and migrant laborer. His high tech comfort comes from helping crewmates set up dual-SIM phones and privacy tools to keep personal and work lives separated, a strategy shaped by his vulnerable employment and immigration context.",
        "story": "Trying to feel less isolated on long shifts, Jose turns on sharing so he can see what friends are listening to. Later that day he starts a private session to discreetly play a migrant-rights podcast during his commute, assuming it will stay private. Hours pass, and after work he connects the music app to his Facebook to find familiar faces. A coworker instantly sees his recent listening in the app's friend feed and mentions it in the break area. When Jose tries to remove that coworker from his feed, the connection stays because it came from Facebook, leaving him exposed. The coworker repeats the observation to a supervisor, who then questions Jose's priorities at work.",
        "information_leaked": "Jose's real name (synced from Facebook), his recently played tracks in the past 7 days including a migrant-rights podcast, his current listening status, and the fact that he is active on the app at specific times.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow4",
            "step_causing_harm": [
              "Step 4: Turn on 'Share my listening activity' after opening the friend activity area."
            ],
            "design_problems": [
              "Encourages enabling sharing without a clear warning that future Facebook connections will immediately see activity.",
              "No granular audience controls (e.g., limit to selected friends) before turning sharing on."
            ]
          },
          {
            "function": 3,
            "flow_id": "flow4",
            "step_causing_harm": [
              "Step 3: Private Session automatically ends after 6 hours without an interruptive alert, reverting to sharing."
            ],
            "design_problems": [
              "Ephemeral privacy with weak signaling; no countdown or explicit reminder on expiry.",
              "Default reverts to sharing instead of maintaining privacy until explicitly turned off."
            ]
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 4: Successful Facebook connection auto-syncs contacts, making Jose's current and recent listening instantly visible to those contacts."
            ],
            "design_problems": [
              "Cross-context identity linking by default (Facebook to music app) without a review/approval list of contacts.",
              "No post-sync privacy gate to confirm visibility settings before exposing activity."
            ]
          },
          {
            "function": 4,
            "flow_id": "flow3",
            "step_causing_harm": [
              "Step 3: Selecting 'Unfollow' on a Facebook-synced contact fails to remove them from the feed."
            ],
            "design_problems": [
              "Inconsistent removal behavior for Facebook-synced contacts with no explanation.",
              "Lack of clear, accessible option to fully remove or limit visibility to synced contacts without resorting to a hard block."
            ]
          }
        ],
        "leakage_source": "The music app's Friend Activity feature auto-sharing to newly synced Facebook contacts after Private Session expired.",
        "leak_to": "A coworker who is now a Facebook-synced contact in the app; subsequently shared verbally with the supervisor and other colleagues.",
        "harms": [
          {
            "harm": "Reputational Harms",
            "cause": "The app exposes Jose's recent listening (migrant-rights podcast) to coworkers, shaping negative judgments about his priorities and beliefs."
          },
          {
            "harm": "Discrimination Harms",
            "cause": "Supervisors infer sensitive immigration-related concerns from his listening and treat him differently at work."
          },
          {
            "harm": "Autonomy Harms — Failure to Inform, Thwarted Expectations, Lack of Control",
            "cause": "The app encourages turning on sharing without warning about future Facebook sync, silently ends Private Session, and makes it difficult to remove Facebook-synced contacts."
          },
          {
            "harm": "Psychological Harms — Emotional Distress",
            "cause": "Jose experiences anxiety and fear of job-related consequences after realizing that coworkers and supervisors can see his listening."
          },
          {
            "harm": "Relationship Harms",
            "cause": "Coworker gossip and supervisor scrutiny strain workplace relationships."
          }
        ],
        "consequences": "Jose is informally reassigned to less desirable shifts and fewer hours after the supervisor hears about his listening, worsening his financial stability and increasing his stress about exposure of sensitive issues."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Linda",
        "age": 22,
        "tech_comfort_level": "low"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Socioeconomic disadvantage - High school dropout",
        "privacy_awareness_level": "low",
      "information_cared_about": ["educational history", "job-search data", "identity"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - job portals require identity",
          "Disclosure vs. Stigma - dropout status may limit opportunities"
        ],
        "privacy_responses": [
          {
            "response": "Apathy",
            "description": "Does not complete profiles or avoids platforms."
          }
        ],
        "costs_and_consequences": [
          "Limited access to job listings",
          "Economic exclusion"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [],
      "privacy_responses": [
        {
          "response": "",
          "description": ""
        }
      ],
      "costs_and_consequences": []
    },
    "stories": [
      {
        "persona_identity": "Linda is a 22-year-old woman working part-time as a cashier; as a high school dropout facing socioeconomic disadvantage, she's vulnerable to reputational and economic harms. Her tech comfort is low because she rarely uses complex settings and often skips privacy explanations.",
        "story": "Linda opens her music app hoping to see what friends listen to and, following a prompt in settings, turns on sharing so her activity will show up for others. She then links her Facebook to add friends more easily. Later, she notices that a former classmate—now an assistant at a local staffing agency where she recently applied—can see that she's been listening to GED prep and job-interview playlists. Embarrassed, she tries to remove the classmate from her feed but learns that removing them doesn't stop them from seeing her listening through the Facebook link. Feeling exposed and powerless, she exits the app and worries this will affect her job prospects.",
        "information_leaked": "Linda's real name and profile linked to her listening activity (e.g., GED prep and job-interview playlists), recent listening timestamps (past 7 days), and social graph visibility via Facebook sync—allowing inferences about her educational history and active job search.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": [
              "Step 7: Find 'Share my listening activity' and switch the toggle button to ON."
            ],
            "design_problems": [
              "Nudging copy encourages enabling sharing without clarifying audience scope or consequences.",
              "Sharing control is placed within a viewing feature workflow, blurring the boundary between seeing others and broadcasting your own activity.",
              "No clear, immediate warning that turning this on exposes listening to all mutual friends and synced Facebook friends."
            ]
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 3: Click the 'Connect with Facebook' button.",
              "Step 4: Enter Facebook account information and click 'Log In' to authorize linking."
            ],
            "design_problems": [
              "Framing focuses on not posting to Facebook, downplaying exposure within the app to all synced Facebook friends.",
              "No granular selection of which Facebook friends can see or be added; defaults add a large audience at once.",
              "Lack of pre-linking summary that explicitly states what exact data (listening activity, identity) will be visible to whom."
            ]
          },
          {
            "function": 4,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 2: Click on the 'Following' button (on a synced Facebook friend) — the friend still appears in the Friend Activity feed."
            ],
            "design_problems": [
              "Unfollow action does not remove Facebook-synced friends from seeing activity, contradicting user expectations.",
              "No in-context guidance explaining that synced Facebook friends require different controls (e.g., disconnect Facebook or disable sharing).",
              "Persistence of exposure despite a removal attempt creates a false sense of control."
            ]
          }
        ],
        "leakage_source": "The music app's Friend Activity sharing and Facebook sync features expose Linda's listening activity to synced Facebook friends.",
        "leak_to": "Synced Facebook friends within the music app, including a former classmate who now works at a local staffing agency reviewing applicants.",
        "harms": [
          {
            "harm": "Reputational Harms",
            "cause": "Listening activity revealing GED prep and interview content is linked to Linda's identity via Facebook sync, enabling stigmatizing inferences about her dropout status and job search."
          },
          {
            "harm": "Autonomy Harms - Lack of Control",
            "cause": "The app allows unfollowing but does not actually stop Facebook-synced friends from seeing Linda's activity, undermining user control and expectations."
          },
          {
            "harm": "Autonomy Harms - Thwarted Expectations",
            "cause": "Prompts to enable sharing occur inside a viewing flow; linking Facebook expands visibility without clear, prominent disclosure of audience scope."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Linda feels exposed and anxious after realizing sensitive listening is visible to someone connected to her job prospects."
          },
          {
            "harm": "Economic Harms",
            "cause": "Visibility of job-seeking and study-related listening to a staffing agency contact could bias informal assessments, risking lost opportunities."
          },
          {
            "harm": "Relationship Harms",
            "cause": "Peers from Facebook can judge or gossip about her perceived struggles, straining social ties."
          }
        ],
        "consequences": "Linda avoids using the app, withdraws from sharing features, and fears her application will be informally downgraded. She experiences stress and self-censorship in her listening choices, and considers deleting the app to prevent further exposure."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Eva",
        "age": 16,
        "tech_comfort_level": "high"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Internal and experiential factors - Teen facing online bullying",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["social posts", "school identity", "online friends"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
        "Privacy vs. Self-expression - wants to post but fears harassing responses",
        "Privacy vs. Support - needs help but doesn't want bully to notice"
        ],
        "privacy_responses": [
          {
            "response": "Withholding disclosure",
            "description": "Removes identifying details, avoids naming school."
          },
          {
          "response": "Non-use",
            "description": "Stops using platforms where bullying occurs."
          }
        ],
        "costs_and_consequences": [
          "Silenced voice online",
          "Less social connection"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
        "Privacy vs. Self-expression - revealing personal details increases bullying risk",
        "Privacy vs. Social support - avoiding disclosure reduces chances of connection and assistance"
      ],
      "privacy_responses": [
        {
          "response": "Withholding disclosure",
          "description": "Victims restrict or remove personal information such as school identity, hobbies, or photos to prevent being targeted."
        },
        {
          "response": "Non-use / Platform withdrawal",
          "description": "Teens stop using certain online platforms where bullying is frequent, even if it limits their social and expressive space."
        }
      ],
      "costs_and_consequences": [
        "Loss of opportunities for self-expression due to reduced sharing of personal details",
        "Weakened social connections from avoiding or leaving online spaces",
        "Ongoing fear and stress related to potential targeting if disclosure occurs"
      ]
    },
    "stories": [
      {
        "persona_identity": "Eva is a 16-year-old girl and high-school student who is facing online bullying from classmates. She has high tech comfort because she moderates Discord servers and edits videos for school clubs, making her confident with app settings but still vulnerable to social risks.",
        "story": "Eva opens the app's friend feed and notices a classmate who has bullied her appears there. Wanting to listen without being watched, she starts a private session for the evening. After hours of studying and streaming music, the privacy mode automatically ends while she's still listening to a playlist named after her school's choir. The app resumes broadcasting her activity to followers, including the classmate. The next morning, she tries to remove the classmate from her feed by unfollowing, but the link persists, and her listening remains visible to them. That afternoon, the classmate teases her about the school playlist and late-night listening, and others pile on.",
        "information_leaked": "Real-time and recent listening activity, including track and playlist titles (e.g., a playlist named with her school's initials and choir), and timing of listening that implies late-night behavior.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow6",
            "step_causing_harm": [
              "Step 1: Tap the Friend Activity icon to open the sidebar and reveal connected users, including a bullying classmate."
            ],
            "design_problems": [
              "No clear explanation that people shown are likely able to see your activity if sharing is on by default.",
              "No indication which connections are Facebook-synced versus mutual follows, making visibility hard to reason about.",
              "No quick privacy control in the feed to immediately restrict what specific people can see."
            ]
          },
          {
            "function": 3,
            "flow_id": "flow4",
            "step_causing_harm": [
              "Step 3: Private Session automatically ends after 6 hours, silently reverting to sharing without an explicit warning or opt-in prompt."
            ],
            "design_problems": [
              "Private Session is time-limited with a hidden timer and no persistent countdown or alert upon expiry.",
              "Sharing resumes automatically to all followers once Private Session ends (default sharing is ON).",
              "No per-follower exclusion controls; privacy is all-or-nothing, so a single bully continues to receive updates."
            ]
          },
          {
            "function": 4,
            "flow_id": "flow3",
            "step_causing_harm": [
              "Step 3: Clicking 'Unfollow' on a Facebook-synced classmate does not remove them from the feed or sever their visibility, leading to continued exposure."
            ],
            "design_problems": [
              "Unfollow behaves differently for Facebook-synced connections without clearly explaining that visibility persists.",
              "No clear pathway or guidance that only 'Block' will stop the person from seeing activity.",
              "Ambiguous social graph that conflates follow and Facebook-sync, thwarting user expectations of control."
            ]
          }
        ],
        "leakage_source": "The music app's Friend Activity feature automatically sharing listening activity after Private Session expired, compounded by a persistent Facebook-synced connection.",
        "leak_to": "A bullying classmate (and their friends) who remain connected via the app's feed.",
        "harms": [
          {
            "harm": "Reputational Harms",
            "cause": "The app resumed broadcasting a playlist revealing her school affiliation and late-night listening, enabling classmates to mock her."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Continued exposure of her activity to a known bully after she believed she had hidden it triggers anxiety and embarrassment."
          },
          {
            "harm": "Autonomy Harms - Thwarted Expectations and Lack of Control",
            "cause": "Private Session automatically ended without clear notice, and unfollow did not stop visibility for a Facebook-synced contact, undermining her attempts to control who sees her activity."
          },
          {
            "harm": "Relationship Harms",
            "cause": "The leak fuels renewed bullying dynamics at school and online, straining peer relationships."
          }
        ],
        "consequences": "Classmates tease her about the school playlist and late-night activity; the bully circulates jokes in group chats. Eva feels unsafe, reduces sharing, and avoids the app, losing social connection and music discovery she relied on for support."
      }
    ]
  }
]