[
    {
      "basic_info": {
        "name": "Amina",
        "age": 12,
        "tech_comfort_level": "low"
      },
      "contextual_info": {
          "vulnerability_type_brief_description": "Structural and institutional exclusion - Discrimination due to refugee status",
        "privacy_awareness_level": "low",
        "information_cared_about": ["location", "immigration status", "identity documents"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - afraid to identify to receive assistance",
          "Privacy vs. Disclosure of identity - risk of stigma or denial of aid"
        ],
        "privacy_responses": [
          {
            "response": "Apathy",
            "description": "Feels surveillance is inevitable, so avoids acting or reporting."
          },
          {
            "response": "Non-use",
            "description": "Avoids official portals or apps to not expose status."
          }
        ],
        "costs_and_consequences": [
          "Missed access to legal aid, medical care, or language support",
          "Continued vulnerability without reporting abuse or needs"
        ]
      },
      "additional_privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
              "Privacy vs. Safety - reluctance to disclose refugee status to protect from harassment or threats",
              "Privacy vs. Community engagement - fear of harassment reduces participation in supportive spaces",
              "Privacy vs. Public presence - online hostility pressures refugees to retreat from digital spaces"
        ],
        "privacy_responses": [
          {
              "response": "Avoidance of disclosure",
              "description": "Chooses not to share refugee status or personal information online or with unfamiliar organizations."
          },
          {
              "response": "Self-censorship",
              "description": "Avoids posting personal stories or identifiable details online to prevent harassment or doxxing."
          },
          {
              "response": "Withdrawal from platforms",
              "description": "Stops using social media after repeated harassment tied to refugee identity."
          }
        ],
        "costs_and_consequences": [
              "Limited ability to use digital services that could provide beneficial resources",
              "Loss of emotional and social support from online communities",
              "Reduced access to information, opportunities, and advocacy networks"
          ]
      },
      "stories": [
        {
          "story": "Amina, a 12-year-old refugee with low tech comfort, opens the music app at school to see what friends are listening to. She turns on sharing and then connects her Facebook to add friends. The app starts showing her full Facebook name and shares her listening (including a \"Welcome Songs for New Arrivals\" playlist) to classmates who also use the app. The classmates tease her, connecting the playlist to her refugee status.",
          "information_leaked": "Amina's real name and profile photo from Facebook, her synced friend graph, and her current/recent listening activity and playlists within the music app (revealing cultural/immigration-related content).",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow2",
              "step_causing_harm": "step 7 - Amina turns on 'Share my listening activity' (sharing now enabled to followers/mutuals)."
            },
            {
              "function": 2,
              "flow_id": "flow3",
              "step_causing_harm": "step 5 - Facebook login is successful, linking her Facebook identity and friend list to the music app."
            }
          ],
          "leakage_source": "The music app's Friend Activity feature and Facebook account linking.",
          "leak_to": "Classmates who are Facebook friends or mutual followers on the music app and can see the Friend Activity feed.",
          "harms": [
            {
              "harm": "Reputational Harms",
              "cause": "The app displays Amina's full name from Facebook alongside refugee-related listening activity, enabling peers to infer her status."
            },
            {
              "harm": "Psychological Harms - Emotional Distress",
              "cause": "Teasing and stigma after peers view her listening activity via the Friend Activity feed."
            },
            {
              "harm": "Discrimination Harms",
              "cause": "Peers use the disclosed information (refugee-themed playlists) to target and exclude her."
            },
            {
              "harm": "Autonomy Harms - Thwarted Expectations",
              "cause": "Amina does not realize that enabling sharing plus Facebook linking exposes identifiable details to classmates."
            }
          ],
          "consequences": "Bullying at school, withdrawal from the app, and reduced participation in supportive music and language resources that could help her adapt."
        },
        {
          "story": "To hide what she plays, Amina starts a Private Session. She assumes her listening will stay hidden. After six hours, the app automatically ends the Private Session without a prominent alert. That evening, she streams an immigration-interview practice playlist. Her teacher, who follows her in the app, sees it in Friend Activity and later asks pointed questions in front of classmates.",
          "information_leaked": "Amina's current listening activity in the app (immigration interview practice content) that she believed was private.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow2",
              "step_causing_harm": "step 7 - Earlier, 'Share my listening activity' was turned on, so visibility resumes once Private Session ends."
            },
            {
              "function": 3,
              "flow_id": "flow4",
              "step_causing_harm": "step 3 - The Private Session auto-ends after 6 hours, silently reverting Amina to public sharing."
            }
          ],
          "leakage_source": "The music app's Private Session auto-expiry and default sharing behavior.",
          "leak_to": "A teacher follower who views the Friend Activity feed.",
          "harms": [
            {
              "harm": "Autonomy Harms - Thwarted Expectations",
              "cause": "The app ends Private Session without ensuring Amina is aware, causing her to unknowingly share again."
            },
            {
              "harm": "Psychological Harms - Emotional Distress",
              "cause": "Public questioning and embarrassment after the teacher sees sensitive listening activity."
            },
            {
              "harm": "Discrimination Harms",
              "cause": "Teacher's altered perception of Amina due to revealed immigration-related preparation content."
            }
          ],
          "consequences": "Amina avoids the app, loses access to language-learning audio, and feels less safe seeking help or practicing for interviews."
        },
        {
          "story": "Amina tries to remove an older acquaintance (synced via Facebook) from her Friend Activity feed because she fears he might see what she listens to. She clicks 'Following' on his profile to unfollow, but because he's a Facebook-synced friend, the app keeps him in her Friend Activity connections. Later, her listening to a legal-aid playlist is visible to him, and he gossips about her immigration situation in the community.",
          "information_leaked": "Amina's ongoing listening activity and interests (e.g., legal-aid and resettlement resources) in the music app.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow2",
              "step_causing_harm": "step 7 - 'Share my listening activity' is ON, enabling others to see her listening."
            },
            {
              "function": 4,
              "flow_id": "flow1",
              "step_causing_harm": "step 2 - Clicking 'Following' changes to 'Follow' but the synced Facebook friend still remains in her Friend Activity connections, failing to remove visibility."
            }
          ],
          "leakage_source": "The music app's Friend Activity removal workflow that does not actually remove Facebook-synced friends from visibility.",
          "leak_to": "The older acquaintance who remains connected and sees her activity in Friend Activity.",
          "harms": [
            {
              "harm": "Autonomy Harms - Lack of Control",
              "cause": "The app preserves visibility for Facebook-synced friends despite Amina's attempt to remove them."
            },
            {
              "harm": "Relationship Harms",
              "cause": "The acquaintance gossips about her private situation after seeing her listening."
            },
            {
              "harm": "Psychological Harms - Disturbance",
              "cause": "Fear and anxiety knowing a person she tried to remove still monitors her listening."
            }
          ],
          "consequences": "Community rumors about her immigration status, increased anxiety, and avoidance of helpful playlists that could support her legal needs."
        },
        {
          "story": "At home on a shared family computer, Amina connects Facebook to the music app to add friends. With sharing already on, her relatives are suggested and follow her. Her recent listening and followed playlists include a youth support mix that her conservative uncle misinterprets. He confronts her parents, leading to stricter controls on her digital use.",
          "information_leaked": "Her current/recent listening and followed playlists in the music app, tied to her real Facebook identity and friend graph.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow2",
              "step_causing_harm": "step 7 - Turning on 'Share my listening activity' makes her listening visible to followers/mutuals."
            },
            {
              "function": 2,
              "flow_id": "flow1",
              "step_causing_harm": "step 4 - Successful Facebook login links relatives and exposes her activity to them."
            }
          ],
          "leakage_source": "Music app Friend Activity combined with Facebook linking and default social visibility.",
          "leak_to": "Extended family members who become connected through Facebook sync and follow her activity.",
          "harms": [
            {
              "harm": "Relationship Harms",
              "cause": "Relatives see her listening and make value judgments, escalating family conflict."
            },
            {
              "harm": "Psychological Harms - Emotional Distress",
              "cause": "Stress and fear from being scrutinized by relatives through the app's activity feed."
            },
            {
              "harm": "Autonomy Harms - Lack of Control",
              "cause": "Default settings and Facebook sync expand the audience beyond what Amina intended."
            }
          ],
          "consequences": "Family-imposed restrictions on her device use, reduced access to supportive audio resources, and withdrawal from online spaces."
        },
        {
          "story": "Amina enables Friend Activity, connects Facebook to find classmates, and later turns on a Private Session from Settings to hide her listening of a language-test prep playlist. The session automatically ends after six hours without her noticing. A classmate (still connected through Facebook sync) sees her renewed public listening and teases her for ‘not belonging here.' Amina tries to unfollow the classmate via the three-dot menu, but because the connection is Facebook-synced, the person remains.",
          "information_leaked": "Amina's renewed public listening activity (language-test prep and settlement content) and her identity via Facebook linkage inside the music app.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow5",
              "step_causing_harm": "step 1 - Opening Friend Activity reveals the 'Add Friends' path; sharing remains enabled from prior use."
            },
            {
              "function": 2,
              "flow_id": "flow1",
              "step_causing_harm": "step 4 - Successful Facebook login syncs classmates and exposes Amina's identity to them."
            },
            {
              "function": 3,
              "flow_id": "flow6",
              "step_causing_harm": "step 6 - Private Session auto-ends after 6 hours, reverting Amina to public sharing without a sufficiently salient notice."
            },
            {
              "function": 4,
              "flow_id": "flow3",
              "step_causing_harm": "step 3 - Selecting 'Unfollow' fails to remove a Facebook-synced friend, so the classmate still sees Amina's activity."
            }
          ],
          "leakage_source": "The music app's Facebook sync (identity/linkage), Private Session auto-expiry, and ineffective removal of synced connections.",
          "leak_to": "A classmate who remains connected through Facebook sync and views the Friend Activity feed.",
          "harms": [
            {
              "harm": "Discrimination Harms",
              "cause": "Classmate uses the exposed listening content to mock Amina's refugee background and language learning needs."
            },
            {
              "harm": "Autonomy Harms - Failure to Inform",
              "cause": "The app's Private Session ends automatically and quietly; Amina isn't clearly warned that sharing resumed."
            },
            {
              "harm": "Autonomy Harms - Lack of Control",
              "cause": "Unfollow does not remove Facebook-synced connections, preventing Amina from limiting who sees her activity."
            },
            {
              "harm": "Psychological Harms - Emotional Distress",
              "cause": "Teasing and shame from exposure of sensitive listening in front of peers."
            }
          ],
          "consequences": "Amina self-censors, avoids educational playlists, and withdraws from the app, losing access to language and settlement resources that support her well-being."
        }
      ]
    },
    {
      "basic_info": {
        "name": "Eleanor",
        "age": 72,
        "tech_comfort_level": "low"
      },
      "contextual_info": {
        "vulnerability_type_brief_description": "Intersectional identities and characteristics - Elderly individual with cognitive decline",
        "privacy_awareness_level": "low",
        "information_cared_about": ["health data", "location", "financial transactions"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Autonomy - carers may monitor devices to protect",
          "Privacy vs. Support - needs remote monitoring but fears intrusion"
        ],
        "privacy_responses": [
          {
            "response": "Third-party protections",
            "description": "Relies on caregivers to manage device access and privacy."
          },
          {
            "response": "Physical workarounds",
            "description": "Uses simple devices with limited connectivity to reduce exposure."
          }
        ],
        "costs_and_consequences": [
          "Loss of independence and personal control",
          "Potential exclusion from beneficial tech innovations"
        ]
      },
      "additional_privacy_responses_and_costs": {
          "privacy_tensions_with_short_description": [
              "Privacy vs. Safety - protective monitoring may feel invasive",
              "Privacy vs. Dependence - reliance on others for privacy controls may lead to oversharing",
              "Privacy vs. Autonomy - safety measures may undermine dignity"
          ],
          "privacy_responses": [
              {
                  "response": "Selective adoption",
                  "description": "Chooses only certain monitoring tools or disables features to reduce intrusion."
              },
              {
                  "response": "Delegated privacy control",
                  "description": "Allows trusted individuals to set and manage device and account privacy preferences."
              },
              {
                  "response": "Consent safeguards",
                  "description": "Seeks clear explanations and agreements before enabling monitoring features."
              }
          ],
          "costs_and_consequences": [
              "Reduced protection from safety-focused monitoring systems",
              "Increased risk of falling victim to scams or fraud",
              "Potential over-disclosure of personal information",
              "Loss of awareness about personal data handling",
              "Possible reduced safety if tracking features are limited or disabled",
              "Emotional distress over loss of dignity"
          ]
      },
      "stories": [
        {
          "story": "Eleanor wants to see what her grandson is listening to. She opens the Friend Activity sidebar and, following the prompt, turns on “Share my listening activity.” Later, she starts a Private Session for privacy but doesn't realize it ends after 6 hours. That evening, after it auto-ends, she plays a grief-support playlist; her caregiver (who follows her) sees it and confronts her about ‘being up late and depressed.'",
          "information_leaked": "Her live and recent listening activity (playlist names like ‘Grief Support for Seniors,' track titles, timestamps revealing late-night usage), visible to followers on the music app.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow4",
              "step_causing_harm": "Step 4 (switching ON 'Share my listening activity')"
            },
            {
              "function": 3,
              "flow_id": "flow4",
              "step_causing_harm": "Step 3 (Private Session auto-ends after 6 hours; sharing resumes)"
            }
          ],
          "leakage_source": "The music app's Friend Activity sharing feature combined with the auto-expiring Private Session.",
          "leak_to": "Her caregiver and a few church friends who follow her on the music app.",
          "harms": [
            {
              "harm": "Psychological Harms - Emotional Distress",
              "cause": "The app resumes broadcasting her listening after Private Session ends, exposing sensitive playlists without her clear awareness."
            },
            {
              "harm": "Autonomy Harms - Lack of Control and Thwarted Expectations",
              "cause": "Private Session automatically ends after 6 hours; the UI does not make continued sharing salient to a low tech-comfort user."
            },
            {
              "harm": "Relationship Harms",
              "cause": "Caregiver monitoring is intensified after seeing her late-night, sensitive listening."
            }
          ],
          "consequences": "Caretaker imposes stricter device oversight and bedtime checks; Eleanor feels embarrassed and reduces app use, harming her sense of independence."
        },
        {
          "story": "Encouraged by the app to find friends, Eleanor enables sharing and then connects her Facebook account to add friends. The app pulls in her real name and photo, and her Facebook-linked contacts on the app (including an estranged son) now see her profile and listening to ‘Memory Decline Support' and secular meditation tracks.",
          "information_leaked": "Her real identity (full name and profile picture synced from Facebook), her Facebook friend graph on the app, and her live/recent listening activity including sensitive health-related inferences.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow2",
              "step_causing_harm": "Step 7 (turning ON 'Share my listening activity', enabling broadcast to followers/friends)"
            },
            {
              "function": 2,
              "flow_id": "flow1",
              "step_causing_harm": "Step 4 (successful Facebook linking imports name/photo/friend list to the music app)"
            }
          ],
          "leakage_source": "The music app's Facebook integration and default behavior of using imported name/photo with Friend Activity sharing.",
          "leak_to": "Facebook-synced contacts who use the music app (including her estranged son) and any existing followers on the app.",
          "harms": [
            {
              "harm": "Reputational Harms",
              "cause": "Imported real identity tied to sensitive listening (e.g., cognitive decline support) increases stigma risk among acquaintances."
            },
            {
              "harm": "Autonomy Harms - Thwarted Expectations",
              "cause": "Eleanor expected to simply 'find friends' but did not anticipate real-name exposure and wide visibility of her listening."
            },
            {
              "harm": "Relationship Harms",
              "cause": "An estranged family member re-engages contentiously after seeing her activity."
            },
            {
              "harm": "Psychological Harms - Emotional Distress",
              "cause": "Unwanted contact and embarrassment triggered by identity-linked sharing."
            }
          ],
          "consequences": "Unwanted calls/messages from family; Eleanor withdraws from the app, feels exposed, and asks her caregiver to limit app permissions—reducing social connection she sought."
        },
        {
          "story": "After previously turning on sharing, Eleanor tries to remove an ex-neighbor from her Friend Activity feed. She unfollows him, but because he is a Facebook-synced contact, he remains in her feed—and likely still sees her listening. She assumes she removed him, but he later comments on her ‘late-night sad songs,' proving he still sees her activity.",
          "information_leaked": "Ongoing exposure of her listening history (playlist names, tracks, timing patterns) to a specific unwanted, Facebook-synced contact.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow2",
              "step_causing_harm": "Step 7 (turning ON 'Share my listening activity' increases exposure to all connected contacts)"
            },
            {
              "function": 4,
              "flow_id": "flow1",
              "step_causing_harm": "Step 2 (attempt to unfollow a Facebook-synced friend fails to remove them; they remain connected)"
            }
          ],
          "leakage_source": "The music app's persistent Facebook-sync connection and Friend Activity sharing, which continues despite an attempted unfollow.",
          "leak_to": "The ex-neighbor whose connection persists via Facebook sync on the music app.",
          "harms": [
            {
              "harm": "Relationship Harms",
              "cause": "The app's failure to sever a synced connection enables ongoing unwanted visibility and contact."
            },
            {
              "harm": "Autonomy Harms - Lack of Control",
              "cause": "Eleanor cannot effectively remove a specific person from seeing her activity due to sync constraints."
            },
            {
              "harm": "Psychological Harms - Disturbance",
              "cause": "She feels watched and unsafe when the ex-neighbor references her activity."
            }
          ],
          "consequences": "Eleanor stops using the app at night and avoids certain playlists (chilling effect), reducing her wellbeing-support routines."
        },
        {
          "story": "Eleanor starts a Private Session from the Settings page after reading the tooltip but believes it will last as long as she needs. It ends after 6 hours. The next morning she plays ‘Hymns for Funeral Planning,' which is immediately visible to mutual friends on the app, leading to gossip in her church group.",
          "information_leaked": "Sensitive playlist titles indicating planning around death, and associated timestamps showing recent listening activity.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow6",
              "step_causing_harm": "Step 1 (opening the Friend Activity sidebar does not itself cause harm but sets context; prior sharing defaults remain active once Private Session ends)"
            },
            {
              "function": 3,
              "flow_id": "flow6",
              "step_causing_harm": "Step 6 (Private Session automatically ends after 6 hours; sharing resumes by default)"
            }
          ],
          "leakage_source": "The music app's Private Session auto-expiration coupled with default sharing when it ends.",
          "leak_to": "Mutual-followed friends and any synced Facebook friends who use the app.",
          "harms": [
            {
              "harm": "Reputational Harms",
              "cause": "Public exposure of sensitive playlists to acquaintances invites speculation and gossip."
            },
            {
              "harm": "Autonomy Harms - Failure to Inform",
              "cause": "The temporary nature of privacy is easy to miss for a low tech-comfort user with cognitive decline."
            },
            {
              "harm": "Psychological Harms - Emotional Distress",
              "cause": "Embarrassment and anxiety upon learning others saw intimate listening choices."
            }
          ],
          "consequences": "Strained social interactions at church; Eleanor becomes reluctant to use the app, diminishing a source of comfort."
        },
        {
          "story": "Prompted by the app to see friends' activity, Eleanor turns on ‘Share my listening activity.' She then tries to connect Facebook but mistypes her password and is returned to a screen that looks unchanged. She assumes nothing is being shared. Meanwhile, her existing followers on the app see her ‘Chronic Pain Relief' playlist and time-of-day patterns.",
          "information_leaked": "Sensitive playlist names tied to health conditions and listening timestamps to existing followers on the music app.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow1",
              "step_causing_harm": "Step 7 (turning ON 'Share my listening activity' begins sharing to existing followers)"
            },
            {
              "function": 2,
              "flow_id": "flow2",
              "step_causing_harm": "Step 4 (failed Facebook login returns her to a generic state, reinforcing the mistaken belief that nothing changed)"
            }
          ],
          "leakage_source": "The music app's sharing feature and ambiguous UI feedback after a failed Facebook connection.",
          "leak_to": "Existing followers on the music app (e.g., a neighbor who follows her).",
          "harms": [
            {
              "harm": "Autonomy Harms - Failure to Inform",
              "cause": "UI design does not clearly indicate that sharing is already active despite failed Facebook connect."
            },
            {
              "harm": "Economic Harms",
              "cause": "A follower who is a local pharmacy clerk notices her pain-related listening and targets her with persistent product pitches."
            },
            {
              "harm": "Psychological Harms - Disturbance",
              "cause": "Unwanted attention after health-related listening becomes known."
            }
          ],
          "consequences": "Eleanor spends money on unnecessary remedies after pressure from a follower; she feels exposed and asks her caregiver to restrict app features, lowering her autonomy."
        }
      ]
    },
    {
      "basic_info": {
        "name": "Jamal",
        "age": 15,
        "tech_comfort_level": "high"
      },
      "contextual_info": {
        "vulnerability_type_brief_description": "Intersectional identities and characteristics - Child navigating social media",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["posts", "location tagging", "social connections"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Self-expression - wants to post but fears visibility by adults",
          "Privacy vs. Support - parental monitoring vs peer privacy"
        ],
        "privacy_responses": [
          {
            "response": "Withholding disclosure",
            "description": "Omits identifying info and avoids location tags."
          },
          {
            "response": "Controlling disclosure",
            "description": "Uses private accounts or separate pseudonymous profiles."
          }
        ],
        "costs_and_consequences": [
          "Less authentic social engagement",
          "Mental load managing multiple profiles"
        ]
      },
      "additional_privacy_responses_and_costs": {
          "privacy_tensions_with_short_description": [
              "Privacy vs. Self-expression - limits public sharing to maintain control over personal identifiers",
              "Privacy vs. Support - avoids location sharing to limit monitoring",
              "Privacy vs. Platform engagement - lack of effective tools can discourage participation"
          ],
          "privacy_responses": [
              {
                  "response": "Selective audience sharing",
                  "description": "Shares personal or sensitive content only with trusted contacts or private lists."
              },
              {
                  "response": "Account separation",
                  "description": "Maintains distinct profiles for different audiences, such as parents and peers."
              },
              {
                  "response": "Tool-based boundary regulation",
                  "description": "Uses available platform settings to manage visibility across different social circles."
              }
          ],
          "costs_and_consequences": [
              "Reduced potential for wider recognition or engagement on posts",
              "Ongoing effort to maintain multiple accounts and manage distinct audiences",
              "Possible reduced participation in online spaces due to fear of unintended exposure"
          ]
      },
      "stories": [
        {
          "story": "Jamal turns on Friend Activity to see what his friends are playing. The sidebar nudges him into enabling sharing, and later he connects the app to Facebook to add more friends. That evening, his mom—synced via Facebook—sees in her Friend Activity feed that Jamal is listening to explicit drill rap and messages him about it, undermining the privacy boundaries he tries to maintain between adult family and peers.",
          "information_leaked": "Jamal's real-time and recent (past 7 days) listening activity (track and playlist titles), his presence/online times implied by 'currently listening,' and the linkage of his music account to his real-name Facebook identity via friend sync.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow2",
              "step_causing_harm": "step 7: Jamal switches 'Share my listening activity' to ON, enabling broadcast of his listening to followers and synced friends."
            },
            {
              "function": 2,
              "flow_id": "flow1",
              "step_causing_harm": "step 4: Successful Facebook login links his Facebook friend graph, allowing Facebook friends (including his mom) to see his listening via the Friend Activity feature."
            }
          ],
          "leakage_source": "The music app's Friend Activity sharing mechanism after 'Share my listening activity' is enabled and Facebook friends are synced.",
          "leak_to": "Facebook-synced friends and followers, including Jamal's mom.",
          "harms": [
            {
              "harm": "Relationship Harms",
              "cause": "Broadcasting Jamal's listening to adult family through Friend Activity collapses his intended audience boundaries."
            },
            {
              "harm": "Autonomy Harms — Lack of Control",
              "cause": "Cross-context identity linkage (Facebook sync) expands the audience for his listening without making the implications obvious to a minor."
            },
            {
              "harm": "Psychological Harms — Emotional Distress",
              "cause": "Unwanted adult scrutiny of his music choices provokes stress and anxiety."
            }
          ],
          "consequences": "His mom imposes stricter monitoring and restrictions on his app use; Jamal starts self-censoring his listening to avoid adult judgment."
        },
        {
          "story": "Jamal starts a Private Session late at night so his friends won't see what he's listening to. He falls asleep streaming a podcast about LGBTQ+ teen stories. Six hours later the private session silently expires and the app resumes broadcasting his listening. Classmates who follow him see his morning activity in Friend Activity and start teasing him at school.",
          "information_leaked": "Podcast titles and playlists played after the private session auto-ends, plus timing that reveals early-morning listening.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow6",
              "step_causing_harm": "No direct harm in this function; context only (Jamal has Friend Activity available and followers who can see updates)."
            },
            {
              "function": 3,
              "flow_id": "flow4",
              "step_causing_harm": "step 3: Private Session automatically ends after 6 hours, and the app resumes broadcasting Jamal's listening to followers."
            }
          ],
          "leakage_source": "The music app's Private Session auto-expiration, which re-enables broadcasting without salient in-the-moment warning.",
          "leak_to": "Classmates and peers who follow Jamal and have Friend Activity visible.",
          "harms": [
            {
              "harm": "Autonomy Harms — Thwarted Expectations / Failure to Inform",
              "cause": "Starting Private Session via the quick menu provides no persistent reminder of the 6-hour limit, leading Jamal to believe he is still private."
            },
            {
              "harm": "Reputational Harms",
              "cause": "Peers infer sensitive identity-related interests from the exposed podcast."
            },
            {
              "harm": "Psychological Harms — Emotional Distress",
              "cause": "Teasing and fear of further exposure increases anxiety and self-censorship."
            }
          ],
          "consequences": "Jamal withdraws from sharing and avoids listening to supportive content on the app, experiencing a chilling effect on his self-expression."
        },
        {
          "story": "After syncing Facebook friends, Jamal notices his teacher appears in his Friend Activity list. He tries to remove the teacher by unfollowing from the teacher's profile, but because the connection comes from Facebook sync, the teacher remains in his Friend Activity list. Jamal continues listening, thinking the teacher won't see it, but his activity is still visible to that teacher.",
          "information_leaked": "Ongoing listening activity (track/playlist titles, recent listens) and temporal patterns (e.g., late-night listening), broadcast to a Facebook-synced contact he believed he had removed.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow2",
              "step_causing_harm": "step 7: Jamal switches 'Share my listening activity' to ON, enabling ongoing broadcasts."
            },
            {
              "function": 2,
              "flow_id": "flow3",
              "step_causing_harm": "step 5: Successful Facebook login links Facebook contacts (including the teacher), making them eligible to see Jamal's Friend Activity."
            },
            {
              "function": 4,
              "flow_id": "flow3",
              "step_causing_harm": "step 3: Jamal clicks 'Unfollow' on a Facebook-synced friend; the user still appears in Friend Activity, failing to remove the teacher or stop visibility."
            }
          ],
          "leakage_source": "The app's Facebook sync plus the Friend Activity sharing feature, combined with a confusing removal flow that doesn't break Facebook-based visibility.",
          "leak_to": "The synced teacher who remains connected via Facebook.",
          "harms": [
            {
              "harm": "Autonomy Harms — Lack of Control / Thwarted Expectations",
              "cause": "The unfollow action fails to remove a Facebook-synced contact, undermining Jamal's attempt to control his audience."
            },
            {
              "harm": "Relationship Harms",
              "cause": "A teacher continues to see Jamal's personal listening habits, compromising his student–teacher boundary."
            },
            {
              "harm": "Psychological Harms — Disturbance",
              "cause": "Jamal experiences ongoing worry about being watched and judged by an authority figure."
            }
          ],
          "consequences": "The teacher raises Jamal's late-night listening in a welfare meeting; Jamal feels embarrassed and reduces his app usage to avoid further scrutiny."
        },
        {
          "story": "Prompted by the prominent 'Settings' button in the Friend Activity sidebar, Jamal enables sharing so he can participate with peers. His mutual-followed classmates then see in their Friend Activity that he's listening to a playlist titled 'Coming-Out Tracks,' which he intended only for close friends.",
          "information_leaked": "The sensitive playlist title and songs Jamal is currently listening to; real-time status that he is listening now.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow2",
              "step_causing_harm": "step 7: Enabling 'Share my listening activity' broadcasts the specific playlist title Jamal listens to, making the sensitive context visible."
            },
            {
              "function": 2,
              "flow_id": "flow2",
              "step_causing_harm": "No harm from this function; Jamal attempts to connect Facebook but the login fails, so only existing in-app mutual followers see the broadcast."
            }
          ],
          "leakage_source": "The Friend Activity sharing feature and interface that nudges users to turn on sharing without granular audience controls.",
          "leak_to": "Classmates who are already mutual-followed on the music app.",
          "harms": [
            {
              "harm": "Autonomy Harms — Manipulation",
              "cause": "The large, proactive prompt to enable sharing encourages disclosure without emphasizing audience limits or sensitive-content risks for a minor."
            },
            {
              "harm": "Reputational Harms",
              "cause": "Peers infer personal information about Jamal's identity from the playlist title."
            },
            {
              "harm": "Psychological Harms — Emotional Distress",
              "cause": "Unwanted exposure of sensitive interests creates anxiety and embarrassment."
            }
          ],
          "consequences": "Rumors circulate at school; Jamal retreats to private listening and avoids posting or naming playlists, reducing his self-expression on the platform."
        }
      ]
    },
    {
      "basic_info": {
        "name": "Liam",
        "age": 35,
        "tech_comfort_level": "medium"
      },
      "contextual_info": {
        "vulnerability_type_brief_description": "Intersectional identities and characteristics - Individual with chronic illness",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["medical records", "symptom logs", "treatment plans"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - sharing health data for care vs exposure",
          "Privacy vs. Disclosure of identity - risk of insurer misuse"
        ],
        "privacy_responses": [
          {
            "response": "Withholding disclosure",
            "description": "Shares only limited health info in online forums."
          },
          {
            "response": "Asking for help",
            "description": "Seeks advice from trusted patient communities discreetly."
          }
        ],
        "costs_and_consequences": [
          "Less tailored advice or misdiagnosis online",
          "Risk trusting poor-quality info"
        ]
      },
      "additional_privacy_responses_and_costs": {
          "privacy_tensions_with_short_description": [
              "Privacy vs. Disclosure of identity - limiting audience to avoid potential discrimination",
              "Privacy vs. Support - need for detailed disclosure for advice vs. risk of permanent public exposure",
              "Privacy vs. Data utility - limiting online sharing to prevent insurer access"
          ],
          "privacy_responses": [
              {
                  "response": "Selective visibility controls",
                  "description": "Uses friend lists or restricted groups to control who can see health-related posts."
              },
              {
                  "response": "Partial disclosure",
                  "description": "Omits identifiable health details while still describing symptoms or situations."
              },
              {
                  "response": "Restrictive sharing",
                  "description": "Avoids uploading detailed symptom logs or treatment histories to online platforms."
              }
          ],
          "costs_and_consequences": [
              "Reduced reach of health-related posts, potentially limiting peer support",
              "Potential for less accurate or relevant responses from community members",
              "Loss of potential benefits from aggregated health data analysis",
              "Reduced ability to track health trends across time digitally"
          ]
      },
      "stories": [
        {
          "story": "Late at night, Liam starts a Private Session to listen to a sensitive health podcast about managing Crohn's flare-ups. After six hours, the Private Session automatically ends while he's still playing episodes in the morning commute. A coworker who follows him opens the app and immediately sees Liam's recent ‘Crohn's flare-up' episode in the Friend Activity feed.",
          "information_leaked": "Liam's recent listening activity, including exact podcast episode titles related to his chronic illness and the timing of that listening.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow2",
              "step_causing_harm": "step 7: Liam switches 'Share my listening activity' to ON in Settings > Social, enabling outbound sharing of his listening."
            },
            {
              "function": 3,
              "flow_id": "flow4",
              "step_causing_harm": "step 3: System auto-ends Private Session after 6 hours, making subsequent listening visible."
            }
          ],
          "leakage_source": "Liam via the music app's sharing setting, combined with the app's automatic Private Session timeout.",
          "leak_to": "A coworker who is a mutual follower on the music app and checks Friend Activity that morning.",
          "harms": [
            {
              "harm": "Reputational Harms",
              "cause": "The Friend Activity feed publicly displays sensitive health-related podcast titles to followers when Private Session ends."
            },
            {
              "harm": "Psychological Harms - Emotional Distress",
              "cause": "Liam believed he was in a private state; the automatic timeout exposes intimate listening unexpectedly."
            },
            {
              "harm": "Autonomy Harms - Lack of Control and Thwarted Expectations",
              "cause": "The app ends privacy protection on a timer without a salient re-prompt, resuming public sharing by default."
            }
          ],
          "consequences": "A coworker makes a comment implying knowledge of Liam's condition; Liam feels exposed and begins avoiding helpful health podcasts during the day, reducing his support resources."
        },
        {
          "story": "Seeking more recommendations, Liam connects his music app to Facebook. He doesn't realize this adds many Facebook contacts, including his health insurance broker, to his Friend Activity network. Minutes later, the broker can see Liam listening to a playlist called ‘Chronic Pain Relief: Guided Meditation.'",
          "information_leaked": "Liam's real-time and recent listening activity, including health-related playlist and track titles, visible to newly synced Facebook contacts on the music app.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow2",
              "step_causing_harm": "step 7: Liam turns ON 'Share my listening activity,' allowing followers (including any future synced ones) to see his listening."
            },
            {
              "function": 2,
              "flow_id": "flow1",
              "step_causing_harm": "step 4: Entering Facebook credentials and authorizing the link syncs Facebook friends into the app's Friend Activity graph."
            }
          ],
          "leakage_source": "Liam, guided by the music app's Facebook connect feature and sharing setting; the app expands his audience without clear, prominent context on the new visibility.",
          "leak_to": "A Facebook-synced contact who is Liam's health insurance broker, now able to view Friend Activity inside the music app.",
          "harms": [
            {
              "harm": "Economic Harms",
              "cause": "Health-related listening signals potentially inform insurance risk perceptions if seen by a broker/agent contact."
            },
            {
              "harm": "Discrimination Harms",
              "cause": "Added visibility of chronic-illness-related listening can invite differential treatment or targeting."
            },
            {
              "harm": "Autonomy Harms - Failure to Inform and Thwarted Expectations",
              "cause": "The connect flow emphasizes ‘We'll never post to Facebook,' but does not clearly warn that all synced contacts will see in-app listening activity once sharing is ON."
            }
          ],
          "consequences": "The broker references Liam's pain-related listening in a casual chat, making Liam fear increased premiums or unwanted sales targeting; he restricts his listening to non-health content, reducing useful self-care."
        },
        {
          "story": "Liam notices an ex-colleague, synced from Facebook, in his Friend Activity list and tries to remove them so they can't see future health-related listening. He unfollows the profile, but the person remains due to being a Facebook-synced connection, continuing to have visibility into Liam's activity.",
          "information_leaked": "Ongoing exposure of Liam's health-related listening history to a Facebook-synced acquaintance despite an unfollow attempt.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow2",
              "step_causing_harm": "step 7: 'Share my listening activity' turned ON makes Liam's activity visible to connected contacts."
            },
            {
              "function": 4,
              "flow_id": "flow1",
              "step_causing_harm": "step 2 (system_action): The app recognizes the target as a Facebook-synced friend; unfollow changes the button but does not remove the person from Friend Activity visibility."
            }
          ],
          "leakage_source": "The music app's integration with Facebook and the app's handling of synced connections that persist despite unfollowing.",
          "leak_to": "The ex-colleague who remains connected via Facebook sync and continues to see Liam's Friend Activity.",
          "harms": [
            {
              "harm": "Autonomy Harms - Lack of Control",
              "cause": "Unfollow action does not remove a Facebook-synced person from visibility, undermining Liam's control over his audience."
            },
            {
              "harm": "Relationship Harms",
              "cause": "An unwanted acquaintance continues to receive intimate signals about Liam's health-related interests."
            },
            {
              "harm": "Psychological Harms - Disturbance",
              "cause": "Persistent exposure after an attempted removal causes ongoing anxiety and self-censorship."
            }
          ],
          "consequences": "Liam avoids listening to health podcasts on the platform altogether (chilling effect), reducing access to supportive content and tools he relies on to manage symptoms."
        },
        {
          "story": "During a flare, Liam enables sharing to ‘see what friends are playing,' then connects Facebook for more friends. He later starts a Private Session while exploring sensitive content about opioid tapering. Overnight, the Private Session times out; when he resumes listening at breakfast, many newly synced Facebook contacts can see titles that imply medication issues.",
          "information_leaked": "Specific titles of health- and medication-related podcasts, timestamps of listening, and that Liam is currently active on the app, visible to a widened network from Facebook sync.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow2",
              "step_causing_harm": "step 7: Turning ON 'Share my listening activity' makes any connected contacts eligible to see his listening."
            },
            {
              "function": 2,
              "flow_id": "flow3",
              "step_causing_harm": "step 5: Successful Facebook linking syncs a larger contact list into Friend Activity."
            },
            {
              "function": 3,
              "flow_id": "flow6",
              "step_causing_harm": "step 6: The system confirms Private Session has ended after 6 hours, resuming public sharing."
            }
          ],
          "leakage_source": "The music app's combination of sharing-by-default once toggled, aggressive Facebook audience expansion, and automatic Private Session timeout.",
          "leak_to": "Multiple Facebook-synced acquaintances (including neighbors, old classmates, and a work contractor) now able to see Liam's Friend Activity feed.",
          "harms": [
            {
              "harm": "Reputational Harms",
              "cause": "Medication- and illness-related listening is displayed to a broad mixed audience who can infer sensitive health status."
            },
            {
              "harm": "Autonomy Harms - Failure to Inform and Lack of Control",
              "cause": "Key visibility changes (audience expansion and privacy timeout) are not surfaced with clear, renewed consent prompts."
            },
            {
              "harm": "Psychological Harms - Emotional Distress",
              "cause": "Unexpected exposure of private coping and treatment content increases stress during a health flare."
            }
          ],
          "consequences": "An acquaintance brings up opioid taper content in a group chat, embarrassing Liam; he pauses using the platform for any health-related listening, reducing his coping resources."
        },
        {
          "story": "Liam wants to see what friends are playing and turns on sharing. A freelance client who is a mutual follower notices a streak of late-night ‘Insomnia Relief' tracks on Liam's Friend Activity and questions his reliability for early-morning meetings.",
          "information_leaked": "Detailed recent listening activity and timing patterns that reveal sleep issues (late-night play history) and health-related interests.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow3",
              "step_causing_harm": "step 4: Switching ON 'See what your friends are playing' opens Friend Activity; combined with previously enabled 'Share my listening activity' (step 7 in flow2 earlier), Liam's own late-night listening is visible to followers."
            },
            {
              "function": 4,
              "flow_id": "flow2",
              "step_causing_harm": "step 2: Unfollowing a mutual-followed client removes them from Liam's feed, but the harm already occurred when they saw his activity before he took action."
            }
          ],
          "leakage_source": "Liam's enabled sharing setting via the music app, which broadcasts timestamps and titles to mutual followers.",
          "leak_to": "A freelance client who mutually follows Liam on the music app.",
          "harms": [
            {
              "harm": "Economic Harms",
              "cause": "Exposure of sleep difficulties leads the client to question reliability and reconsider assignments."
            },
            {
              "harm": "Reputational Harms",
              "cause": "Health-related listening patterns create a negative impression about Liam's professional readiness."
            },
            {
              "harm": "Autonomy Harms - Chilling Effects",
              "cause": "He changes behavior on the platform to avoid revealing personal challenges, limiting useful content."
            }
          ],
          "consequences": "The client delays a contract extension and shifts key meetings to others; Liam loses income and stops late-night health-related listening on the platform."
        }
      ]
    },
    {
      "basic_info": {
        "name": "Arjun",
        "age": 28,
        "tech_comfort_level": "medium"
      },
      "contextual_info": {
        "vulnerability_type_brief_description": "Intersectional identities and characteristics - Person with physical disability",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["accessibility needs", "mobility data", "assistive device usage"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - assistive services need data access",
          "Privacy vs. Disclosure of identity - disability status may be stigmatizing"
        ],
        "privacy_responses": [
          {
            "response": "Controlling disclosure",
            "description": "Uses platforms where disability info held privately."
          },
          {
            "response": "Non-use",
            "description": "Avoids platforms that force outing of disability status."
          }
        ],
        "costs_and_consequences": [
          "Reduced access to some supportive apps",
          "Social isolation or missing communities"
        ]
      },
      "additional_privacy_responses_and_costs": {
          "privacy_tensions_with_short_description": [
              "Privacy vs. Disclosure of identity - providing accessibility info can expose disability status",
              "Privacy vs. Accessibility - accessible authentication may involve revealing impairment",
              "Privacy vs. Public participation - avoiding certain spaces to prevent unwanted exposure"
          ],
          "privacy_responses": [
              {
                  "response": "Use of privacy-centered tools",
                  "description": "Chooses assistants or platforms that explain privacy practices without requesting extra personal data."
              },
              {
                  "response": "Avoidance of certain authentication methods",
                  "description": "Chooses authentication approaches that do not require public demonstration of impairment."
              },
              {
                  "response": "Avoidance of monitored spaces",
                  "description": "Does not enter locations with camera-based systems that could capture assistive device use."
              }
          ],
          "costs_and_consequences": [
              "May limit engagement with platforms that lack accessible, privacy-respecting information features",
              "Potential difficulty accessing devices securely",
              "Increased dependency on less convenient authentication solutions",
              "Reduced access to public services or events",
              "Potential social isolation from avoiding monitored environments"
          ]
      },
      "stories": [
        {
          "story": "Prompted by the app's Friend Activity sidebar, Arjun turns on “Share my listening activity” so he can see friends. Wanting to add people he knows, he then connects his Facebook account. A coworker who's a Facebook friend now sees Arjun's real identity linked to his music account and his current listening in their Friend Activity feed, including disability-related podcasts Arjun plays for support.",
          "information_leaked": "Arjun's real-world identity linked to his music account, his current and recent listening activity (e.g., disability-related podcasts/playlists), and his presence/timing of listening in the past 7 days.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow1",
              "step_causing_harm": "step 7 (turning on 'Share my listening activity')"
            },
            {
              "function": 2,
              "flow_id": "flow1",
              "step_causing_harm": "step 4 (successful Facebook login that links accounts)"
            }
          ],
          "leakage_source": "The music app's sharing setting and the app's Facebook connect feature together expose Arjun's listening under his real identity.",
          "leak_to": "Facebook friends who also use the music app (including coworkers) and any music-app followers who can view Friend Activity.",
          "harms": [
            {
              "harm": "Reputational Harms",
              "cause": "Linking Facebook reveals Arjun's real identity next to sensitive listening activity."
            },
            {
              "harm": "Psychological Harms - Emotional Distress",
              "cause": "Seeing coworkers react to disability-focused content in Friend Activity causes anxiety and embarrassment."
            },
            {
              "harm": "Autonomy Harms - Thwarted Expectations and Failure to Inform",
              "cause": "The prompt implied enabling sharing would help Arjun see others' activity, but it also made his own activity visible without clearly communicating the scope of exposure once Facebook was linked."
            },
            {
              "harm": "Discrimination Harms",
              "cause": "Workplace contacts can infer disability status from his listening and may treat him differently."
            }
          ],
          "consequences": "Arjun stops listening to supportive disability resources on the app, deletes a helpful playlist, and avoids engaging with colleagues on the platform, increasing isolation and reducing access to useful content."
        },
        {
          "story": "Arjun starts a Private Session before listening to pain-management audio. Hours later, he forgets the session times out. After it automatically ends, his next play—an episode about mobility and assistive devices—appears in his friends' Activity feed, revealing sensitive interests he intended to keep private.",
          "information_leaked": "Sensitive listening immediately after Private Session auto-ends (e.g., mobility- and disability-related content), visible as current or recent listening in Friend Activity.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow6",
              "step_causing_harm": "N/A (context: Friend Activity is active and friends exist)"
            },
            {
              "function": 3,
              "flow_id": "flow4",
              "step_causing_harm": "step 3 (Private Session automatically ends after 6 hours)"
            }
          ],
          "leakage_source": "The music app's Private Session auto-expiry design exposes subsequent listening without a clear re-consent moment.",
          "leak_to": "Arjun's followers and any mutual-followed friends who view Friend Activity.",
          "harms": [
            {
              "harm": "Autonomy Harms - Thwarted Expectations and Lack of Control",
              "cause": "Private Session ends automatically; Arjun's sensitive listening becomes visible without an explicit warning at the moment of expiry."
            },
            {
              "harm": "Psychological Harms - Emotional Distress",
              "cause": "Realizing sensitive listening became visible triggers embarrassment and anxiety."
            },
            {
              "harm": "Relationship Harms",
              "cause": "Friends message him about the content, creating awkward conversations he wished to avoid."
            }
          ],
          "consequences": "Arjun avoids using the app for therapeutic audio, loses a convenient routine for pain management, and feels less in control of his privacy."
        },
        {
          "story": "Arjun tries to remove a neighbor (synced via Facebook) from his Friend Activity by clicking ‘Following' on their profile. The neighbor still appears in his feed, and because the Facebook sync persists, the neighbor can continue seeing Arjun's listening when he shares—contrary to what Arjun expected.",
          "information_leaked": "Ongoing visibility of Arjun's listening activity to a person he intended to remove, due to the Facebook-synced connection persisting despite ‘Unfollow.'",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow6",
              "step_causing_harm": "N/A (context: Friend Activity is active and shows friends)"
            },
            {
              "function": 4,
              "flow_id": "flow1",
              "step_causing_harm": "step 2 (Clicking 'Following' only unfollows a Facebook-synced friend locally; the person remains)"
            }
          ],
          "leakage_source": "The music app's handling of Facebook-synced connections; unfollowing does not remove the synced friend's visibility nor clearly inform how to sever the connection.",
          "leak_to": "The Facebook-synced neighbor who continues to see Arjun's activity when sharing is enabled.",
          "harms": [
            {
              "harm": "Autonomy Harms - Lack of Control and Thwarted Expectations",
              "cause": "The app allows ‘Unfollow' but the synced friend remains connected; removal does not stop exposure."
            },
            {
              "harm": "Psychological Harms - Disturbance",
              "cause": "Persistent unwanted visibility creates ongoing discomfort and stress."
            },
            {
              "harm": "Chilling Effects",
              "cause": "Arjun self-censors and stops listening to disability support audio to avoid the neighbor's gaze."
            }
          ],
          "consequences": "Arjun withdraws from using the app for supportive content and considers disconnecting Facebook entirely, reducing his social music experience and support network."
        },
        {
          "story": "While exploring settings from the Friend Activity prompt, Arjun doesn't notice that ‘Show my recently played artists on my public profile' is ON by default. Later he connects Facebook to find more friends. A collaborator visits his music profile and sees artists and shows associated with disability advocacy, inferring Arjun's disability status.",
          "information_leaked": "Recently played artists (and implied themes) shown on Arjun's public profile by default, combined with identity link via Facebook.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow2",
              "step_causing_harm": "step 6 (Social section defaults: 'Show my recently played artists on my public profile' is ON by default)"
            },
            {
              "function": 2,
              "flow_id": "flow1",
              "step_causing_harm": "step 4 (Successful Facebook linking increases discoverability of Arjun's public profile)"
            }
          ],
          "leakage_source": "The music app's default-on public profile setting for recently played artists, made more discoverable by Facebook linking.",
          "leak_to": "Work collaborators and other contacts who discover Arjun's profile through Facebook or the app and view his public profile.",
          "harms": [
            {
              "harm": "Autonomy Harms - Failure to Inform and Manipulation by Defaults",
              "cause": "Sensitive inferences can be made from artists shown publicly due to default-on visibility."
            },
            {
              "harm": "Reputational Harms",
              "cause": "Colleagues infer stigmatized information (disability status) from public profile content."
            },
            {
              "harm": "Discrimination Harms",
              "cause": "A collaborator deprioritizes Arjun for a client-facing role after viewing his profile."
            }
          ],
          "consequences": "Arjun loses a professional opportunity and feels pressured to scrub his history or keep his profile private, reducing the utility and enjoyment of the app."
        }
      ]
    },
    {
      "basic_info": {
        "name": "Maya",
        "age": 30,
        "tech_comfort_level": "high"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Intersectional identities and characteristics - Gender non-conforming individual",
        "privacy_awareness_level": "high",
        "information_cared_about": ["gender identity", "social media footprint", "dating profiles"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Disclosure of identity - outing exposes to harassment",
          "Privacy vs. Support - wants community but risks doxxing"
        ],
        "privacy_responses": [
          {
            "response": "Controlling disclosure",
            "description": "Maintains anonymous or pseudonym profiles focused on identity support."
          },
          {
          "response": "Privacy-enhancing technologies",
            "description": "Uses anonymous services and encrypted messaging."
          }
        ],
        "costs_and_consequences": [
          "Difficulty building personal connections under pseudonym",
          "Technical overhead and stress"
        ]
    },
    "additional_privacy_responses_and_costs": {
          "privacy_tensions_with_short_description": [
              "Privacy vs. Disclosure of identity - fear of being outed through online activity",
              "Privacy vs. Support - desire for connection vs. risk of exposure",
              "Privacy vs. Community visibility - activism increases risk of targeting"
          ],
          "privacy_responses": [
              {
                "response": "Limiting online disclosures",
                "description": "Carefully restricts the amount of personal or identity-related information shared online."
              },
              {
                "response": "Pseudonymous use",
                "description": "Creates and maintains anonymous or pseudonym dating profiles to seek support or connections without disclosure."
              },
              {
                "response": "Non-use of services",
                "description": "Avoids platforms perceived as risky due to potential exposure."
              },
              {
                "response": "Reliance on encrypted communication",
                "description": "Uses encrypted messaging apps and anonymous platforms to safeguard activist communication."
              }
          ],
          "costs_and_consequences": [
              "Restricted opportunities for authentic self-expression online",
              "Difficulty forming meaningful connections under pseudonym",
              "Exclusion from supportive or compatible dating communities",
              "Added technical burden of managing secure communication tools",
              "Stress from navigating constant threats of harassment"
          ]
    },
    "stories": [
      {
        "story": "Maya turns on Friend Activity and then connects her music app to Facebook to find friends. Minutes later, a coworker (Facebook friend) messages her referencing the \"Trans Voices\" playlist she just played—revealing her gender identity at work.",
        "information_leaked": "Real-time and recent (past 7 days) listening activity, including LGBTQ+ playlists and artists; linkability between Maya's pseudonymous music profile and her real-name Facebook identity through Facebook friend sync.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "Step 7: Maya switches 'Share my listening activity' to ON."
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "Step 4: After logging into Facebook, the app links accounts and syncs Facebook friends, exposing her listening activity to them by default."
          }
        ],
        "leakage_source": "The music app's Friend Activity auto-sharing to synced Facebook friends once 'Share my listening activity' is ON and Facebook is connected.",
        "leak_to": "Facebook-synced friends on the music app (e.g., coworkers and family members).",
        "harms": [
          {
            "harm": "Reputational Harms",
            "cause": "The app broadcasts Maya's sensitive listening choices to professional contacts via Facebook friend sync."
          },
          {
            "harm": "Discrimination Harms",
            "cause": "Coworkers learn about her gender identity through the app and may treat her differently at work."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Unanticipated outing by the app leads to anxiety and stress."
          },
          {
            "harm": "Autonomy Harms - Thwarted Expectations",
            "cause": "The 'Connect with Facebook' flow signals no posting to Facebook, but does not clearly warn that Facebook friends on the app will immediately see her listening activity."
          }
        ],
        "consequences": "A coworker confronts Maya about her playlists, she fears HR scrutiny and workplace bias, and she begins self-censoring her listening at work."
      },
      {
        "story": "Late at night, Maya enables Private Session to listen to a trans support podcast. The next afternoon, Private Session automatically ends without her noticing, and her listening activity reappears in Friend Activity—visible to acquaintances from work.",
        "information_leaked": "The specific sensitive tracks and podcasts listened to after Private Session auto-ends, plus timestamps implying her routine.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow6",
            "step_causing_harm": "Step 1: Opening the Friend Activity sidebar confirms she has followers/friends who can see activity when it's shared."
          },
          {
            "function": 3,
            "flow_id": "flow4",
            "step_causing_harm": "Step 3: The system automatically ends the Private Session after 6 hours, making listening activity visible again."
          }
        ],
        "leakage_source": "Automatic termination of Private Session by the music app after 6 hours.",
        "leak_to": "Followers and mutual friends in the app's Friend Activity sidebar, including coworkers.",
        "harms": [
          {
            "harm": "Autonomy Harms - Failure to Inform",
            "cause": "The auto-expiry of Private Session is easy to miss when started from the profile menu; activity resumes sharing without a prominent warning."
          },
          {
            "harm": "Reputational Harms",
            "cause": "Sensitive podcasts appear on Friend Activity, outing Maya's identity-related interests."
          },
          {
            "harm": "Psychological Harms - Chilling Effects",
            "cause": "Fear of further exposure discourages her from listening to supportive content."
          }
        ],
        "consequences": "Maya stops listening to LGBTQ+ support content during the day, avoids the app in the office, and feels isolated."
      },
      {
        "story": "Maya tries to remove an abusive ex (synced via Facebook) from her Friend Activity list. She unfollows them, but they still appear—and she worries they continue to see her listening activity.",
        "information_leaked": "Ongoing listening activity and patterns (genre, playlists, and timing), which can be used for monitoring.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow6",
            "step_causing_harm": "Step 1: Opening Friend Activity shows the ex is present and receiving updates."
          },
          {
            "function": 4,
            "flow_id": "flow1",
            "step_causing_harm": "Step 2: Clicking 'Following' on the ex's profile unfollows them, but the ex remains in Maya's Friend Activity list due to Facebook sync."
          }
        ],
        "leakage_source": "The music app's Facebook sync keeps the connection active even after Maya unfollows, preventing meaningful removal.",
        "leak_to": "The abusive ex who is connected via Facebook in the app.",
        "harms": [
          {
            "harm": "Relationship Harms",
            "cause": "The ex gains ongoing awareness of Maya's listening habits, enabling unwanted contact or monitoring."
          },
          {
            "harm": "Autonomy Harms - Lack of Control",
            "cause": "The app does not allow effective removal of a Facebook-synced contact from Friend Activity."
          },
          {
            "harm": "Physical Harms",
            "cause": "Regular activity timestamps may help the ex infer routines and locations, increasing safety risks."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Feeling watched despite attempts to unfollow increases anxiety."
          }
        ],
        "consequences": "Maya changes her listening times, avoids favorite playlists, and considers deleting her account due to safety concerns."
      },
      {
        "story": "Maya's public music profile quietly shows her recently played artists by default. A recruiter finds her profile and sees LGBTQ+ artists and activist playlists, which Maya had not intended to disclose in professional contexts.",
        "information_leaked": "Recently played artists and related identity-revealing patterns on Maya's public music profile.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow6",
            "step_causing_harm": "Step 1: Friend Activity is active; her account is in normal (non-private) sharing mode."
          },
          {
            "function": 3,
            "flow_id": "flow2",
            "step_causing_harm": "Step 3: In 'Social' settings, 'Show my recently played artists on my public profile' is ON by default and remains enabled (no explicit confirmation), exposing her tastes publicly."
          }
        ],
        "leakage_source": "The music app's default-on setting for displaying recently played artists on public profiles.",
        "leak_to": "A recruiter/hiring manager who searches and views Maya's public music profile.",
        "harms": [
          {
            "harm": "Economic Harms",
            "cause": "Publicly visible identity-revealing music tastes may lead to hiring bias."
          },
          {
            "harm": "Autonomy Harms - Thwarted Expectations",
            "cause": "Default-on public exposure of recently played artists contradicts Maya's expectation of limited sharing."
          },
          {
            "harm": "Reputational Harms",
            "cause": "Professional contacts infer aspects of Maya's identity from her public profile."
          }
        ],
        "consequences": "Maya is screened out of a job opportunity after the recruiter views her public profile; she later discovers the default setting and feels betrayed."
      },
      {
        "story": "Maya enables sharing and connects Facebook to find friends, then starts a Private Session to listen to sensitive content. Hours later, the session auto-ends; a hostile acquaintance (synced via Facebook) sees the activity. Maya tries to remove them via the three-dot menu but the unfollow doesn't remove the Facebook-synced connection.",
        "information_leaked": "Sensitive playlists and podcasts played after Private Session ended, plus the link between her real-name Facebook identity and the music app account.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow5",
            "step_causing_harm": "Step 4: Maya turns ON 'Share my listening activity' in Social settings, enabling broadcast to her network."
          },
          {
            "function": 2,
            "flow_id": "flow3",
            "step_causing_harm": "Step 5: Successful Facebook login links accounts and syncs Facebook friends who can now see her activity."
          },
          {
            "function": 3,
            "flow_id": "flow4",
            "step_causing_harm": "Step 3: Private Session automatically ends after 6 hours; activity becomes visible again without a prominent alert."
          },
          {
            "function": 4,
            "flow_id": "flow3",
            "step_causing_harm": "Step 3: Selecting 'Unfollow' from the three-dot menu on a Facebook-synced user does not remove them from Friend Activity."
          }
        ],
        "leakage_source": "A combination of the app's Facebook sync, auto-expiring Private Session, and ineffective unfollow for Facebook-synced contacts.",
        "leak_to": "A hostile acquaintance connected via Facebook on the app.",
        "harms": [
          {
            "harm": "Autonomy Harms - Lack of Control",
            "cause": "Maya cannot effectively remove a Facebook-synced observer despite unfollowing."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Unwanted exposure after Private Session ends creates anxiety and fear of harassment."
          },
          {
            "harm": "Relationship Harms",
            "cause": "Renewed contact and harassment from a hostile acquaintance after seeing her activity."
          }
        ],
        "consequences": "Maya is harassed, reduces her use of the app, and purges playlists to avoid future exposure; she contemplates abandoning the platform entirely."
      }
     ]
    },
    {
      "basic_info": {
        "name": "Elena",
        "age": 29,
        "tech_comfort_level": "medium"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Socioeconomic disadvantage - Unemployed single parent",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["financial records", "benefit claims", "contact info"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - welfare requires sharing data",
          "Disclosure vs. Stigma - revealing unemployment brings judgment"
        ],
        "privacy_responses": [
          {
            "response": "Withholding disclosure",
            "description": "Redacts or simplifies info on public-facing forms or forums."
          },
          {
          "response": "Privacy-enhancing technologies",
            "description": "Uses alias emails, avoids linking social profiles to forms."
          }
        ],
        "costs_and_consequences": [
          "Delays in benefit processing",
          "Complex account setup and management"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [],
      "privacy_responses": [
          {
            "response": "",
            "description": ""
          }
      ],
      "costs_and_consequences": []
    },
    "stories": [
      {
        "story": "Elena, a 29-year-old unemployed single mother, opens the music app's Friend Activity to feel connected to other parents. The sidebar nudges her to enable sharing, and then she connects her Facebook to find more friends. That evening, a school parent (synced from Facebook) sees Elena is listening to a podcast episode titled “Debt Relief 101,” and word spreads among the PTA.",
        "information_leaked": "Her real-time and recent listening activity (track/podcast titles and timestamps), her music-app profile linked to her Facebook identity, and visibility of her listening to finance/welfare-related content.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "Step 7 — Switching 'Share my listening activity' to ON begins broadcasting Elena's listening to followers and synced friends."
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "Step 4 — Successful Facebook login/authorization syncs her Facebook friends into the app, expanding the audience who can see her listening activity."
          }
        ],
        "leakage_source": "The music app's Friend Activity feature and Facebook-friend syncing after enabling 'Share my listening activity.'",
        "leak_to": "Facebook-synced school parents who use the app (e.g., a PTA acquaintance).",
        "harms": [
          {
            "harm": "Reputational harms",
            "cause": "Broadcasting sensitive listening (e.g., debt/benefits content) to school parents via Friend Activity after enabling sharing and syncing Facebook."
          },
          {
            "harm": "Psychological harms — emotional distress",
            "cause": "Unwanted exposure leads to gossip and embarrassment about her financial situation."
          },
          {
            "harm": "Autonomy harms — thwarted expectations/manipulation",
            "cause": "The app nudges 'Let friends and followers see what you are listening to' and 'Connect with Facebook' (with 'We'll never post to Facebook') which can imply low risk while still expanding in-app exposure."
          },
          {
            "harm": "Relationship harms",
            "cause": "Social tension with other parents after her sensitive listening is surfaced to them."
          }
        ],
        "consequences": "Gossip within the school community, awkward PTA interactions, and Elena avoids school events to reduce embarrassment, increasing isolation for her and her child."
      },
      {
        "story": "To avoid judgment, Elena starts a Private Session while listening during the day. Six hours later, the Private Session silently ends, and late that night she plays a playlist and a podcast for domestic abuse survivors. Her ex-partner, who follows her on the app, sees her 'currently listening' and the timestamp.",
        "information_leaked": "Real-time listening activity and timing (e.g., late-night sessions) and sensitive topics (domestic abuse survivor content) visible to followers.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "Step 7 — She previously turned ON 'Share my listening activity,' making any listening visible whenever Private Session is not active."
          },
          {
            "function": 3,
            "flow_id": "flow4",
            "step_causing_harm": "Step 3 — Private Session automatically ends after 6 hours; the padlock disappears and her listening resumes broadcasting without a proactive warning."
          }
        ],
        "leakage_source": "The music app's automatic Private Session timeout reverting her back to public sharing without a clear, proactive alert.",
        "leak_to": "A mutual-followed ex-partner on the app.",
        "harms": [
          {
            "harm": "Physical harms",
            "cause": "Revealing her late-night activity may enable monitoring or stalking behaviors by the ex-partner."
          },
          {
            "harm": "Psychological harms — emotional distress",
            "cause": "Fear and anxiety triggered by the ex-partner observing her sensitive listening in real time."
          },
          {
            "harm": "Autonomy harms — lack of control/failure to inform",
            "cause": "The quiet auto-expiration of Private Session undermines her expectation of ongoing privacy."
          },
          {
            "harm": "Relationship harms",
            "cause": "Reigniting contact and intimidation from the ex-partner after he sees her activity."
          }
        ],
        "consequences": "Threatening messages from the ex-partner, sleep disruption, and Elena refrains from using the app at night, chilling her enjoyment of music/podcasts when she needs it most."
      },
      {
        "story": "Elena notices her former landlord in her Friend Activity list after she enables sharing. She tries to remove him by unfollowing through the three-dot menu, but because he is a Facebook-synced friend, the unfollow doesn't remove him from her Friend Activity connections, and he keeps seeing her listening patterns.",
        "information_leaked": "Ongoing visibility of her listening history and timing (e.g., children's bedtime stories in the afternoon, signaling caregiving schedules) to the former landlord.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow5",
            "step_causing_harm": "Step 4 — Switching 'Share my listening activity' to ON starts broadcasting to all followers/synced friends, including the former landlord."
          },
          {
            "function": 4,
            "flow_id": "flow3",
            "step_causing_harm": "Step 3 — Selecting 'Unfollow' fails to remove him from visibility because the system flags the connection as a synced Facebook friend, leaving him in the Friend Activity context."
          }
        ],
        "leakage_source": "The music app's integration that keeps Facebook-synced friends connected for Friend Activity visibility despite unfollowing within the app.",
        "leak_to": "A former landlord synced via Facebook on the music app.",
        "harms": [
          {
            "harm": "Autonomy harms — lack of control",
            "cause": "Unfollow does not effectively remove a synced Facebook friend from seeing activity, making it difficult to control the audience."
          },
          {
            "harm": "Discrimination harms",
            "cause": "Landlord may infer her caregiving load or financial stress from what and when she listens, influencing future rental references."
          },
          {
            "harm": "Psychological harms — disturbance",
            "cause": "Ongoing sense of being watched by someone she tried to remove."
          },
          {
            "harm": "Relationship harms",
            "cause": "Prolonged, unwanted visibility maintains an intrusive connection with a previous power-holder (landlord)."
          }
        ],
        "consequences": "She avoids listening at certain times to reduce signaling her routines (chilling effect), and worries it could affect future housing references."
      },
      {
        "story": "Elena, preparing for job applications, enables sharing to see friends' music and then turns on Private Session to keep her anxiety playlists private. After she restarts the app, Private Session auto-ends without her noticing. A recruiter she knows (who follows her) sees her 'Job Interview Anxiety' playlist in real time.",
        "information_leaked": "Real-time and recent listening to anxiety/job-search content, visible to followers after Private Session ends on app restart.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "Step 7 — Enabling 'Share my listening activity' means any lapse in Private Session reverts listening to public by default."
          },
          {
            "function": 3,
            "flow_id": "flow6",
            "step_causing_harm": "Step 6 — Private Session automatically ends after 6 hours or on restart; after restart, her listening becomes visible again without a prominent warning."
          }
        ],
        "leakage_source": "The music app's default reversion to public sharing when Private Session ends on restart.",
        "leak_to": "A recruiter acquaintance who follows her on the app.",
        "harms": [
          {
            "harm": "Economic harms",
            "cause": "The recruiter infers high anxiety or instability from her listening, potentially reducing interview or referral opportunities."
          },
          {
            "harm": "Discrimination harms",
            "cause": "Biased judgment about mental health or employability based on sensitive listening."
          },
          {
            "harm": "Autonomy harms — thwarted expectations/failure to inform",
            "cause": "Private Session ending silently undermines her expectation that sensitive listening remains hidden."
          },
          {
            "harm": "Reputational harms",
            "cause": "Professional contact forms a negative impression from the visible listening activity."
          }
        ],
        "consequences": "Fewer callbacks, reduced confidence, and Elena spends time adjusting settings and re-checking privacy, increasing cognitive load while job hunting."
      },
      {
        "story": "Seeking more friends to follow, Elena connects her Facebook in the app. Because the app defaults to showing followers/following lists on her public profile, a neighbor who taps her name from Friend Activity sees she follows local food banks and benefits-advice profiles, linking her to socioeconomic hardship.",
        "information_leaked": "Public visibility of her followers and following lists on her music-app profile (including organizations related to food banks and benefit advice) due to default-on Social settings.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow3",
            "step_causing_harm": "Step 4 — Turning on the Friend Activity sidebar increases profile discoverability; combined with default-on public profile settings, this sets the stage for exposure."
          },
          {
            "function": 2,
            "flow_id": "flow3",
            "step_causing_harm": "Step 5 — Successful Facebook linking expands her network and, with defaults ON for 'Show my followers and following lists,' exposes her social graph to anyone who opens her profile."
          }
        ],
        "leakage_source": "The music app's default Social settings ('Show my followers and following lists on my public profile' ON) combined with Facebook sync and easy profile access via Friend Activity.",
        "leak_to": "A neighbor who uses the app and visits Elena's public profile from her Friend Activity entry.",
        "harms": [
          {
            "harm": "Reputational harms",
            "cause": "Associations (following food banks/benefits advice) can stigmatize her socioeconomic status."
          },
          {
            "harm": "Autonomy harms — failure to inform/thwarted expectations",
            "cause": "Defaults reveal her social graph without requiring explicit opt-in or clear warning at the point of Facebook sync."
          },
          {
            "harm": "Psychological harms — emotional distress",
            "cause": "Embarrassment and anxiety about being judged by neighbors."
          }
        ],
        "consequences": "Awkward encounters in her building, perceived stigma, and she spends time trying to find and disable public profile toggles; she may retreat from using the app socially."
      }
     ]
    },
    {
      "basic_info": {
        "name": "Noah",
        "age": 40,
        "tech_comfort_level": "low"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Socioeconomic disadvantage - Low literacy adult",
        "privacy_awareness_level": "low",
        "information_cared_about": ["identity", "financial data", "basic navigation data"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Accessibility - cannot understand consent forms",
          "Privacy vs. Support - wants services but unsure what gives away info"
        ],
        "privacy_responses": [
          {
            "response": "Apathy",
            "description": "Clicks through defaults or avoids use entirely."
          },
          {
          "response": "Non-use",
            "description": "Avoids apps and platforms perceived complex."
          }
        ],
        "costs_and_consequences": [
          "Exclusion from digital services or aid",
          "Misunderstanding of terms leading to unexpected exposure"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
          "Privacy vs. Accessibility - complexity of privacy notices forces bypassing them",
          "Privacy vs. Support - uncertainty about what data is shared prevents engagement with services"
      ],
      "privacy_responses": [
          {
            "response": "Click-through behavior",
            "description": "Skips over or accepts default privacy settings without reading notices."
          },
          {
            "response": "Avoidance of digital services",
            "description": "Chooses not to engage with apps or platforms that feel overwhelming due to text-heavy privacy or security requirements."
          }
      ],
      "costs_and_consequences": [
          "Inadvertent exposure of sensitive data",
          "No awareness of the scope of consent provided",
          "Exclusion from useful services and opportunities",
          "Increased vulnerability due to reliance on offline or informal alternatives"
      ]
    },
    "stories": [
      {
        "story": "Noah wants to see what his friends are listening to. Following the app's prompt, he switches on sharing and then connects Facebook to find more friends. That evening, a former coworker (synced through Facebook) opens their Friend Activity and sees Noah's real-time listening—including a heartbreak playlist—then mentions it in the work group chat.",
        "information_leaked": "Noah's real-time listening activity and recently played tracks on the music app; his music app account is linked to his real name and profile photo via Facebook; visibility to a larger audience of synced Facebook friends on the app.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 (turns on 'Share my listening activity')"
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4 (successful Facebook login and account linking syncs friends)"
          }
        ],
        "leakage_source": "The music app's 'Share my listening activity' feature combined with Facebook friend syncing.",
        "leak_to": "Coworkers who are Facebook friends and also use the music app (mutuals in Friend Activity).",
        "harms": [
          {
            "harm": "Reputational Harms",
            "cause": "The app surfaces Noah's listening in real time to a broad set of synced Facebook friends without clear, low-literacy-friendly explanation of the audience impact."
          },
          {
            "harm": "Autonomy Harms - Manipulation and Thwarted Expectations",
            "cause": "The sidebar nudges Noah to enable sharing to see friends, which he interprets as required; he does not understand he's making his activity public to many contacts."
          },
          {
            "harm": "Relationship Harms",
            "cause": "Coworkers gossip after seeing Noah's personal playlists and recent activity."
          }
        ],
        "consequences": "Noah is embarrassed, withdraws from the app, and avoids digital music services, compounding his digital exclusion."
      },
      {
        "story": "Noah turns on a Private Session before listening at a community center, believing it will keep his activity hidden. Six hours later, the session silently ends and he keeps listening; his activity starts sharing again to followers and Facebook-synced contacts without him realizing.",
        "information_leaked": "Noah's resumed real-time listening activity after the Private Session auto-ends (e.g., time-of-day patterns and sensitive track choices).",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow6",
            "step_causing_harm": "step 1 (context: opens Friend Activity; does not itself cause harm)"
          },
          {
            "function": 3,
            "flow_id": "flow4",
            "step_causing_harm": "step 3 (system automatically ends Private Session after 6 hours)"
          }
        ],
        "leakage_source": "The music app's Private Session auto-expiration with minimal, transient feedback (padlock disappears) that is easy to miss for a low-literacy user.",
        "leak_to": "Mutual followers and Facebook-synced friends on the app who have access to Friend Activity.",
        "harms": [
          {
            "harm": "Autonomy Harms - Failure to Inform and Lack of Control",
            "cause": "The app ends Private Session automatically after 6 hours; the only indicator (padlock icon disappearance) is subtle and not explained in a low-literacy-friendly way."
          },
          {
            "harm": "Reputational Harms",
            "cause": "Contacts infer personal struggles from sensitive late-night listening."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Noah feels exposed and anxious after discovering his listening became public again without his clear awareness."
          }
        ],
        "consequences": "Noah reduces his listening and avoids the app entirely (chilling effect), missing out on learning and community benefits."
      },
      {
        "story": "Noah connects Facebook to find familiar faces and enables sharing to see friends' tracks. He tries to remove an ex-partner from his feed by unfollowing via the three-dot menu, but because they are a synced Facebook friend, the removal doesn't take effect. The ex continues to see Noah's activity and messages him about songs he plays late at night.",
        "information_leaked": "Ongoing access to Noah's real-time listening and activity patterns to a person he tried to remove (ex-partner), including inferred schedule and emotional state.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 (turns on 'Share my listening activity')"
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4 (successful Facebook linking keeps the ex-partner as a synced friend)"
          },
          {
            "function": 4,
            "flow_id": "flow3",
            "step_causing_harm": "step 3 (attempted 'Unfollow' on a synced Facebook friend is ineffective; they remain connected)"
          }
        ],
        "leakage_source": "The music app's design that treats synced Facebook friends differently—Unfollow via the three-dot menu does not sever visibility for that connection.",
        "leak_to": "Ex-partner who remains connected through Facebook sync on the music app.",
        "harms": [
          {
            "harm": "Autonomy Harms - Lack of Control",
            "cause": "The app provides an Unfollow control that does not work as expected for synced Facebook friends, leaving Noah's sharing intact to the ex."
          },
          {
            "harm": "Relationship Harms",
            "cause": "Unwanted contact and boundary violations persist because the ex can still view Noah's activity."
          },
          {
            "harm": "Physical Harms (risk)",
            "cause": "The ex can infer Noah's routines and locations from consistent listening times and patterns."
          }
        ],
        "consequences": "Noah feels unsafe, changes routines, and avoids the app; he may need outside help to fully sever the connection (block), which he did not understand."
      },
      {
        "story": "At a public library computer, Noah opens the Friend Activity sidebar. A nearby patron can see the list of Noah's friends and the tracks they're playing, revealing Noah's social circle and interests by association.",
        "information_leaked": "Noah's social graph and associations on the music app (names/profile images of friends and what they're playing), from which bystanders can infer Noah's communities and interests.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow6",
            "step_causing_harm": "step 1 (opening the Friend Activity sidebar exposes identifiable friend activity on-screen)"
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4 (Facebook linking previously expanded the visible list with real-name identities)"
          }
        ],
        "leakage_source": "The music app's Friend Activity UI showing identifiable friends' listening in a persistent sidebar on a public screen.",
        "leak_to": "Strangers in proximity at the library (shoulder surfers), including staff.",
        "harms": [
          {
            "harm": "Discrimination Harms",
            "cause": "Visible associations and listening topics can out Noah's membership in sensitive communities by inference."
          },
          {
            "harm": "Psychological Harms - Disturbance",
            "cause": "Noah experiences stress knowing that bystanders can see personal networks and tastes."
          },
          {
            "harm": "Reputational Harms",
            "cause": "Local gossip or biased judgments arise from visible friend names and musical choices."
          }
        ],
        "consequences": "Noah becomes reluctant to use the app on public computers, increasing his digital exclusion."
      },
      {
        "story": "Noah enables sharing to see what others are playing and links Facebook. His supervisor, who is a Facebook friend on the app, notices Noah's frequent daytime listening and assumes he's distracted at work, citing his music feed as evidence to cut his hours.",
        "information_leaked": "Noah's continuous real-time listening activity and recently played items tied to his real name and work-hours patterns, visible to synced Facebook contacts.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 (turns on 'Share my listening activity', exposing real-time activity)"
          },
          {
            "function": 2,
            "flow_id": "flow3",
            "step_causing_harm": "step 5 (successful Facebook linking in Settings connects supervisor and other contacts)"
          }
        ],
        "leakage_source": "The music app's sharing defaults once enabled and Facebook identity sync that broadens the audience to workplace contacts.",
        "leak_to": "Noah's supervisor who is a Facebook friend using the music app.",
        "harms": [
          {
            "harm": "Economic Harms",
            "cause": "Shared activity allows a supervisor to infer work-time behavior and penalize Noah economically."
          },
          {
            "harm": "Autonomy Harms - Thwarted Expectations",
            "cause": "Noah believed he was simply enabling a view of friends' activity, not consenting to a broad, work-impacting audience."
          },
          {
            "harm": "Reputational Harms",
            "cause": "The supervisor forms a negative impression from the visible activity feed."
          }
        ],
        "consequences": "Noah loses paid hours, worsening his financial instability and trust in digital services."
      }
    ]
  },
  {
    "basic_info": {
      "name": "Rosa",
      "age": 55,
      "tech_comfort_level": "low"
    },
    "contextual_info": {
      "vulnerability_type_brief_description": "Socioeconomic disadvantage - Rural subsistence farmer",
      "privacy_awareness_level": "low",
      "information_cared_about": ["land ownership records", "income", "location"]
    },
    "privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
        "Privacy vs. Inclusion - agricultural platforms collect economic data",
        "Privacy vs. Location - geo-tracking may expose farm lands"
      ],
      "privacy_responses": [
        {
          "response": "Non-use",
          "description": "Rejects farm-management apps fearing data exposure."
        }
      ],
      "costs_and_consequences": [
        "Missed productivity tools or weather alerts",
        "Continued digital exclusion from markets"
      ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
          "Privacy vs. Location - data collection can expose land and operational details",
          "Privacy vs. Inclusion - uncertainty over data ownership and control",
          "Privacy vs. Land security - disclosure risks exploitation or land seizure"
      ],
      "privacy_responses": [
          {
            "response": "Skeptical engagement",
            "description": "Approaches digital tools with caution or avoids them due to fear of exploitation."
          },
          {
            "response": "Avoidance of data sharing",
            "description": "Chooses not to upload or share farm data on platforms due to lack of clarity on data use."
          },
          {
            "response": "Withholding sensitive details",
            "description": "Avoids sharing land ownership or income data with platforms or external actors."
          }
      ],
      "costs_and_consequences": [
          "Loss of potential benefits from data-driven farming solutions",
          "Exclusion from markets and support programs requiring digital participation",
          "Reduced access to financial or developmental programs requiring documentation of farm data",
          "Persistent mistrust in digitalization efforts"
      ]
    },
    "stories": [
      {
        "story": "Rosa, a 55-year-old rural farmer with low tech comfort, opens the music app to see what her niece listens to. She turns on sharing in Settings and then connects the app to Facebook via the 'Add Friends' flow. Overnight, her synced Facebook contacts can see in real time that she's listening to land-rights podcasts and protest folk songs, linking her music profile to her real name.",
        "information_leaked": "Real-time and recent listening activity (tracks, playlists, and timestamps up to 7 days), 'now playing' status, and cross-context identity linkage between Rosa's music app account and her Facebook identity (name and profile picture).",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 - Turned 'Share my listening activity' ON, enabling broadcast of listening activity."
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4 - Successful Facebook login/authorization, syncing FB friends who can now see Rosa's listening activity."
          }
        ],
        "leakage_source": "The music app's Friend Activity sharing feature combined with Facebook account syncing.",
        "leak_to": "Synced Facebook friends such as neighbors, local cooperative leaders, and family members.",
        "harms": [
          {
            "harm": "Reputational Harms",
            "cause": "Friend Activity exposes specific podcasts and songs tied to land rights and protest themes to Rosa's local network."
          },
          {
            "harm": "Relationship Harms",
            "cause": "Synced Facebook contacts in Rosa's small community see her listening and gossip about her views."
          },
          {
            "harm": "Autonomy Harms - Thwarted Expectations / Failure to Inform",
            "cause": "The app nudges Rosa to enable sharing to see friends, but does not make clear the cross-context identity linkage and breadth of exposure once Facebook is connected."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Rosa worries about being judged in her village for the content she listens to."
          }
        ],
        "consequences": "Local cooperative members treat her warily; a community organizer critiques her in public meetings. Rosa withdraws from digital tools and avoids listening to news/music she values."
      },
      {
        "story": "To keep her listening private for the evening, Rosa starts a Private Session. She believes it will last all night, but after 6 hours the app automatically ends the session while she's still streaming a program about debt relief. Her friends and synced contacts see her activity update again with timestamps.",
        "information_leaked": "Titles of sensitive shows and playlists and the time they were played after the Private Session automatically ended.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 - 'Share my listening activity' is ON, so once privacy ends, her activity is visible to friends."
          },
          {
            "function": 3,
            "flow_id": "flow4",
            "step_causing_harm": "step 3 - Private Session auto-ends after 6 hours, resuming broadcast of listening activity."
          }
        ],
        "leakage_source": "The music app's Private Session auto-expiration behavior.",
        "leak_to": "Mutual-followed friends on the music app and any synced Facebook friends.",
        "harms": [
          {
            "harm": "Autonomy Harms - Failure to Inform / Lack of Control",
            "cause": "The auto-ending Private Session silently re-exposes Rosa's listening without a clear, persistent warning."
          },
          {
            "harm": "Reputational Harms",
            "cause": "Sensitive listening (debt relief programs) becomes visible to community members."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Embarrassment and anxiety after a church elder mentions seeing her late-night listening."
          },
          {
            "harm": "Relationship Harms",
            "cause": "Family and neighbors question her financial situation after seeing her activity."
          }
        ],
        "consequences": "Rosa avoids the app and censors her own listening (chilling effects), losing enjoyment and community connection she sought from music."
      },
      {
        "story": "After connecting Facebook, a nosy cousin keeps commenting on Rosa's music. She tries to remove him by using the Unfollow option on his profile. Because he is a Facebook-synced friend, the app shows him still in Friend Activity. Rosa assumes she removed him and plays playlists about urban job opportunities; he sees it and tells family members.",
        "information_leaked": "Her ongoing listening activity and timing (e.g., urban job-search playlists), visible to a Facebook-synced contact she believed she removed.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 - 'Share my listening activity' is ON, enabling ongoing visibility."
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4 - Successful Facebook syncing introduced the cousin into Friend Activity."
          },
          {
            "function": 4,
            "flow_id": "flow3",
            "step_causing_harm": "step 3 - Clicking 'Unfollow' on a Facebook-synced friend does not remove them from Friend Activity, leading to continued exposure."
          }
        ],
        "leakage_source": "The music app's design preventing removal of Facebook-synced friends via Unfollow in Friend Activity.",
        "leak_to": "The Facebook-synced cousin and, by word-of-mouth, extended family.",
        "harms": [
          {
            "harm": "Autonomy Harms - Lack of Control / Thwarted Expectations",
            "cause": "Rosa's attempt to unfollow does not remove the Facebook-synced friend, contrary to what she expects."
          },
          {
            "harm": "Relationship Harms",
            "cause": "The cousin shares her listening choices with family, causing friction and unwanted attention."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Stress and embarrassment when relatives confront her about plans to seek work elsewhere."
          }
        ],
        "consequences": "Rosa curtails her job-search listening and distrusts the app, missing timely information that could improve her livelihood."
      },
      {
        "story": "Rosa enables sharing to see friends and later connects to Facebook from Settings. The default Social setting 'Show my recently played artists on my public profile' remains ON. Her music profile—now discoverable by name via Facebook—publicly lists artists like 'Urban Protest Choir' and 'Debt Relief Talk.' A microfinance officer reviewing her online presence sees this and disfavors her loan application.",
        "information_leaked": "Publicly visible list of recently played artists on Rosa's music profile, linked to her real-world identity via Facebook.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 - Turning 'Share my listening activity' ON while the default 'Show my recently played artists on my public profile' remains ON makes her tastes broadly visible."
          },
          {
            "function": 2,
            "flow_id": "flow3",
            "step_causing_harm": "step 5 - Successful Facebook connection links her real name, making her public profile easily findable."
          }
        ],
        "leakage_source": "The music app's default-on public profile setting for recently played artists, coupled with Facebook identity sync.",
        "leak_to": "Anyone on the music app who can find her profile, including a local microfinance officer.",
        "harms": [
          {
            "harm": "Economic Harms",
            "cause": "A loan reviewer uses public music profile information to negatively assess Rosa's risk or priorities."
          },
          {
            "harm": "Discrimination Harms",
            "cause": "Judgment about her cultural/political tastes influences access to financial services."
          },
          {
            "harm": "Reputational Harms",
            "cause": "Her public artist list creates a negative impression in a conservative community context."
          },
          {
            "harm": "Autonomy Harms - Failure to Inform",
            "cause": "The app does not clearly highlight that recently played artists are publicly visible by default when sharing is enabled."
          }
        ],
        "consequences": "Her loan is delayed or denied, increasing financial strain; Rosa becomes more skeptical of digital services and avoids using the app."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Leo",
        "age": 17,
        "tech_comfort_level": "high"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Socioeconomic disadvantage - Urban poor teenager",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["social ties", "financial help", "school info"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - school support apps require personal info",
          "Privacy vs. Disclosure of identity - peers might judge background"
        ],
        "privacy_responses": [
          {
            "response": "Withholding disclosure",
            "description": "Uses minimal profile info or anonymous submission."
          },
          {
            "response": "Controlling disclosure",
            "description": "Uses different accounts for school, social, and support."
          }
        ],
        "costs_and_consequences": [
          "Fragmented identity across platforms",
          "Mental effort managing clones"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
          "Privacy vs. Support - access to school apps requires sharing personal details",
          "Privacy vs. Disclosure of identity - fear of peer judgment drives careful control of visibility",
          "Privacy vs. Opportunity - online presence offers benefits but risks surveillance"
      ],
      "privacy_responses": [
          {
            "response": "Reluctant compliance",
            "description": "Shares required data for educational access despite not fully understanding risks."
          },
          {
            "response": "Audience restriction",
            "description": "Uses privacy settings or anonymous posting to limit who can view sensitive content."
          },
          {
            "response": "Self-censorship",
            "description": "Avoids posting about sensitive topics like finances or school struggles to prevent stigma or monitoring."
          }
      ],
      "costs_and_consequences": [
          "Unaware of long-term implications of student data collection",
          "Emotional and cognitive effort in maintaining multiple accounts",
          "Fragmented identity across platforms",
          "Loss of authentic expression",
          "Missed opportunities for support due to withholding information"
      ]
    },
    "stories": [
      {
        "story": "Leo, a 17-year-old who keeps separate online personas, turns on sharing so he can see his friends' music, then connects the music app to Facebook to find more friends. His part-time store supervisor (already a Facebook friend) starts seeing Leo's real-time listening at 2 p.m. during Leo's shift and the titles of tracks like “Budget Meals for Teens,” leading the boss to assume he's slacking and struggling financially.",
        "information_leaked": "Real name linked via Facebook to Leo's music account; real-time ‘listening now' status; track/playlist titles; timestamps during work hours; follower graph showing mutual connections.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7: Leo switches 'Share my listening activity' ON, enabling broadcast to followers/synced Facebook friends."
          },
          {
            "function": 2,
            "flow_id": "flow3",
            "step_causing_harm": "step 5: Successful Facebook login links accounts, adding Facebook friends to the Friend Activity network that now receives Leo's shared listening."
          }
        ],
        "leakage_source": "The music app's Friend Activity feature after Facebook sync (automatic sharing to mutual followers and synced Facebook friends).",
        "leak_to": "Store supervisor and older coworkers who are Facebook friends and became followers via the sync.",
        "harms": [
          {
            "harm": "Economic Harms",
            "cause": "Friend Activity exposes on-the-clock listening and infers lack of diligence; supervisor interprets it as time theft."
          },
          {
            "harm": "Reputational Harms",
            "cause": "Titles implying financial strain are visible to workplace contacts, damaging Leo's reputation as reliable."
          },
          {
            "harm": "Autonomy Harms — Failure to Inform / Thwarted Expectations",
            "cause": "UI encourages Facebook connection to 'see friends' without saliently warning that Leo's own activity will be pushed to those same contacts by default."
          }
        ],
        "consequences": "Supervisor cuts Leo's hours and gives him a warning; coworkers tease him about ‘broke teen' playlists; Leo stops using the app at work and feels forced to self-censor."
      },
      {
        "story": "Before cramming for exams, Leo starts a Private Session to keep his listening hidden while checking out ‘Scholarship interview prep' and ‘Rent relief resources' playlists. Hours later, the app silently ends the Private Session; Leo keeps streaming late into the night, and classmates plus a scholarship mentor see his activity in Friend Activity.",
        "information_leaked": "Track/playlist titles signaling financial stress and scholarship prep; late-night timestamps; continued listening after Private Session auto-expired.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7: Leo previously enabled 'Share my listening activity', making him rely on Private Session for privacy."
          },
          {
            "function": 3,
            "flow_id": "flow4",
            "step_causing_harm": "step 3: Private Session automatically ends after 6 hours; the padlock disappears and the app resumes broadcasting Leo's listening."
          }
        ],
        "leakage_source": "The music app automatically ending Private Session after 6 hours, resuming sharing to Friend Activity without an interruptive warning.",
        "leak_to": "Classmates who follow Leo and a scholarship mentor who follows students' profiles.",
        "harms": [
          {
            "harm": "Autonomy Harms — Lack of Control / Failure to Inform",
            "cause": "Private Session auto-termination and subtle icon change make it easy to miss that sharing has resumed."
          },
          {
            "harm": "Psychological Harms — Emotional Distress",
            "cause": "Unwanted exposure of sensitive financial-aid content creates embarrassment and anxiety."
          },
          {
            "harm": "Reputational Harms",
            "cause": "Peers and mentor infer Leo's financial situation and study stress from the playlists."
          }
        ],
        "consequences": "Mentor questions Leo's readiness; classmates tease him; Leo avoids listening to helpful resources and self-censors, missing support he needs."
      },
      {
        "story": "Leo syncs Facebook to find friends, then realizes his older cousin—who gossips—now follows him. Leo tries to remove the cousin by unfollowing from their profile, but the app treats the connection as Facebook-synced and keeps the cousin in Friend Activity. The cousin continues to see Leo's current tracks and shares them with family.",
        "information_leaked": "Ongoing listening activity (tracks/playlists and recent listens), ‘listening now' presence, and patterns (e.g., late-night listening) to a Facebook-synced contact Leo cannot remove via unfollow.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7: Leo enables 'Share my listening activity', making activity visible to synced contacts."
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4: Facebook login succeeds, importing Facebook friends (including the cousin) into the social graph that receives Leo's activity."
          },
          {
            "function": 4,
            "flow_id": "flow1",
            "step_causing_harm": "step 2: Clicking 'Following' on a Facebook-synced friend fails to remove them from Friend Activity; the connection persists."
          }
        ],
        "leakage_source": "The music app's Facebook sync coupled with the inability to remove a synced Facebook friend from Friend Activity via unfollow.",
        "leak_to": "Leo's older cousin imported from Facebook and, via gossip, other family members.",
        "harms": [
          {
            "harm": "Relationship Harms",
            "cause": "Persistent visibility to an unwanted contact leads to gossip and family tension."
          },
          {
            "harm": "Psychological Harms — Disturbance",
            "cause": "Leo feels surveilled by someone he tried to remove but cannot due to the app's design."
          },
          {
            "harm": "Autonomy Harms — Lack of Control",
            "cause": "Design prevents effective removal of Facebook-synced contacts from seeing activity via simple unfollow."
          }
        ],
        "consequences": "Family members confront Leo about his music and routines; Leo withdraws from the app and spends extra effort managing multiple accounts to avoid being watched."
      },
      {
        "story": "Leo's school administrator is a Facebook contact. After Leo connects the app to Facebook, the admin sees Friend Activity showing Leo listening to explicit drill tracks during lunch and later that afternoon. The admin labels him a ‘behavior risk' and denies him a student ambassador role.",
        "information_leaked": "Real-name linkage via Facebook, explicit track titles/album art, and timestamps during school hours.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7: 'Share my listening activity' ON enables the admin to see his listening once synced."
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4: Successful Facebook connect imports the school administrator as a friend who now receives Leo's activity."
          }
        ],
        "leakage_source": "The music app's Friend Activity feed after Facebook sync, broadcasting to contacts drawn from Facebook.",
        "leak_to": "School administrator who is a Facebook friend and becomes a follower in the app.",
        "harms": [
          {
            "harm": "Discrimination Harms",
            "cause": "Content-based stereotyping (music genre, timing) informs an adverse decision on a school opportunity."
          },
          {
            "harm": "Reputational Harms",
            "cause": "The admin's perception of Leo shifts negatively due to visible music choices."
          },
          {
            "harm": "Autonomy Harms — Thwarted Expectations",
            "cause": "Leo expected to discover friends via Facebook, not to expose his tastes to school officials."
          }
        ],
        "consequences": "Leo is denied a leadership role; he feels unfairly judged and avoids using the app during school, limiting social interaction and discovery."
      },
      {
        "story": "To find classmates, Leo connects the app to Facebook and later starts a Private Session before playing a sensitive identity-support podcast. After 6 hours, Private Session ends silently while Leo is still listening. A relative synced via Facebook sees the activity and messages Leo's parent about it, triggering conflict at home.",
        "information_leaked": "Sensitive podcast titles; resume of sharing after Private Session expiration; linkage of listening activity to Leo's real name via Facebook.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7: Sharing is enabled, so when Private Session ends, activity becomes visible."
          },
          {
            "function": 2,
            "flow_id": "flow3",
            "step_causing_harm": "step 5: Facebook connect succeeds, syncing relatives who now receive Leo's activity."
          },
          {
            "function": 3,
            "flow_id": "flow4",
            "step_causing_harm": "step 3: Private Session automatically ends after 6 hours, resuming broadcast of listening without an interruptive alert."
          }
        ],
        "leakage_source": "Combination of Facebook sync and the app's auto-ending Private Session, which silently resumes sharing to Friend Activity.",
        "leak_to": "A relative imported from Facebook and, indirectly, Leo's parent who is contacted by the relative.",
        "harms": [
          {
            "harm": "Psychological Harms — Emotional Distress",
            "cause": "Unwanted exposure of sensitive identity-support content to family via Friend Activity."
          },
          {
            "harm": "Relationship Harms",
            "cause": "Family conflict sparked by the relative's monitoring of Leo's activity."
          },
          {
            "harm": "Autonomy Harms — Lack of Control",
            "cause": "Privacy depended on a session that auto-expired; Leo was not clearly warned at the moment sharing resumed."
          }
        ],
        "consequences": "Argument at home; Leo deletes the Facebook connection and stops using helpful podcasts, increasing isolation and reducing access to support."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Layla",
        "age": 19,
        "tech_comfort_level": "medium"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Socioeconomic disadvantage - Housing-insecure youth",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["location", "shelter history", "service usage"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - shelter services require registration",
          "Privacy vs. Disclosure of identity - fears data used against housing status"
        ],
        "privacy_responses": [
          {
            "response": "Withholding disclosure",
            "description": "Shares only essential info when asked."
          },
          {
            "response": "Asking for help",
            "description": "Inquires privately from known support organizations."
          }
        ],
        "costs_and_consequences": [
          "Reduced access to certain support if incomplete",
          "Risk of trusting unreliable guidance"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
          "Privacy vs. Support - data disclosure required for access to shelter or services",
          "Privacy vs. Location safety - phones provide support access but risk exposure of movement or shelter locations",
          "Privacy vs. Digital continuity - erasing digital traces protects privacy but disrupts records"
      ],
      "privacy_responses": [
          {
            "response": "Minimal disclosure",
            "description": "Shares only what is absolutely necessary during intake processes to reduce risk."
          },
          {
            "response": "Limiting phone use",
            "description": "Restricts use of apps or services perceived as risky in order to protect sensitive data."
          },
          {
            "response": "Data deletion and wiping",
            "description": "Actively removes sensitive information from devices to prevent exposure."
          }
      ],
      "costs_and_consequences": [
          "Incomplete disclosures may restrict access to critical resources",
          "Persistent mistrust of service providers",
          "Reduced access to safety-enhancing features and communication tools",
          "Isolation from potential support networks",
          "Loss of valuable records or communication history",
          "Additional stress from needing constant digital hygiene practices"
      ]
    },
    "stories": [
      {
        "story": "Layla links her Facebook to find friends on the music app. With sharing turned on, an old classmate (a Facebook friend) opens their Friend Activity sidebar and sees that Layla is listening right now to a podcast episode titled 'Shelter Orientation: Haven House.' The classmate infers she's using shelter services and starts telling mutual friends.",
        "information_leaked": "Real-time listening activity (track/podcast and playlist titles), linkage of Layla's music account to her Facebook identity, and timing of listening that implies service usage (shelter orientation).",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 (Layla turns on 'Share my listening activity')"
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4 (Successful Facebook login links account and syncs friends)"
          }
        ],
        "leakage_source": "The music app's Friend Activity sharing combined with Facebook friend sync.",
        "leak_to": "A Facebook-synced friend (old classmate) and any mutual followers on the app.",
        "harms": [
          {
            "harm": "Reputational Harms",
            "cause": "Friend Activity exposes sensitive podcast/playlist titles that suggest shelter usage to social contacts."
          },
          {
            "harm": "Discrimination Harms",
            "cause": "The classmate's knowledge of Layla's shelter usage could influence others' bias in school or work settings."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Unwanted revelation of housing instability triggers anxiety and shame."
          },
          {
            "harm": "Autonomy Harms - Lack of Control",
            "cause": "Turning on sharing applies broadly to synced Facebook friends without granular controls."
          }
        ],
        "consequences": "Rumors spread through mutual friends; Layla withdraws from a youth program out of embarrassment, losing access to support and opportunities."
      },
      {
        "story": "Trying to keep her listening private late at night in a shared shelter space, Layla starts a Private Session. After six hours, it silently ends. She keeps listening, not realizing her activity is visible again. A caseworker who follows her sees her playing 'Sleep Sounds for Noisy Dorms' around midnight, inferring she spent the night at the shelter.",
        "information_leaked": "Post–Private Session listening activity, including sensitive playlist titles and near-real-time listening timestamps that imply nighttime shelter stay.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 (Layla turns on 'Share my listening activity' earlier in the day)"
          },
          {
            "function": 3,
            "flow_id": "flow4",
            "step_causing_harm": "step 3 (Private Session automatically ends after 6 hours)"
          }
        ],
        "leakage_source": "Automatic timeout of Private Session re-enables Friend Activity sharing without a prominent alert.",
        "leak_to": "A social worker who follows Layla on the app, and potentially any other followers.",
        "harms": [
          {
            "harm": "Autonomy Harms - Thwarted Expectations",
            "cause": "Private Session ends automatically after six hours; Layla expects continued privacy overnight."
          },
          {
            "harm": "Autonomy Harms - Lack of Control",
            "cause": "The app resumes sharing without requiring confirmation or providing a clear alert."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Being observed during vulnerable hours increases stress and feelings of surveillance."
          },
          {
            "harm": "Relationship Harms",
            "cause": "The caseworker confronts Layla based on assumptions about her movements and compliance with plans."
          }
        ],
        "consequences": "Layla avoids using music at night to cope; her sleep worsens and trust in the caseworker erodes, making support engagement harder."
      },
      {
        "story": "After connecting Facebook, Layla notices an ex-roommate (FB friend) in her Friend Activity and worries they can see her listening too. She tries to remove them by unfollowing from their profile, but because they're a synced Facebook friend, they keep appearing—and can still see her activity.",
        "information_leaked": "Ongoing exposure of Layla's listening activity and online presence to an unwanted Facebook contact.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 (Layla turns on 'Share my listening activity')"
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4 (Facebook linking syncs the ex-roommate into the app)"
          },
          {
            "function": 4,
            "flow_id": "flow1",
            "step_causing_harm": "step 2 (Unfollow attempt fails to remove a synced Facebook friend from Friend Activity)"
          }
        ],
        "leakage_source": "The app's Facebook sync plus broad sharing; removal tools don't stop synced FB contacts from seeing activity.",
        "leak_to": "The ex-roommate (Facebook-synced friend).",
        "harms": [
          {
            "harm": "Autonomy Harms - Lack of Control",
            "cause": "Unfollow does not prevent a synced FB friend from seeing Layla's activity; controls are insufficient."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Persistent visibility to someone Layla is trying to avoid increases anxiety."
          },
          {
            "harm": "Relationship Harms",
            "cause": "Continued digital visibility risks unwanted contact or monitoring by the ex-roommate."
          }
        ],
        "consequences": "Layla deletes the app to stop the exposure, losing a key coping tool and social connection during an already unstable time."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Samir",
        "age": 33,
        "tech_comfort_level": "low"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Internal and experiential factors - Survivor of domestic violence",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["location", "communications", "support usage"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - contacting services may alert abuser",
        "Privacy vs. Autonomy - needs to hide usage from partner",
        "Privacy vs. Safety - surveillance forces reliance on insecure or temporary devices"
        ],
        "privacy_responses": [
          {
            "response": "Physical workarounds",
            "description": "Uses hidden browser history, private mode, or borrowed device."
          },
          {
          "response": "Non-use",
            "description": "Avoids apps that could leave trace."
        },
        {
          "response": "Use of borrowed devices",
          "description": "Communicates through public or borrowed devices to prevent abuser detection."
          }
        ],
        "costs_and_consequences": [
          "Harder to seek help quickly",
        "Isolation and continued risk",
        "Inconsistent and less reliable access to digital resources",
        "Added stress from secrecy and fear of being discovered"
      ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
        "Privacy vs. Support - surveillance deters safe communication with services",
        "Privacy vs. Autonomy - requires trusted outsiders to secure devices",
        "Privacy vs. Safety - surveillance forces reliance on insecure or temporary devices"
      ],
      "privacy_responses": [
        {
          "response": "Abandoning device use",
          "description": "Stops or minimizes use of personal devices suspected of being monitored."
        },
        {
          "response": "Seeking professional support",
          "description": "Relies on clinicians or advocates for secure device setup and monitoring checks."
        },
        {
          "response": "Use of borrowed devices",
          "description": "Communicates through public or borrowed devices to prevent abuser detection."
        }
      ],
      "costs_and_consequences": [
          "Reduced ability to access timely help",
          "Heightened isolation due to limited communication",
          "Dependency on external assistance to maintain digital safety",
          "Possible delays in regaining safe communication",
          "Inconsistent and less reliable access to digital resources",
          "Added stress from secrecy and fear of being discovered"
      ]
    },
    "stories": [
      {
        "story": "Samir opens the Friend Activity sidebar on his desktop music app. The sidebar prods him to enable sharing, so he turns on “Share my listening activity” and then connects Facebook to add friends. That night, his abusive ex who is a Facebook friend opens their own app and sees Samir listening to a domestic-violence recovery playlist.",
        "information_leaked": "Samir's current and recent listening activity (track and playlist titles) shared to Facebook-synced friends in the past 7 days, including a survivorship/support playlist that implies he is seeking help.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow4",
            "step_causing_harm": "step 4 (Turning ON 'Share my listening activity' in Social)"
          },
          {
            "function": 2,
            "flow_id": "flow3",
            "step_causing_harm": "step 5 (Successful Facebook linking that syncs friends who can now see his activity)"
          }
        ],
        "leakage_source": "The music app's automatic sharing to Facebook-synced friends after Samir enables 'Share my listening activity' and links Facebook.",
        "leak_to": "Samir's abusive ex-partner (a Facebook friend using their own music app account).",
        "harms": [
          {
            "harm": "Physical Harms",
            "cause": "The app prominently nudges Samir to enable sharing and then automatically exposes his activity to all Facebook-synced friends, including his abuser, increasing risk of confrontation and violence."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Seeing that sensitive listening was exposed to the abuser creates fear and panic; the app did not provide a clear, high-salience warning that connecting Facebook would make activity visible to all synced friends."
          },
          {
            "harm": "Autonomy Harms - Manipulation",
            "cause": "The sidebar design encourages enabling sharing without clearly presenting the scope of exposure (all synced friends), nudging Samir into a risky choice."
          },
          {
            "harm": "Relationship Harms",
            "cause": "The exposure invites unwanted contact and monitoring by the abuser, straining Samir's efforts to maintain safe boundaries."
          }
        ],
        "consequences": "The abuser confronts Samir about the support-related playlist, escalates monitoring of his devices, and restricts his app usage; Samir stops using the app for coping playlists, losing a support outlet."
      },
      {
        "story": "Trying to keep his listening private, Samir starts a Private Session before playing a survivor support podcast. After more than six hours, the session automatically ends without a prominent alert. Samir continues listening, unaware that his activity is now visible to friends, including his abuser.",
        "information_leaked": "Post–Private Session listening activity (tracks/playlists) that becomes visible in the Friend Activity feed for mutual-follow or Facebook-synced friends for up to 7 days.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 (Earlier enabling of 'Share my listening activity' makes later exposure possible once Private Session ends)"
          },
          {
            "function": 3,
            "flow_id": "flow4",
            "step_causing_harm": "step 3 (Private Session automatically ends after 6 hours, removing protection and resuming sharing)"
          }
        ],
        "leakage_source": "Automatic expiration of Private Session re-enables sharing by default without a disruptive warning.",
        "leak_to": "Abuser (already connected as a mutual-follow or via Facebook sync) who opens their app and sees Samir's renewed activity.",
        "harms": [
          {
            "harm": "Autonomy Harms - Lack of Control",
            "cause": "The app ends Private Session automatically and resumes sharing without a clear, blocking alert; Samir loses control over when sensitive activity is exposed."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Samir experiences anxiety upon realizing that sensitive listening resumed sharing unexpectedly."
          },
          {
            "harm": "Physical Harms",
            "cause": "The abuser can use the revealed activity to time confrontations or justify increased surveillance."
          }
        ],
        "consequences": "Samir is confronted about what he listened to after the session ended; he avoids the app entirely, losing a coping tool and becoming more isolated."
      },
      {
        "story": "Samir discovers his abuser still appears in his Friend Activity feed. He tries to remove them by unfollowing from the abuser's profile, but because they are a Facebook-synced friend, the abuser remains connected and can still see Samir's activity.",
        "information_leaked": "Samir's ongoing listening activity continues to be visible to the abuser despite Samir's attempt to sever the connection.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow6",
            "step_causing_harm": "N/A (setup)"
          },
          {
            "function": 4,
            "flow_id": "flow1",
            "step_causing_harm": "step 2 (Clicking 'Following' triggers a check that reveals the user is Facebook-synced; unfollow does not remove them from Friend Activity)"
          }
        ],
        "leakage_source": "The music app's integration with Facebook keeps synced friends in the Friend Activity graph even after an unfollow, preventing effective removal.",
        "leak_to": "Abuser (still a Facebook-synced connection).",
        "harms": [
          {
            "harm": "Autonomy Harms - Lack of Control",
            "cause": "The app does not provide a working way to remove Facebook-synced connections from the Friend Activity feed through unfollow, thwarting Samir's attempt to control his exposure."
          },
          {
            "harm": "Autonomy Harms - Thwarted Expectations",
            "cause": "The 'Unfollow' action appears to end the relationship but does not stop exposure when the connection is through Facebook sync."
          },
          {
            "harm": "Psychological Harms - Disturbance",
            "cause": "Persistent presence of the abuser in the feed heightens fear and stress."
          },
          {
            "harm": "Relationship Harms",
            "cause": "Ongoing visibility allows the abuser to continue monitoring Samir's habits."
          }
        ],
        "consequences": "Samir's activity remains visible to the abuser; he abandons the app and avoids music-based coping, increasing isolation and stress."
      },
      {
        "story": "From the Friend Activity sidebar, Samir clicks 'Add Friends' and sees the message 'We'll never post to Facebook without your permission.' Reassured, he connects Facebook. Because his sharing is on, his activity is immediately visible to Facebook-synced friends, including his abuser—despite not appearing on his Facebook timeline.",
        "information_leaked": "Samir's listening activity (tracks/playlists in the last 7 days) to all Facebook-synced friends on the music app, even though nothing posts on Facebook itself.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow1",
            "step_causing_harm": "step 7 (Turning ON 'Share my listening activity' earlier makes connection risky)"
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4 (Successful Facebook login/linking after seeing 'We'll never post to Facebook' reassurance)"
          }
        ],
        "leakage_source": "The music app's Facebook sync shares activity in-app to Facebook friends; the 'We'll never post to Facebook' message downplays this separate in-app visibility.",
        "leak_to": "Abuser (Facebook friend on the music app) and other Facebook-synced friends.",
        "harms": [
          {
            "harm": "Autonomy Harms - Failure to Inform",
            "cause": "The app's messaging focuses on not posting to Facebook, but does not clearly warn that all Facebook-synced friends will see in-app activity once connected."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Samir learns that his sensitive listening became visible against his expectations."
          },
          {
            "harm": "Relationship Harms",
            "cause": "Abuser uses the in-app visibility to re-initiate contact and monitoring."
          }
        ],
        "consequences": "Samir faces renewed harassment and increases secrecy around device use; he avoids the app and loses a supportive outlet."
      },
      {
        "story": "Samir enables sharing, connects Facebook to find friends, then starts a Private Session before playing safety-planning content. Hours later, the session auto-ends and he keeps listening, which becomes visible to his Facebook-synced abuser. When Samir tries to remove the abuser, unfollow fails because the connection is Facebook-synced.",
        "information_leaked": "Sensitive listening activity after Private Session expiry is shared to Facebook-synced friends for up to 7 days; attempted unfollow does not stop exposure.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow4",
            "step_causing_harm": "step 4 (Turning ON 'Share my listening activity' enables later exposure)"
          },
          {
            "function": 2,
            "flow_id": "flow3",
            "step_causing_harm": "step 5 (Facebook linking surfaces the abuser as a synced friend who can view activity)"
          },
          {
            "function": 3,
            "flow_id": "flow4",
            "step_causing_harm": "step 3 (Private Session ends after 6 hours, resuming sharing without a blocking alert)"
          },
          {
            "function": 4,
            "flow_id": "flow1",
            "step_causing_harm": "step 2 (Unfollow fails to remove the Facebook-synced abuser from Friend Activity)"
          }
        ],
        "leakage_source": "The music app's combination of sharing defaults, Facebook syncing, silent Private Session expiry, and limited removal controls.",
        "leak_to": "Abuser connected via Facebook sync.",
        "harms": [
          {
            "harm": "Physical Harms",
            "cause": "Revealed listening provides the abuser a pretext to escalate surveillance and control."
          },
          {
            "harm": "Autonomy Harms - Lack of Control",
            "cause": "Samir cannot reliably keep sessions private due to auto-expiry and cannot remove the synced abuser from the feed."
          },
          {
            "harm": "Autonomy Harms - Chilling Effects",
            "cause": "Fear of inadvertent exposure deters Samir from using therapeutic audio resources."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Unexpected exposure and failed mitigation attempts increase stress and anxiety."
          }
        ],
        "consequences": "Samir abandons the app for self-care content, loses a coping tool, and faces heightened monitoring; he must rely on borrowed devices, reducing access to support."
      }
    ]
  },
  {
    "basic_info": {
      "name": "Joy",
      "age": 38,
      "tech_comfort_level": "medium"
    },
    "contextual_info": {
      "vulnerability_type_brief_description": "Internal and experiential factors - Formerly incarcerated individual",
      "privacy_awareness_level": "moderate",
      "information_cared_about": ["criminal record", "rehabilitation history", "job applications"]
    },
    "privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
        "Privacy vs. Support - reentry services require sharing records",
        "Privacy vs. Disclosure of identity - fear stigma by employers"
      ],
      "privacy_responses": [
        {
          "response": "Controlling disclosure",
          "description": "Sets up separate contact information for job-search and activism."
        },
        {
          "response": "Privacy lies",
          "description": "Minimizes detail about conviction when possible."
        }
      ],
      "costs_and_consequences": [
        "Legal risk if false info discovered",
        "Emotional burden of managing identity"
      ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
          "Privacy vs. Disclosure of identity - fear of ongoing monitoring after release",
          "Privacy vs. Support - digital engagement needed for reentry but feared for exposure",
          "Privacy vs. Employment - digital applications risk exposing incarceration history"
      ],
      "privacy_responses": [
          {
            "response": "Self-censorship",
            "description": "Avoids sensitive details in communication due to fear of monitoring or later repercussions."
          },
          {
            "response": "Multiple identities",
            "description": "Creates distinct online accounts to separate personal life from reentry support or job search."
          },
          {
            "response": "Reluctance to apply online",
            "description": "Avoids digital job applications to prevent automatic rejection or stigma."
          }
      ],
      "costs_and_consequences": [
          "Emotional strain from suppressing authentic communication",
          "Fear of lasting surveillance undermines trust in digital tools",
          "Managing fragmented digital identities requires ongoing effort",
          "Limited openness can reduce opportunities for authentic social or professional connections",
          "Missed access to employment opportunities",
          "Continued economic vulnerability due to reluctance to use digital reentry systems"
      ]
    },
    "stories": [
      {
        "story": "Joy enables sharing to see her friends' music, then connects Facebook. A coworker who is her Facebook friend opens the app and sees Joy listening to 'Returning Citizens: Navigating Background Checks' and a reentry podcast. The coworker infers Joy's incarceration history and quietly flags her to HR, who later withdraws a conditional job offer.",
        "information_leaked": "Joy's real-time and recent listening activity (tracks, playlists, timestamps) that imply incarceration/reentry status, linked to her identity via Facebook sync.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7: Find 'Share my listening activity' and switch the toggle button to ON."
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4: Enter Facebook account information and click 'Log In' (authorizes friend sync)."
          }
        ],
        "leakage_source": "The music app's Friend Activity feature broadcasting Joy's listening once Facebook is synced and 'Share my listening activity' is ON.",
        "leak_to": "Coworker/HR contact who is a Facebook friend synced into the app.",
        "harms": [
          {
            "harm": "Reputational Harms",
            "cause": "The app exposes reentry-related listening to Facebook friends in Friend Activity, enabling inferences about past incarceration."
          },
          {
            "harm": "Economic Harms",
            "cause": "An HR contact uses the exposed information to reassess Joy's candidacy, affecting employment prospects."
          },
          {
            "harm": "Autonomy Harms — Lack of Control",
            "cause": "After connecting Facebook, Joy's activity is instantly visible to a large set of contacts without granular audience controls."
          }
        ],
        "consequences": "Conditional job offer is withdrawn; Joy loses income opportunity and feels stigmatized at work."
      },
      {
        "story": "Joy turns on sharing to connect with friends, then starts a Private Session at night to listen to a 'Parole Q&A' podcast. After 6 hours, Private Session auto-ends and her next plays are broadcast to friends, including a reentry caseworker who messages her about it, making Joy feel monitored.",
        "information_leaked": "Joy's listening activity after Private Session auto-ends (late-night playback of reentry-related content), visible to synced friends.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7: Find 'Share my listening activity' and switch the toggle button to ON."
          },
          {
            "function": 3,
            "flow_id": "flow4",
            "step_causing_harm": "step 3: System confirms Private Session has lasted 6 hours and ends it (padlock disappears)."
          }
        ],
        "leakage_source": "The music app automatically ending Private Session and resuming public sharing without a persistent warning.",
        "leak_to": "Facebook/mutual-followed friends, including a reentry caseworker.",
        "harms": [
          {
            "harm": "Autonomy Harms — Thwarted Expectations",
            "cause": "Private Session ends automatically after 6 hours; Joy expects continuing privacy and isn't clearly warned when it lapses."
          },
          {
            "harm": "Psychological Harms — Emotional Distress",
            "cause": "Feeling surveilled by contacts who see sensitive listening she intended to keep private."
          },
          {
            "harm": "Relationship Harms",
            "cause": "The caseworker's unsolicited check-in based on private listening strains the support relationship."
          }
        ],
        "consequences": "Joy becomes anxious about using the app and avoids helpful reentry audio resources at night."
      },
      {
        "story": "Joy connects Facebook and enables sharing. An ex-partner (a Facebook friend) appears in her Friend Activity feed. Joy tries to remove them by unfollowing via the three-dot menu, but because they're a synced Facebook friend, they remain. The ex continues seeing Joy's listening times, using them to predict when she's home.",
        "information_leaked": "Joy's ongoing real-time listening presence and timestamps to a synced Facebook contact she attempted to remove.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7: Find 'Share my listening activity' and switch the toggle button to ON."
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4: Enter Facebook account information and click 'Log In' (brings in the ex-partner as a synced friend)."
          },
          {
            "function": 4,
            "flow_id": "flow3",
            "step_causing_harm": "step 3: Click 'Unfollow' (fails to remove a synced Facebook friend from visibility)."
          }
        ],
        "leakage_source": "The app's Facebook sync and Friend Activity design that keeps synced Facebook friends connected even after unfollowing.",
        "leak_to": "Ex-partner who remains a synced Facebook friend.",
        "harms": [
          {
            "harm": "Physical Harms",
            "cause": "By revealing Joy's active listening windows, the app enables an abusive ex to infer her routines."
          },
          {
            "harm": "Autonomy Harms — Lack of Control",
            "cause": "Unfollow does not remove a synced Facebook contact; Joy cannot effectively control exposure."
          },
          {
            "harm": "Relationship Harms",
            "cause": "Continued unwanted visibility to an ex escalates risk and fear."
          }
        ],
        "consequences": "Joy changes her schedule to avoid being predictable, experiences safety concerns, and stops using the app."
      },
      {
        "story": "While exploring Friend Activity, Joy is nudged by a large 'Settings' button and messages to enable sharing so she can see friends. She turns it on, then connects Facebook. Her neighbor (a Facebook friend) sees Joy listening to 'Prison Abolition Today' and spreads gossip on their block.",
        "information_leaked": "Joy's listening activity suggestive of criminal-justice involvement, exposed to Facebook friends after sharing is enabled.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow5",
            "step_causing_harm": "step 4: Find 'Share my listening activity' and switch the toggle button to ON (after the prominent in-product prompt)."
          },
          {
            "function": 2,
            "flow_id": "flow3",
            "step_causing_harm": "step 5: Enter Facebook account information and click 'Log In' (syncs neighbor as a contact)."
          }
        ],
        "leakage_source": "The app's Friend Activity prompt and design nudging Joy to enable sharing, plus Facebook sync broadcasting to a broad audience.",
        "leak_to": "Neighbor who is a synced Facebook friend.",
        "harms": [
          {
            "harm": "Autonomy Harms — Manipulation",
            "cause": "Prominent prompts and messaging steer Joy into enabling sharing without highlighting sensitive consequences."
          },
          {
            "harm": "Reputational Harms",
            "cause": "Neighbors infer stigmatized aspects of Joy's past from her listening and spread rumors."
          },
          {
            "harm": "Psychological Harms — Emotional Distress",
            "cause": "Embarrassment and anxiety from neighborhood gossip tied to sensitive listening."
          }
        ],
        "consequences": "Joy avoids community events, feels isolated, and reduces app use to limit exposure."
      },
      {
        "story": "Joy enables sharing and connects Facebook so she can follow reentry peers for job tips. She tries to remove a synced volunteer organizer from her feed by clicking 'Following,' but the person remains because they're Facebook-synced. Knowing the organizer can still see her listening, Joy stops playing reentry interview prep materials.",
        "information_leaked": "Joy's continued listening activity and timestamps visible to a synced Facebook contact she attempted to remove.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7: Find 'Share my listening activity' and switch the toggle button to ON."
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4: Enter Facebook account information and click 'Log In' (imports the organizer as a synced friend)."
          },
          {
            "function": 4,
            "flow_id": "flow1",
            "step_causing_harm": "step 2: Click on the 'Following' button (fails to remove a synced Facebook friend from Friend Activity)."
          }
        ],
        "leakage_source": "The app's handling of Facebook-synced connections that persist in Friend Activity despite unfollowing.",
        "leak_to": "Volunteer organizer who is a synced Facebook friend.",
        "harms": [
          {
            "harm": "Autonomy Harms — Chilling Effects",
            "cause": "Joy self-censors and avoids helpful content to prevent further exposure."
          },
          {
            "harm": "Autonomy Harms — Lack of Control",
            "cause": "She cannot remove a synced contact from seeing her activity via normal controls."
          },
          {
            "harm": "Economic Harms",
            "cause": "By avoiding interview-prep audio resources, Joy reduces her readiness for applications and interviews."
          }
        ],
        "consequences": "Joy loses confidence for upcoming job applications and misses out on useful reentry content, prolonging economic vulnerability."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Ben",
        "age": 27,
        "tech_comfort_level": "medium"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Internal and experiential factors - Person with severe anxiety",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["mental health data", "support group usage", "location"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - mental health apps track usage",
          "Privacy vs. Disclosure of identity - stigma about anxiety"
        ],
        "privacy_responses": [
          {
            "response": "Withholding disclosure",
            "description": "Avoids linking real identity to mental health apps."
          },
          {
          "response": "Privacy-enhancing technologies",
          "description": "Uses anonymous accounts or privacy-respecting platforms."
          }
        ],
        "costs_and_consequences": [
          "Less personalized recommendations",
          "Difficult to maintain continuity in support"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
          "Privacy vs. Support - monitoring features undermine sense of safety",
          "Privacy vs. Disclosure of identity - anonymity helps manage anxiety but limits openness",
          "Privacy vs. Mental well-being - breaches amplify anxiety symptoms"
      ],
      "privacy_responses": [
        {
          "response": "Avoidance of apps",
          "description": "Chooses not to use certain mental health apps that track too much personal data."
        },
        {
          "response": "Anonymous communication",
          "description": "Engages in support groups or online spaces using anonymous or text-only interactions to manage anxiety."
        },
        {
          "response": "Heightened caution",
          "description": "Becomes more cautious about where and how personal information is shared online after exposure to breaches."
        }
      ],
      "costs_and_consequences": [
          "Missed opportunities for supportive digital interventions",
          "Increased anxiety from perception of being surveilled",
          "Restricted ability to form deeper or more personal online connections",
          "Reinforcement of avoidance behaviors tied to anxiety",
          "Chronic stress from fear of potential misuse of data",
          "Reduced engagement with digital platforms due to breach concerns"
      ]
    },
    "stories": [
      {
        "story": "At work, Ben turns on Friend Activity and, encouraged by the prompt, enables “Share my listening activity.” Minutes later, two coworkers he mutually follows see him streaming a playlist titled “Managing Panic Attacks” and start whispering about it in the break room.",
        "information_leaked": "Ben's current and recent listening activity, including mental-health-related playlist titles (e.g., “Managing Panic Attacks”), timestamps showing he's listening during work hours.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7: Switch 'Share my listening activity' to ON in Social settings."
          },
          {
            "function": 4,
            "flow_id": "flow2",
            "step_causing_harm": "N/A (Used later to remove the coworker successfully; harm had already occurred.)"
          }
        ],
        "leakage_source": "Music app Friend Activity feature auto-sharing Ben's listening to mutual-followed friends once sharing is enabled.",
        "leak_to": "Ben's coworkers who are mutual followers on the music app.",
        "harms": [
          {
            "harm": "Reputational Harms",
            "cause": "The app publicly surfaces specific mental-health-related playlist titles to coworkers via Friend Activity."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Seeing coworkers react to his listening triggers Ben's anxiety; the app's default visibility after enabling sharing amplifies this."
          },
          {
            "harm": "Relationship Harms",
            "cause": "Coworkers' perceptions of Ben shift due to stigmatizing interpretations of his listening, enabled by the app's sharing feed."
          },
          {
            "harm": "Autonomy Harms - Thwarted Expectations",
            "cause": "Ben expected to see friends' activity, not to reveal sensitive playlist names that co-workers could immediately view."
          }
        ],
        "consequences": "Workplace gossip, awkward interactions with coworkers, increased anxiety at work, and Ben becomes reluctant to use the app during office hours."
      },
      {
        "story": "Ben connects the app to Facebook to ‘add friends' so he can see more music recommendations. Because his sharing is already ON, dozens of Facebook contacts—including family—instantly see he's listening to an ‘Anxiety SOS' podcast.",
        "information_leaked": "Ben's listening activity (mental-health podcasts), his identity linkage across platforms (Facebook-to-music app), and social graph expansion that exposes his listening to a wider audience.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7: Switch 'Share my listening activity' to ON in Social settings (precondition that makes later Facebook sync visible to many)."
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4: Facebook login succeeds, syncing Facebook friends who now see Ben's shared listening."
          }
        ],
        "leakage_source": "Music app's Facebook integration combined with Friend Activity sharing.",
        "leak_to": "Facebook friends (family, high-school acquaintances) synced into the music app.",
        "harms": [
          {
            "harm": "Relationship Harms",
            "cause": "Family members unexpectedly learn about Ben's mental health content through the app's cross-platform sharing."
          },
          {
            "harm": "Autonomy Harms - Lack of Control",
            "cause": "The app's design makes connection symmetric: adding friends to see their activity automatically expands who sees Ben's activity."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Surprise exposure of mental-health listening to family triggers anxiety and rumination."
          }
        ],
        "consequences": "Uncomfortable questions from relatives, heightened anxiety, and Ben deletes some playlists and avoids using the app when connected to Facebook."
      },
      {
        "story": "Ben starts a Private Session while listening to a live anxiety support podcast. After six hours, the session auto-ends without an obvious warning; his next plays become visible to mutual friends, including his team lead, who messages him about it.",
        "information_leaked": "Ben's sensitive listening activity post–Private Session (support-group content titles), timing of listening (revealing late-night distress).",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7: Switch 'Share my listening activity' to ON in Social settings (sharing resumes once private session ends)."
          },
          {
            "function": 3,
            "flow_id": "flow4",
            "step_causing_harm": "step 3: Private Session automatically ends after 6 hours, removing the privacy protection."
          }
        ],
        "leakage_source": "Music app's Private Session auto-expiration and continued Friend Activity sharing.",
        "leak_to": "Mutual-followed contacts on the app, including Ben's team lead.",
        "harms": [
          {
            "harm": "Autonomy Harms - Failure to Inform",
            "cause": "The app ends the Private Session automatically after 6 hours with insufficiently prominent warning, immediately re-exposing activity."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Unexpected exposure of sensitive listening triggers heightened anxiety and embarrassment."
          },
          {
            "harm": "Reputational Harms",
            "cause": "A manager infers personal issues from visible support content titles."
          }
        ],
        "consequences": "Manager questions Ben's availability for a deadline; Ben feels watched and stops using the app at night, reducing coping resources."
      },
      {
        "story": "After syncing Facebook, Ben tries to remove a former college acquaintance from his Friend Activity by unfollowing them. Because they are a Facebook-synced friend, unfollowing doesn't remove them from Ben's social connections, so his continued listening to ‘CBT for Anxiety' remains visible to them.",
        "information_leaked": "Ongoing sensitive listening activity (therapy-related content) remains visible to an unwanted Facebook-synced contact despite Ben's attempt to sever the connection.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7: Switch 'Share my listening activity' to ON in Social settings (baseline exposure)."
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4: Successful Facebook sync brings the acquaintance into Ben's network."
          },
          {
            "function": 4,
            "flow_id": "flow1",
            "step_causing_harm": "step 2: Clicking 'Following' on the synced Facebook friend fails to remove them from Ben's Friend Activity connections."
          }
        ],
        "leakage_source": "Music app's Facebook-synced connection model that persists visibility even after ‘unfollow' on profile.",
        "leak_to": "The Facebook-synced acquaintance who remains connected.",
        "harms": [
          {
            "harm": "Autonomy Harms - Lack of Control",
            "cause": "The app allows synced Facebook relationships to override Ben's direct attempt to remove visibility."
          },
          {
            "harm": "Autonomy Harms - Thwarted Expectations",
            "cause": "The UI implies ‘unfollow' removes the person, but they still see Ben's activity."
          },
          {
            "harm": "Relationship Harms",
            "cause": "The acquaintance continues to monitor and make comments about Ben's mental-health listening."
          },
          {
            "harm": "Psychological Harms - Disturbance",
            "cause": "Persistent unwanted visibility increases Ben's sense of being surveilled."
          }
        ],
        "consequences": "Ben blocks the acquaintance on multiple platforms and experiences increased anxiety; he stops using the app's social features entirely."
      },
      {
        "story": "During a team ‘music day,' the manager encourages everyone to connect the app with Facebook to discover each other's playlists. Ben complies, and the manager later notices Ben's ‘SSRI Side Effects' playlist in Friend Activity. Ben's client-facing hours are quietly reduced.",
        "information_leaked": "Playlist titles indicating medication and mental health (“SSRI Side Effects”), linked to Ben's real identity via Facebook sync.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7: Switch 'Share my listening activity' to ON in Social settings."
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4: Facebook connection completes under social pressure, expanding who can see Ben's activity."
          }
        ],
        "leakage_source": "Music app's Friend Activity sharing combined with Facebook sync in a workplace context.",
        "leak_to": "Ben's manager and coworkers who become connected via Facebook sync.",
        "harms": [
          {
            "harm": "Autonomy Harms - Coercion",
            "cause": "Social and UI nudges encourage connecting Facebook, making sharing feel mandatory to participate."
          },
          {
            "harm": "Discrimination Harms",
            "cause": "Manager draws biased conclusions about reliability from health-related listening."
          },
          {
            "harm": "Economic Harms",
            "cause": "Reduced client-facing hours after exposure of sensitive listening."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Ben experiences heightened anxiety after noticing changes in assignments."
          }
        ],
        "consequences": "Lost income opportunities, damage to career trajectory, and withdrawal from future team activities."
      },
      {
        "story": "At lunchtime, Ben streams a public playlist called “Calm Corner — Uptown Clinic Waiting Room.” His roommate, who follows him on the app, sees this in Friend Activity and deduces where Ben is seeking therapy.",
        "information_leaked": "Sensitive playlist name that reveals Ben's likely presence at a specific clinic (location inference) and mental-health-related behavior.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7: Switch 'Share my listening activity' to ON in Social settings, making playlist titles visible."
          },
          {
            "function": 4,
            "flow_id": "flow2",
            "step_causing_harm": "N/A (Ben later unfollows the roommate successfully to mitigate future exposure; harm already occurred.)"
          }
        ],
        "leakage_source": "Music app Friend Activity surfacing descriptive playlist titles to followers in real time.",
        "leak_to": "Ben's roommate who is a mutual follower on the app.",
        "harms": [
          {
            "harm": "Autonomy Harms - Lack of Control",
            "cause": "The app broadcasts detailed playlist names that can reveal location and health context without granular controls."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Disclosure of therapy location worsens Ben's anxiety about being observed."
          },
          {
            "harm": "Relationship Harms",
            "cause": "Roommate confronts Ben, leading to tension over privacy boundaries."
          }
        ],
        "consequences": "Ben feels unsafe listening to helpful playlists in public, avoids midday sessions, and loses a coping tool; home tension increases."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Alice",
        "age": 68,
        "tech_comfort_level": "low"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Internal and experiential factors - Socially isolated senior",
        "privacy_awareness_level": "low",
      "information_cared_about": ["contact list", "location check-ins", "health alerts"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - family wants tracking for safety",
          "Privacy vs. Autonomy - resists location-sharing"
        ],
        "privacy_responses": [
          {
          "response": "Third-party protections",
            "description": "Family sets up monitoring apps on her behalf."
          },
          {
            "response": "Apathy",
            "description": "Does not engage with settings or privacy features."
          }
        ],
        "costs_and_consequences": [
          "Loss of independence",
        "Potential over-monitoring with limited consent"
      ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
          "Privacy vs. Autonomy - reliance on others reduces independence",
          "Privacy vs. Safety - older adults deprioritize privacy for perceived safety",
          "Privacy vs. Support - monitoring helps detect loneliness but compromises personal space"
      ],
      "privacy_responses": [
          {
            "response": "Delegated control",
            "description": "Relies on family or caregivers to configure monitoring and privacy settings."
          },
          {
            "response": "Apathy toward privacy",
            "description": "Chooses not to engage with privacy settings or protections, seeing them as unnecessary."
          },
          {
            "response": "Conditional acceptance of monitoring",
            "description": "Agrees to passive monitoring only when framed as supportive, despite discomfort with constant observation."
          }
      ],
      "costs_and_consequences": [
          "Loss of independence in decision-making",
          "Potential exposure to monitoring without informed consent",
          "Increased exposure to potential misuse of personal data",
          "Weaker control over how personal information is shared",
          "Loss of sense of privacy in the home",
          "Potential misinterpretation of personal behaviors leading to unnecessary interventions"
      ]
    },
    "stories": [
        {
          "story": "Feeling lonely, Alice enables Friend Activity to see what neighbors play and connects her Facebook so she can find more people. That same evening, her friends can see she's looping “Deep Sleep for Insomnia” and “Blood Pressure Relaxation” playlists, and gossip starts in her bridge club.",
          "information_leaked": "Alice's real name (imported from Facebook), her social graph (synced Facebook friends), and detailed listening activity with timestamps/recency and health‑suggestive playlist titles.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow2",
              "step_causing_harm": "step 7: toggles 'Share my listening activity' to ON, making her listening visible to followers/Facebook friends."
            },
            {
              "function": 2,
              "flow_id": "flow1",
              "step_causing_harm": "step 4: successful Facebook login links her account and syncs friend list, expanding the audience of her activity."
            }
          ],
          "leakage_source": "The music app (Friend Activity feature + Facebook sync) after Alice enabled sharing.",
          "leak_to": "Mutual-followed friends and synced Facebook friends using the app (including neighbors and bridge club acquaintances).",
          "harms": [
            {
              "harm": "Reputational Harms",
              "cause": "The app prominently shows playlist/track titles and recent activity to a broadened network once sharing and Facebook sync are enabled."
            },
            {
              "harm": "Relationship Harms",
              "cause": "Social contacts infer health issues from her listening and gossip, straining relationships."
            },
            {
              "harm": "Autonomy Harms — Thwarted Expectations and Lack of Control",
              "cause": "The UI framing (“See what your friends are playing”) encourages enabling sharing without making the audience expansion and sensitivity of titles salient."
            },
            {
              "harm": "Psychological Harms — Emotional Distress",
              "cause": "Unwanted exposure of health‑suggestive listening induces embarrassment and anxiety."
            }
          ],
          "consequences": "Alice is embarrassed at bridge club, withdraws from social meetups, and becomes more reluctant to use the app for sleep support."
        },
        {
          "story": "Alice starts a Private Session to listen to grief‑support music, believing it will stay private. After 6 hours, the Private Session ends automatically. She keeps listening the next morning; her friends see the sensitive playlists in their feed.",
          "information_leaked": "Sensitive listening history (e.g., grief‑support/meditation tracks) and time-of-day activity once Private Session silently ends.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow6",
              "step_causing_harm": "none (Friend Activity sidebar is opened; the subsequent leak occurs when Private Session auto-ends)."
            },
            {
              "function": 3,
              "flow_id": "flow4",
              "step_causing_harm": "step 3: system automatically ends Private Session after 6 hours, resuming public sharing without prominent re‑consent."
            }
          ],
          "leakage_source": "The music app's Private Session auto‑timeout behavior that resumes public activity sharing by default.",
          "leak_to": "Mutual-followed and synced Facebook friends who view Friend Activity.",
          "harms": [
            {
              "harm": "Autonomy Harms — Failure to Inform and Thwarted Expectations",
              "cause": "Private Session auto‑ending with only a small icon change undermines Alice's expectation that her session remains private."
            },
            {
              "harm": "Psychological Harms — Emotional Distress",
              "cause": "Exposure of grief‑related listening to contacts causes embarrassment and distress."
            },
            {
              "harm": "Relationship Harms",
              "cause": "Well‑meaning acquaintances make intrusive comments, straining relationships."
            }
          ],
          "consequences": "Alice avoids listening to supportive content, experiences a chilling effect, and feels watched by her contacts."
        },
        {
          "story": "Alice's daughter “helps” by connecting Alice's Facebook to the music app and enabling sharing so family can “keep an eye on her.” Alice doesn't realize how many people can now see her listening, including distant acquaintances.",
          "information_leaked": "Alice's Facebook-derived identity, friend graph, follower/following lists, and live/recent listening activity.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow1",
              "step_causing_harm": "step 7: caregiver enables 'Share my listening activity' to ON, turning on broad sharing."
            },
            {
              "function": 2,
              "flow_id": "flow3",
              "step_causing_harm": "step 5: successful Facebook linking syncs a wide contact list into the app."
            }
          ],
          "leakage_source": "Alice's caregiver using the music app's sharing and Facebook sync settings on her behalf.",
          "leak_to": "Family members plus a wide set of synced Facebook contacts who also use the app.",
          "harms": [
            {
              "harm": "Autonomy Harms — Coercion and Lack of Control",
              "cause": "Delegated configuration allows others to expose Alice's activity without meaningful consent."
            },
            {
              "harm": "Psychological Harms — Disturbance",
              "cause": "Feeling constantly observed leads Alice to change or curtail her listening."
            },
            {
              "harm": "Relationship Harms",
              "cause": "Family uses app data to micromanage Alice (e.g., calling out late‑night listening), causing conflict."
            }
          ],
          "consequences": "Alice feels monitored, reduces app use for relaxation, and experiences a loss of independence and trust with family."
        },
        {
          "story": "Alice tries to remove an old neighbor from her Friend Activity feed by unfollowing them. Because they're synced via Facebook, the neighbor still shows up—and continues to see Alice's activity—contrary to Alice's expectations.",
          "information_leaked": "Continuing exposure of Alice's listening activity to an unwanted contact despite her attempt to remove them.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow6",
              "step_causing_harm": "none (Friend Activity is visible; harm arises when removal fails)."
            },
            {
              "function": 4,
              "flow_id": "flow1",
              "step_causing_harm": "step 2: clicking 'Following' on a Facebook‑synced user does not remove them from the feed; they remain connected and can still see Alice's activity."
            }
          ],
          "leakage_source": "The music app's removal UX for Facebook‑synced friends that does not actually sever visibility or clearly explain limitations.",
          "leak_to": "The Facebook‑synced neighbor (and any other FB‑synced contacts) who still see Alice's activity.",
          "harms": [
            {
              "harm": "Autonomy Harms — Thwarted Expectations and Lack of Control",
              "cause": "The app allows an ‘Unfollow'/‘Following' change that doesn't stop reciprocal visibility for FB‑synced connections."
            },
            {
              "harm": "Psychological Harms — Emotional Distress",
              "cause": "Alice believes she removed the neighbor, then realizes she's still being observed."
            },
            {
              "harm": "Relationship Harms",
              "cause": "The neighbor comments on Alice's listening, leading to awkwardness and avoidance."
            }
          ],
          "consequences": "Alice stops using the app during the day to avoid being seen and feels less in control of her social connections."
        },
        {
          "story": "After connecting Facebook to find friends, a casual acquaintance sees when Alice is most active and messages her with a fake giveaway referencing her recent songs. She clicks a malicious link, later facing unauthorized charges.",
          "information_leaked": "Real name and profile (via Facebook sync), friend network visibility, and recency/timing of listening activity that signals when Alice is online and responsive.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow6",
              "step_causing_harm": "none (Friend Activity is open; the key leak comes from Facebook sync expanding who can see her activity)."
            },
            {
              "function": 2,
              "flow_id": "flow1",
              "step_causing_harm": "step 4: linking Facebook exposes Alice to a broader set of acquaintances who can view her Friend Activity timing and details."
            }
          ],
          "leakage_source": "The music app's Facebook sync and Friend Activity exposure of name and activity timing.",
          "leak_to": "A casual Facebook acquaintance who also uses the music app.",
          "harms": [
            {
              "harm": "Economic Harms",
              "cause": "Expanded audience can social‑engineer Alice using context from her visible listening, leading to fraud."
            },
            {
              "harm": "Psychological Harms — Emotional Distress",
              "cause": "After being scammed, Alice feels anxious and embarrassed."
            },
            {
              "harm": "Autonomy Harms — Lack of Control",
              "cause": "Limited clarity on how to limit audience or hide recency leads to overexposure."
            }
          ],
          "consequences": "Unauthorized charges require time and assistance to resolve; Alice becomes fearful about using the app and other online services."
        },
        {
          "story": "Connecting Facebook re‑exposes Alice to an estranged ex‑partner who now sees that she listens late at night. He uses this pattern to infer when she's home alone, sending unsettling messages.",
          "information_leaked": "Listening recency patterns (late‑night sessions), real name/profile via Facebook sync, and confirmation that Alice is online and active.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow2",
              "step_causing_harm": "step 7: enabling 'Share my listening activity' makes her activity visible to contacts."
            },
            {
              "function": 2,
              "flow_id": "flow1",
              "step_causing_harm": "step 4: successful Facebook linking re‑connects the ex‑partner as a synced friend who can see activity."
            }
          ],
          "leakage_source": "The music app's Friend Activity feature after Facebook sync reconnects someone Alice would not choose to share with.",
          "leak_to": "Estranged ex‑partner who is a synced Facebook friend on the music app.",
          "harms": [
            {
              "harm": "Physical Harms",
              "cause": "Exposure of late‑night activity patterns can increase stalking or safety risks."
            },
            {
              "harm": "Psychological Harms — Disturbance and Emotional Distress",
              "cause": "Unwanted contact and perceived surveillance trigger fear and anxiety."
            },
            {
              "harm": "Autonomy Harms — Lack of Control",
              "cause": "Sharing defaults and broad FB sync make it hard for Alice to prevent exposure to specific individuals."
            }
          ],
          "consequences": "Alice loses sleep, seeks help from family, and stops using the app at night—reducing her access to calming music she relies on."
        }
      ]
    },
    {
      "basic_info": {
        "name": "David",
        "age": 31,
        "tech_comfort_level": "medium"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Internal and experiential factors - Individual with history of addiction",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["support group attendance", "treatment history", "peer network"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - support groups want attendance logs",
          "Privacy vs. Disclosure of identity - fear stigma in community"
        ],
        "privacy_responses": [
          {
            "response": "Privacy lies",
            "description": "Gives ambiguous details or pseudonymous attendance."
          },
          {
            "response": "Controlling disclosure",
            "description": "Keeps separate email/accounts for recovery chats."
          }
        ],
        "costs_and_consequences": [
          "Potential breach of trust if deception revealed",
          "Labor managing multiple identities"
        ]
    },
    "additional_privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Treatment Access - telehealth sites requiring disclosure risk exposing sensitive data",
          "Privacy vs. Stigma - fear of information leakage to employers or insurers"
        ],
        "privacy_responses": [
          {
          "response": "Selective platform use",
          "description": "Chooses telehealth services with stronger privacy policies or avoids those known for third-party tracking."
          },
          {
          "response": "Limiting disclosure online",
          "description": "Minimizes details shared on telehealth platforms to reduce risk of exposure."
          }
        ],
        "costs_and_consequences": [
          "Restricted access to potentially helpful telehealth resources",
          "Increased mental burden from evaluating privacy policies",
          "Persistent fear of data misuse leading to delayed or avoided treatment"
      ]
    },
    "stories": [
      {
        "story": "David, who keeps his recovery life separate, turns on Friend Activity to see what others are listening to and then connects his Facebook so he can find people faster. Within minutes, his coworkers who are Facebook friends see him playing a playlist called “Relapse Prevention – 12 Step Speakers,” and one teammate shares it with their manager.",
        "information_leaked": "Exact tracks/playlists David is listening to (e.g., 'Relapse Prevention – 12 Step Speakers'), timestamps/recency (currently playing or within last 7 days), and the fact that he has Facebook-linked social connections on the music app.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 (turning ON 'Share my listening activity' makes David's listening visible to connected friends)"
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4 (successful Facebook login/authorization syncs Facebook friends, expanding who can see David's Friend Activity)"
          }
        ],
        "leakage_source": "The music app's Friend Activity sharing mechanism combined with Facebook Connect expanding the audience.",
        "leak_to": "Coworkers and the team manager who are synced Facebook friends on the app.",
        "harms": [
          {
            "harm": "Reputational Harms",
            "cause": "The app broadcasts sensitive recovery-related listening to a mixed audience (work contacts) after David turns on sharing and connects Facebook."
          },
          {
            "harm": "Economic Harms",
            "cause": "The manager learns of David's recovery status via Friend Activity and quietly removes him from consideration for a client-facing project."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Unexpected exposure of recovery-related listening causes anxiety and shame."
          },
          {
            "harm": "Autonomy Harms - Thwarted Expectations",
            "cause": "David expected to just discover friends; he did not anticipate immediate, wide disclosure to his entire Facebook-synced network."
          }
        ],
        "consequences": "David is passed over for a bonus-eligible client project and feels stigmatized at work."
      },
      {
        "story": "David enables sharing to see friends' listening, then starts a Private Session before an evening support meeting. After six hours, the Private Session automatically ends, but he keeps listening late at night to a playlist called 'Coping with Cravings.' His sponsor and mutual-followed peers see his late-night listening on the Friend Activity feed.",
        "information_leaked": "Late-night listening to recovery-themed content (playlist names and tracks), timing that implies struggles with cravings, and that David is active on the app at specific times.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 (turning ON 'Share my listening activity' sets the condition that any listening outside Private Session will be broadcast)"
          },
          {
            "function": 3,
            "flow_id": "flow4",
            "step_causing_harm": "step 3 (automatic end of Private Session after 6 hours removes protection; subsequent plays are shared to Friend Activity)"
          }
        ],
        "leakage_source": "The app auto-ending Private Session and reverting to active sharing without a prominent, disruptive warning.",
        "leak_to": "David's sponsor and recovery peers who follow him on the app.",
        "harms": [
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Sensitive late-night listening is exposed, prompting unsolicited interventions."
          },
          {
            "harm": "Relationship Harms",
            "cause": "Sponsor publicly calls out David's relapse fears in a group chat after seeing his Friend Activity."
          },
          {
            "harm": "Autonomy Harms - Lack of Control / Thwarted Expectations",
            "cause": "David believed Private Session would protect him through the night and did not expect it to silently expire while still using the app."
          }
        ],
        "consequences": "David experiences embarrassment in his support group, avoids subsequent meetings for a week, and feels less in control of his privacy."
      },
      {
        "story": "After connecting Facebook to grow his network, David tries to remove his former sponsor from his Friend Activity by clicking 'Unfollow' on their profile. Because the person is a synced Facebook friend, they still appear in David's Friend Activity and continue to see his listening, including a 'Post-Relapse Reflections' playlist he plays later that day.",
        "information_leaked": "David's recovery-related playlists and listening behavior remain visible to the former sponsor despite David's attempt to remove them.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow3",
            "step_causing_harm": "step 4 (turning ON 'See what your friends are playing' exposes the Friend Activity context that will later include the former sponsor)"
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4 (successful Facebook linking imports the former sponsor as a synced friend)"
          },
          {
            "function": 4,
            "flow_id": "flow3",
            "step_causing_harm": "step 3 (clicking 'Unfollow' on a synced Facebook friend fails to remove them from the Friend Activity feed, misleading David into believing visibility was controlled)"
          }
        ],
        "leakage_source": "The app's handling of 'Unfollow' for synced Facebook friends (they remain visible and continue to see David's activity).",
        "leak_to": "Former sponsor who is a synced Facebook friend.",
        "harms": [
          {
            "harm": "Autonomy Harms - Lack of Control",
            "cause": "The app allows 'Unfollow' but does not actually remove a synced Facebook friend from the Friend Activity context, undermining David's control."
          },
          {
            "harm": "Relationship Harms",
            "cause": "The ex-sponsor sees David's sensitive listening and messages mutual contacts, straining David's relationships in the recovery community."
          },
          {
            "harm": "Psychological Harms - Disturbance",
            "cause": "Persistent visibility to someone he tried to remove causes ongoing stress."
          }
        ],
        "consequences": "David receives unsolicited messages from the ex-sponsor and others, and reduces his app usage due to privacy concerns."
      },
      {
        "story": "David unfollows a coworker he does not want monitoring his listening. The coworker disappears from David's Friend Activity feed, but because the coworker still follows David and David has sharing turned on, the coworker continues to see David's listening, including 'Recovery Speaker Tapes,' and tells others at work.",
        "information_leaked": "David's sensitive recovery-related listening remains visible to someone he thought he had removed, along with timing/recency of that activity.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 (turning ON 'Share my listening activity' enables visibility to followers)"
          },
          {
            "function": 4,
            "flow_id": "flow2",
            "step_causing_harm": "step 2 (clicking 'Following' to unfollow a mutual friend removes them from David's view but does not stop their one-way follow of David, leading to ongoing exposure)"
          }
        ],
        "leakage_source": "The app's asymmetric follow model and UI that removes the coworker from David's feed without clarifying the coworker still follows David.",
        "leak_to": "The coworker who continues to follow David on the app and colleagues they inform.",
        "harms": [
          {
            "harm": "Autonomy Harms - Failure to Inform / Thwarted Expectations",
            "cause": "The app does not clearly inform that unfollowing someone does not stop them from seeing your activity if they still follow you."
          },
          {
            "harm": "Reputational Harms",
            "cause": "Coworker shares David's recovery listening with colleagues."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "David feels exposed and anxious about workplace gossip."
          }
        ],
        "consequences": "David becomes a subject of office chatter and begins avoiding team social events, fearing stigma."
      },
      {
        "story": "David connects Facebook to find friends, then realizes a close family member can now see his Friend Activity. He quickly blocks them, but they had already seen a week's worth of his 'Support Group Prep' listening and shared screenshots with relatives.",
        "information_leaked": "A 7-day history of recovery-related playlists/tracks and the fact David regularly prepares for support meetings.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 (turning ON 'Share my listening activity' enables broadcasting of current and recent plays)"
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4 (Facebook connection immediately syncs family member as a friend who can view David's Friend Activity)"
          },
          {
            "function": 4,
            "flow_id": "flow5",
            "step_causing_harm": "step 4 (blocking is a mitigation step; it did not cause harm but occurred after exposure)"
          }
        ],
        "leakage_source": "The app's immediate visibility of Friend Activity to newly synced Facebook friends, including up to 7 days of past listening.",
        "leak_to": "A close family member and, via screenshots, extended relatives.",
        "harms": [
          {
            "harm": "Relationship Harms",
            "cause": "Family member confronts David about his recovery activities after seeing the feed."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Being exposed to family without consent triggers shame and stress."
          },
          {
            "harm": "Autonomy Harms - Lack of Control",
            "cause": "David had no chance to curate or limit who could see the immediately backfilled 7-day listening once Facebook was connected."
          }
        ],
        "consequences": "Family tensions increase; David avoids upcoming gatherings and reduces use of the music app to prevent further exposure."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Kiran",
        "age": 34,
        "tech_comfort_level": "medium"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Structural and institutional exclusion - Disenfranchised ethnic minority",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["ethnic identity", "public records", "education history"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Disclosure of identity - registry data may be discriminatory",
          "Privacy vs. Support - identity needed for benefits but risky"
        ],
        "privacy_responses": [
          {
            "response": "Withholding disclosure",
            "description": "Uses partial identity when signing up for services."
          },
          {
            "response": "Privacy lies",
            "description": "Provides ambiguity around ethnic background."
          }
        ],
        "costs_and_consequences": [
          "Denied or delayed access to services",
          "Risk of detection or misrepresentation"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
        "Privacy vs. Disclosure of ethnic identity - disclosing can invite discrimination",
        "Privacy vs. Access to support - withholding identity may block benefits"
      ],
      "privacy_responses": [
        {
          "response": "Withholding or altering disclosure",
          "description": "Participants avoided or modified details about their ethnic identity to minimize risks of discrimination while using online services."
        },
        {
          "response": "Strategic ambiguity",
          "description": "Some individuals employed vagueness or partial disclosure as a tactic to protect themselves from profiling while still attempting to access services."
        }
      ],
      "costs_and_consequences": [
          "Restricted or delayed access to essential services due to incomplete disclosure",
          "Increased stress and fear of discriminatory treatment if disclosure occurs",
          "Risk of being flagged for misrepresentation when providing ambiguous or false information"
      ]
    },
    "stories": [
      {
        "story": "Kiran, who uses a shortened display name on the music app to avoid revealing his background, connects his account to Facebook to find more friends. The app links his real-name Facebook identity to his music profile and immediately starts sharing his listening activity. A coworker who is a Facebook friend sees Kiran's profile and recent plays of diaspora political music in the Friend Activity feed, connects the dots to Kiran's ethnic identity, and circulates it at work.",
        "information_leaked": "Linkage of Kiran's music-app account to his real name via Facebook; his listening activity and recently played artists; visibility of his followers/following lists (defaults ON) and timestamps (e.g., 'X minutes ago').",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow1",
            "step_causing_harm": "step 7 (turning ON 'Share my listening activity' primes exposure once friends are added)"
          },
          {
            "function": 2,
            "flow_id": "flow3",
            "step_causing_harm": "step 5 (successful 'Connect with Facebook' links real-name identity and syncs friends)"
          }
        ],
        "leakage_source": "The music app's Facebook friend-sync and default sharing settings.",
        "leak_to": "Facebook friends who also use the music app, including Kiran's coworker.",
        "harms": [
          {
            "harm": "Reputational harms",
            "cause": "The app links a pseudonymous music handle to a real-name Facebook account and surfaces culturally/politically specific listening in Friend Activity."
          },
          {
            "harm": "Discrimination harms",
            "cause": "Workplace colleagues infer Kiran's ethnic identity and views from listening activity exposed by the app."
          },
          {
            "harm": "Autonomy harms – Lack of control and thwarted expectations",
            "cause": "Default-on visibility (followers/following lists) and cross-app linking give Kiran less control than expected over what is revealed."
          },
          {
            "harm": "Psychological harms – Emotional distress",
            "cause": "Unwanted revelation of sensitive identity cues leads to anxiety and fear of discrimination."
          }
        ],
        "consequences": "Kiran's manager deprioritizes him for a high-visibility project; coworkers treat him differently; Kiran feels stress and begins avoiding the app's cultural playlists (chilling effect)."
      },
      {
        "story": "Kiran enables private listening before playing protest music tied to his community, assuming he's hidden. After six hours, the app silently ends his Private Session. He keeps listening, unaware. A mutual-followed coworker sees the new listening activity in Friend Activity during work hours and flags it to the team.",
        "information_leaked": "Titles and artists of tracks played after Private Session auto-expired; recency/timestamps revealing listening during work hours.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 (turning ON 'Share my listening activity' enables exposure once Private Session ends)"
          },
          {
            "function": 3,
            "flow_id": "flow4",
            "step_causing_harm": "step 3 (Private Session automatically ends after 6 hours; the blue padlock disappears and listening becomes public)"
          }
        ],
        "leakage_source": "The music app's Private Session auto-expiration behavior and active sharing setting.",
        "leak_to": "A coworker (mutual-followed friend) on the music app.",
        "harms": [
          {
            "harm": "Economic harms",
            "cause": "Coworker reports Kiran for streaming during work; management issues a performance warning."
          },
          {
            "harm": "Reputational harms",
            "cause": "Colleagues interpret his listening choices negatively after seeing them in Friend Activity."
          },
          {
            "harm": "Autonomy harms – Thwarted expectations and lack of control",
            "cause": "The app ends Private Session without an attention-grabbing reminder, causing Kiran to unknowingly broadcast sensitive listening."
          },
          {
            "harm": "Psychological harms – Emotional distress and chilling effects",
            "cause": "Kiran becomes anxious and stops listening to cultural content he values."
          }
        ],
        "consequences": "Kiran receives a formal warning and avoids culturally significant playlists to stay safe, harming his well-being and expression."
      },
      {
        "story": "Kiran tries to remove a harassing acquaintance from his Friend Activity feed by unfollowing them. Because that person is a synced Facebook friend, unfollowing does not sever the connection. Kiran assumes the person can no longer see his activity, but the app continues sharing his listening to that person.",
        "information_leaked": "Ongoing sharing of Kiran's listening activity and recency to an unwanted Facebook-synced contact.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 (turning ON 'Share my listening activity' allows exposure to existing synced contacts)"
          },
          {
            "function": 4,
            "flow_id": "flow1",
            "step_causing_harm": "step 2 (clicking 'Following' to unfollow a Facebook-synced friend does not remove them; sharing persists)"
          }
        ],
        "leakage_source": "The music app's Facebook sync model and the unfollow interaction that fails to break sharing to synced contacts.",
        "leak_to": "The harassing acquaintance who is a Facebook-synced friend on the app.",
        "harms": [
          {
            "harm": "Relationship harms",
            "cause": "The unwanted contact continues to see Kiran's activity, enabling targeted comments and surveillance."
          },
          {
            "harm": "Psychological harms – Emotional distress and disturbance",
            "cause": "Kiran feels exposed and anxious because his attempts to remove the person didn't work as expected."
          },
          {
            "harm": "Autonomy harms – Failure to inform and lack of control",
            "cause": "The UI does not clearly explain that unfollowing a Facebook-synced friend does not stop them from seeing Kiran's activity."
          }
        ],
        "consequences": "Harassment escalates; Kiran avoids the app or censors his listening to reduce exposure, limiting his access to supportive cultural content."
      },
      {
        "story": "After connecting to Facebook, Kiran's employer (a Facebook friend) views his music-app profile from the Friend Activity feed. Because the app defaults to showing followers/following lists publicly, the employer sees that Kiran follows diaspora advocacy playlists and infers his ethnic identity.",
        "information_leaked": "Public followers/following lists revealing culturally specific playlists; linkage to real-name identity via Facebook sync; recent listening activity.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 6 (defaults in 'Social' leave 'Show my followers and following lists on my public profile' ON; Kiran proceeds without changing it)"
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4 (successful Facebook connect syncs employer as a friend who can browse Kiran's public profile)"
          }
        ],
        "leakage_source": "The music app's default-on public follower/following visibility combined with Facebook friend-sync.",
        "leak_to": "Kiran's employer (Facebook friend) using the music app.",
        "harms": [
          {
            "harm": "Discrimination harms",
            "cause": "Employer infers protected characteristics from visible following lists and adjusts treatment accordingly."
          },
          {
            "harm": "Autonomy harms – Lack of control",
            "cause": "Default-on public settings expose social graph and interests without explicit, informed opt-in."
          },
          {
            "harm": "Psychological harms – Emotional distress",
            "cause": "Kiran feels surveilled and unsafe after realizing his social ties were visible by default."
          }
        ],
        "consequences": "The employer removes Kiran from client-facing opportunities; Kiran experiences stress and reduces engagement with supportive cultural communities on the app."
      },
      {
        "story": "Once Kiran connects the app to Facebook, his manager starts checking Friend Activity and notices Kiran's play timestamps. Seeing ‘8 minutes ago' next to a long playlist during work hours, the manager interprets it as inattentiveness and questions his commitment.",
        "information_leaked": "Recency/timestamps and duration implied by continuous listening; specific tracks played during work hours.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 (turning ON 'Share my listening activity' enables visibility of real-time play status)"
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4 (successful Facebook connect syncs the manager as a friend who can view Friend Activity timestamps)"
          }
        ],
        "leakage_source": "The music app's Friend Activity feed showing recency of listening to synced Facebook friends.",
        "leak_to": "Kiran's manager (Facebook friend) on the music app.",
        "harms": [
          {
            "harm": "Economic harms",
            "cause": "Manager penalizes Kiran for perceived misuse of time inferred from Friend Activity timestamps."
          },
          {
            "harm": "Autonomy harms – Coercion and chilling effects",
            "cause": "Kiran feels pressured to change lawful personal habits (e.g., background music) due to surveillance-like cues."
          },
          {
            "harm": "Psychological harms – Emotional distress",
            "cause": "Ongoing anxiety about being monitored by colleagues through the app."
          }
        ],
        "consequences": "Kiran loses flexibility for breaks, gets a negative performance note, and stops listening at work altogether, reducing focus and well-being."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Jose",
        "age": 26,
        "tech_comfort_level": "high"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Intersectional identities and characteristics - Migrant laborer",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["immigration status", "location tracking", "work history"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - some platforms require status disclosure",
        "Privacy vs. Autonomy - surveillance via location-based check-ins"
        ],
        "privacy_responses": [
          {
            "response": "Controlling disclosure",
            "description": "Uses separate phone or SIM to minimize linking."
          },
          {
            "response": "Privacy lies",
            "description": "Provides generic information in employer-platforms."
          }
        ],
        "costs_and_consequences": [
          "Less reliable communication with official services",
          "Risk of sanctions if status exposed"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
          "Privacy vs. Employment Security - disclosure of immigration status as a condition of work",
          "Privacy vs. Autonomy - constant monitoring by smart devices limits freedom",
          "Privacy vs. Support Access - platforms require sensitive disclosures for services"
      ],
      "privacy_responses": [
        {
          "response": "Minimizing disclosure",
          "description": "Withholds or downplays sensitive details like immigration documents unless strictly required."
        },
        {
          "response": "Strategic avoidance",
          "description": "Alters behavior or avoids certain areas of the home to reduce exposure to monitoring devices."
        },
        {
          "response": "Use of pseudonyms",
          "description": "Creates alternate accounts or uses different names to safeguard identity while accessing services."
        }
      ],
      "costs_and_consequences": [
        "Fear of job loss if disclosure is resisted",
        "Persistent anxiety about exposure of immigration status",
        "Loss of personal autonomy in living spaces",
        "Emotional stress from continuous monitoring",
        "Difficulty in accessing official services with pseudonymous accounts",
        "Risk of being denied support if information is inconsistent"
      ]
    },
    "stories": [
      {
        "story": "During a lunch break at the warehouse, Jose links his music app to Facebook to see more friends' activity. Prompted by the app's Social settings, he also turns on 'Share my listening activity.' Later that afternoon, his shift supervisor—who is a Facebook contact—opens the app and sees Jose listening to a pro‑immigrant workplace‑rights podcast during scheduled work hours.",
        "information_leaked": "Real-time listening activity (track/podcast titles and playlists), timestamps indicating listening during work hours, and association of this activity with Jose's real identity via Facebook sync.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 (Share my listening activity toggled ON)"
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4 (Facebook account linked after login)"
          }
        ],
        "leakage_source": "The music app's Friend Activity system broadcasting Jose's activity to Facebook-synced contacts once sharing is enabled.",
        "leak_to": "Shift supervisor and coworkers who are Facebook contacts and use the app with Friend Activity enabled.",
        "harms": [
          {
            "harm": "Economic harms",
            "cause": "The app auto-broadcasts Jose's listening in real time to workplace contacts, suggesting he is off-task, risking discipline or lost hours."
          },
          {
            "harm": "Discrimination harms",
            "cause": "Listening to immigrant-rights content is exposed to a supervisor who may hold bias, enabled by the app's broad sharing to Facebook contacts."
          },
          {
            "harm": "Reputational harms",
            "cause": "Supervisors/coworkers infer political or immigration-related views from the exposed podcast titles."
          },
          {
            "harm": "Autonomy harms — Lack of control/Failure to inform",
            "cause": "In-app prompts and design make it easy to enable wide sharing without clearly warning that Facebook contacts (including supervisors) will see real-time activity."
          }
        ],
        "consequences": "Jose is reprimanded and has hours cut; he starts self-censoring his listening at work, increasing stress and reducing access to helpful information."
      },
      {
        "story": "Jose turns on Private Session before listening to a 'USCIS Civics (Spanish)' study playlist at home, intending to keep it hidden. After 6 hours, the app ends his Private Session automatically without a clear re-prompt, and his listening resumes being shared. A landlord's relative—who is a Facebook friend—opens the app later that evening and sees Jose's citizenship-study playlist in Friend Activity.",
        "information_leaked": "Jose's sensitive listening (citizenship test prep), the fact that he is currently or recently active, and association of that activity with his name.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 (Share my listening activity toggled ON earlier, enabling any post–Private Session sharing)"
          },
          {
            "function": 3,
            "flow_id": "flow4",
            "step_causing_harm": "step 3 (Private Session automatically ends after 6 hours)"
          }
        ],
        "leakage_source": "The music app's automatic termination of Private Session, which resumes broadcasting to Friend Activity without a strong interruption or confirmation.",
        "leak_to": "A landlord's relative who is connected via Facebook and uses Friend Activity.",
        "harms": [
          {
            "harm": "Psychological harms — Emotional distress",
            "cause": "Auto-ending Private Session exposes sensitive study behavior (citizenship prep) without clear consent at that moment."
          },
          {
            "harm": "Autonomy harms — Thwarted expectations/Lack of control",
            "cause": "The app ends privacy protection on a timer, breaking Jose's expectation that his session remains private while he's still listening."
          },
          {
            "harm": "Discrimination harms",
            "cause": "Revealed immigration-related study may trigger bias from housing connections who see the activity."
          },
          {
            "harm": "Autonomy harms — Chilling effects",
            "cause": "Jose becomes reluctant to study or listen to helpful content on the app due to fear of exposure after Private Session auto-ends."
          }
        ],
        "consequences": "Jose feels anxious and avoids listening to study materials on the app, potentially delaying his test preparation and harming his housing relationships."
      },
      {
        "story": "After syncing Facebook to find friends, Jose notices a hostile coworker in his Friend Activity feed and tries to remove them. He unfollows the coworker from their profile, but because the connection is Facebook-synced, the coworker still appears and can continue seeing Jose's activity, including Spanish-language protest music.",
        "information_leaked": "Current and recent listening, cultural/political preferences, and activity timing, visible to a coworker Jose intended to remove.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow6",
            "step_causing_harm": "step 1 (opens Friend Activity to manage connections; precondition)"
          },
          {
            "function": 2,
            "flow_id": "flow3",
            "step_causing_harm": "step 5 (Facebook account linked, enabling synced friend visibility)"
          },
          {
            "function": 4,
            "flow_id": "flow1",
            "step_causing_harm": "step 2 (Click 'Following' — unfollowing a Facebook-synced user does not remove them from Friend Activity)"
          }
        ],
        "leakage_source": "The music app's Friend Activity design that keeps Facebook-synced contacts visible despite unfollowing, contrary to user expectations.",
        "leak_to": "The hostile coworker who remains in Jose's Friend Activity connections via Facebook sync.",
        "harms": [
          {
            "harm": "Relationship harms",
            "cause": "The coworker continues to see Jose's listening, fueling targeted teasing and tension at work."
          },
          {
            "harm": "Autonomy harms — Lack of control/Thwarted expectations",
            "cause": "The app allows unfollow but does not remove Facebook-synced contacts from visibility, undermining Jose's attempt to limit exposure."
          },
          {
            "harm": "Psychological harms — Emotional distress",
            "cause": "Persistent unwanted visibility increases Jose's stress in the workplace."
          }
        ],
        "consequences": "Jose changes his behavior (avoids certain music, uses a separate device), which reduces enjoyment and increases burden; workplace tension escalates."
      },
      {
        "story": "When Jose first tries Friend Activity, he has no friends visible, so the app guides him to Social settings. He turns on 'Share my listening activity' even though he has no contacts there. Later, he links Facebook, and his last 7 days of listening (including 'Know Your Rights for Immigrants') instantly becomes visible to many community acquaintances.",
        "information_leaked": "Recent listening history (past 7 days), including politically sensitive content and the timing of recent plays, tied to Jose's real identity through Facebook.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow1",
            "step_causing_harm": "step 7 (Share my listening activity toggled ON despite having no friends yet)"
          },
          {
            "function": 2,
            "flow_id": "flow3",
            "step_causing_harm": "step 5 (Successful Facebook link immediately exposes recent listening to synced contacts)"
          }
        ],
        "leakage_source": "The music app's Friend Activity feature, which retroactively displays recent listening once Facebook contacts are synced and sharing is already on.",
        "leak_to": "Community acquaintances (e.g., a conservative group organizer) who are Facebook friends and use the app.",
        "harms": [
          {
            "harm": "Reputational harms",
            "cause": "Sensitive listening appears to community contacts, risking negative judgments about Jose's immigration status or activism."
          },
          {
            "harm": "Discrimination harms",
            "cause": "Exposed content can trigger biased treatment within community networks."
          },
          {
            "harm": "Autonomy harms — Chilling effects/Failure to inform",
            "cause": "The app doesn't clearly warn that turning on sharing with no visible friends will later expose past listening when Facebook is connected."
          }
        ],
        "consequences": "Jose withdraws from community events to avoid scrutiny and censors future listening; this limits access to supportive resources and increases anxiety."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Linda",
        "age": 22,
        "tech_comfort_level": "low"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Socioeconomic disadvantage - High school dropout",
        "privacy_awareness_level": "low",
      "information_cared_about": ["educational history", "job-search data", "identity"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - job portals require identity",
          "Disclosure vs. Stigma - dropout status may limit opportunities"
        ],
        "privacy_responses": [
          {
            "response": "Apathy",
            "description": "Does not complete profiles or avoids platforms."
          }
        ],
        "costs_and_consequences": [
          "Limited access to job listings",
          "Economic exclusion"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [],
      "privacy_responses": [
        {
          "response": "",
          "description": ""
        }
      ],
      "costs_and_consequences": []
    },
    "stories": [
      {
        "story": "Linda opens the music app to see what friends are playing, turns on sharing, then uses the app's Add Friends to connect her Facebook. A café supervisor she recently friended on Facebook sees in Friend Activity that Linda is listening to a 'GED prep' playlist and a 'Job Interview Anxiety' podcast, revealing her dropout status and job search. She never gets a callback for the barista job.",
        "information_leaked": "Linda's live and recent listening activity (e.g., 'GED prep' playlist, 'Job Interview Anxiety' podcast) tied to her real-name profile, visible to synced Facebook friends via the music app's Friend Activity feed.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow5",
            "step_causing_harm": "step 4 (turning on 'Share my listening activity')"
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4 (successful Facebook connect, syncing friends and exposing activity to them)"
          }
        ],
        "leakage_source": "Linda's music app account via the app's default social sharing and Facebook syncing.",
        "leak_to": "A café supervisor (Facebook friend) and other synced Facebook contacts who use the app.",
        "harms": [
          {
            "harm": "Economic Harm",
            "cause": "The app automatically shares Linda's listening activity to synced Facebook contacts after connecting, letting an employer infer sensitive educational and job-seeking information."
          },
          {
            "harm": "Autonomy Harm - Failure to Inform/Thwarted Expectations",
            "cause": "The path to view friends encourages enabling 'Share my listening activity' without clearly warning that it broadcasts Linda's listening to all synced Facebook contacts."
          },
          {
            "harm": "Reputational Harm",
            "cause": "The app links real-name identity from Facebook and displays sensitive listening that can stigmatize her as a dropout."
          }
        ],
        "consequences": "Linda is quietly screened out for the job; she experiences increased financial strain and loss of confidence in applying elsewhere."
      },
      {
        "story": "Linda turns on sharing to watch what friends play but then starts a Private Session to listen to explicit breakup tracks and mental health podcasts. After 6 hours, the app silently ends Private Session. Linda keeps listening, unaware it's public again, and her roommate and an old classmate see the sessions in Friend Activity.",
        "information_leaked": "Live and recent listening activity (explicit breakup tracks, mental health podcasts) visible to followers/synced friends after Private Session auto-ends.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 (turning on 'Share my listening activity')"
          },
          {
            "function": 3,
            "flow_id": "flow4",
            "step_causing_harm": "step 3 (Private Session automatically ends after 6 hours, resuming public sharing)"
          }
        ],
        "leakage_source": "The music app's Private Session auto-timeout and default reversion to public sharing.",
        "leak_to": "Roommate and an old classmate who appear in Linda's Friend Activity list.",
        "harms": [
          {
            "harm": "Psychological Harm - Emotional Distress",
            "cause": "The app resumes public sharing without a sufficiently salient warning when Private Session expires."
          },
          {
            "harm": "Relationship Harm",
            "cause": "People close to Linda see intimate listening patterns (mental health topics), leading to awkward questioning and gossip."
          },
          {
            "harm": "Autonomy Harm - Lack of Control",
            "cause": "Auto-ending a privacy feature without sticky privacy defaults or clear prompts undermines Linda's control."
          }
        ],
        "consequences": "Linda feels embarrassed and withdraws from listening to helpful content; tension with her roommate increases."
      },
      {
        "story": "Linda connects Facebook to find friends, then tries to remove a judgmental cousin from the feed. She clicks Unfollow on the cousin's profile, but the person remains in Friend Activity because they're a Facebook-synced friend. Linda keeps listening to 'Budget hacks for dropouts' and the cousin sees it and tells relatives.",
        "information_leaked": "Ongoing visibility of Linda's listening activity and social graph to a specific Facebook-synced contact she cannot remove via unfollow.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 (turning on 'Share my listening activity')"
          },
          {
            "function": 2,
            "flow_id": "flow3",
            "step_causing_harm": "step 5 (successful Facebook connect, bringing the cousin into Friend Activity)"
          },
          {
            "function": 4,
            "flow_id": "flow1",
            "step_causing_harm": "step 2 (Unfollow does not remove a Facebook-synced friend from Friend Activity)"
          }
        ],
        "leakage_source": "The music app's design for Facebook-synced friends, which persist in Friend Activity despite unfollowing.",
        "leak_to": "The cousin (Facebook-synced friend) who continues to see Linda's listening activity.",
        "harms": [
          {
            "harm": "Autonomy Harm - Lack of Control",
            "cause": "The app prevents effective removal of Facebook-synced contacts from Friend Activity through normal controls (Unfollow)."
          },
          {
            "harm": "Relationship Harm",
            "cause": "The cousin repeatedly sees sensitive listening that implies financial and educational struggles and shares it with family."
          },
          {
            "harm": "Reputational Harm",
            "cause": "Family perceptions of Linda worsen due to inferred stigma from her listening history."
          }
        ],
        "consequences": "Family tension rises; Linda starts avoiding the app and family gatherings, reducing social support."
      },
      {
        "story": "Linda connects Facebook to expand friends, starts a Private Session to hide what she's playing while exploring 'Skip College?' podcasts and 'Anti-work anthems.' After 6 hours, Private Session ends and her listening is shared again. She tries to remove a temp-agency recruiter (synced from Facebook) by using Unfollow from the profile menu, but the person remains in Friend Activity and keeps seeing her listening.",
        "information_leaked": "Linda's listening history around skepticism of college and work, visible to a recruiter synced from Facebook, tied to her real identity.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 (turning on 'Share my listening activity')"
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4 (successful Facebook connect, syncing the recruiter)"
          },
          {
            "function": 3,
            "flow_id": "flow6",
            "step_causing_harm": "step 6 (Private Session automatically ends after 6 hours, resuming public sharing)"
          },
          {
            "function": 4,
            "flow_id": "flow3",
            "step_causing_harm": "step 3 (Unfollow via menu does not remove Facebook-synced friend from Friend Activity)"
          }
        ],
        "leakage_source": "The music app's cross-platform friend sync, automatic end of Private Session, and limitations on removing Facebook-synced contacts.",
        "leak_to": "A temp-agency recruiter (Facebook-synced friend) who keeps seeing Linda's listening in Friend Activity.",
        "harms": [
          {
            "harm": "Economic Harm",
            "cause": "The recruiter infers negative work attitudes from her playlists and deprioritizes her application."
          },
          {
            "harm": "Autonomy Harm - Lack of Control/Thwarted Expectations",
            "cause": "The app auto-exposes listening after Private Session ends and does not let her remove synced contacts via standard controls."
          },
          {
            "harm": "Psychological Harm - Disturbance",
            "cause": "Persistent exposure to a professional contact creates ongoing anxiety and self-censorship."
          }
        ],
        "consequences": "A job lead is quietly dropped; Linda loses potential income and becomes more hesitant to use music and podcast content that could help her."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Eva",
        "age": 16,
        "tech_comfort_level": "high"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Internal and experiential factors - Teen facing online bullying",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["social posts", "school identity", "online friends"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
        "Privacy vs. Self-expression - wants to post but fears harassing responses",
        "Privacy vs. Support - needs help but doesn't want bully to notice"
        ],
        "privacy_responses": [
          {
            "response": "Withholding disclosure",
            "description": "Removes identifying details, avoids naming school."
          },
          {
          "response": "Non-use",
            "description": "Stops using platforms where bullying occurs."
          }
        ],
        "costs_and_consequences": [
          "Silenced voice online",
          "Less social connection"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
        "Privacy vs. Self-expression - revealing personal details increases bullying risk",
        "Privacy vs. Social support - avoiding disclosure reduces chances of connection and assistance"
      ],
      "privacy_responses": [
        {
          "response": "Withholding disclosure",
          "description": "Victims restrict or remove personal information such as school identity, hobbies, or photos to prevent being targeted."
        },
        {
          "response": "Non-use / Platform withdrawal",
          "description": "Teens stop using certain online platforms where bullying is frequent, even if it limits their social and expressive space."
        }
      ],
      "costs_and_consequences": [
        "Loss of opportunities for self-expression due to reduced sharing of personal details",
        "Weakened social connections from avoiding or leaving online spaces",
        "Ongoing fear and stress related to potential targeting if disclosure occurs"
      ]
    },
    "stories": [
      {
        "story": "Eva, a 16-year-old who's been bullied at school, opens the music app, turns on sharing, and connects her Facebook to add friends. Minutes later, her school bully sees her listening to a sad playlist in the Friend Activity feed and spreads it in a group chat, mocking her.",
        "information_leaked": "Eva's live and recent listening activity (track and playlist titles), timestamps/recency, and the linkage of her music account to her real-world identity via Facebook sync.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 - Eva switches 'Share my listening activity' to ON, making her listening visible to connected friends."
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4 - Successful Facebook linking authorizes syncing friends, instantly expanding the audience that can see her listening."
          }
        ],
        "leakage_source": "The music app's Friend Activity feature and Facebook sync integration.",
        "leak_to": "Synced Facebook friends in the app, including a known school bully and other classmates.",
        "harms": [
          {
            "harm": "Reputational Harms",
            "cause": "Sharing playlist/track choices (e.g., sad/heartbreak playlists) to school peers via the Friend Activity feed."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Exposure of mood-sensitive listening leads to ridicule and renewed bullying."
          },
          {
            "harm": "Autonomy Harms - Failure to Inform / Thwarted Expectations",
            "cause": "The 'We'll never post to Facebook' message during connection may lead Eva to believe her Facebook friends won't immediately see her listening in-app."
          },
          {
            "harm": "Relationship Harms",
            "cause": "Peers mock and ostracize Eva based on the shared listening information."
          }
        ],
        "consequences": "Bullying escalates in school group chats; Eva avoids the app (non-use), loses social connection, and experiences heightened stress."
      },
      {
        "story": "Eva enables friend sharing, later starts a Private Session for a late-night coping playlist. The session automatically ends after 6 hours, and her morning listening is immediately visible again to classmates, including the bully.",
        "information_leaked": "Post–Private Session listening activity (e.g., 'Anxiety coping' and 'therapy' playlists) shared automatically when the session expires.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 - 'Share my listening activity' ON ensures that once Private Session ends, sharing resumes automatically."
          },
          {
            "function": 3,
            "flow_id": "flow6",
            "step_causing_harm": "step 6 - Private Session automatically ends after 6 hours, removing protection and resuming sharing."
          }
        ],
        "leakage_source": "The music app's auto-expiring Private Session with default resumption of sharing.",
        "leak_to": "Mutual-followed school friends who use the app, including the bully.",
        "harms": [
          {
            "harm": "Autonomy Harms - Lack of Control / Thwarted Expectations",
            "cause": "The temporary Private Session ends automatically, resuming sharing without an explicit confirmation prompt."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Peers can infer mental health struggles from playlist names, leading to embarrassment."
          },
          {
            "harm": "Chilling Effects",
            "cause": "Eva avoids listening to helpful content for fear of exposure."
          }
        ],
        "consequences": "She is teased about 'therapy' music on the bus; anxiety increases; she stops using the app for self-care playlists."
      },
      {
        "story": "Eva turns on sharing but tries to remove a Facebook-synced bully from her Friend Activity by clicking 'Following' on their profile. The user remains in her feed and continues to see her listening, giving Eva a false sense of safety.",
        "information_leaked": "Ongoing sharing of Eva's current and recent listening to a Facebook-synced contact she attempted to remove.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow5",
            "step_causing_harm": "step 4 - 'Share my listening activity' is switched ON, enabling visibility to synced friends."
          },
          {
            "function": 4,
            "flow_id": "flow1",
            "step_causing_harm": "step 2 - Clicking 'Following' to unfollow a Facebook-synced friend does not remove them from Friend Activity visibility; they still appear."
          }
        ],
        "leakage_source": "The music app's distinction between unfollowing and Facebook-synced visibility, and continued sharing.",
        "leak_to": "The Facebook-synced bully who remains able to see Eva's listening activity.",
        "harms": [
          {
            "harm": "Autonomy Harms - Failure to Inform / Thwarted Expectations",
            "cause": "The UI suggests unfollowing, but does not explain that sync-based connections still see activity."
          },
          {
            "harm": "Psychological Harms - Disturbance",
            "cause": "Eva believes she removed the bully, then notices taunts about tracks she listened to anyway."
          },
          {
            "harm": "Relationship Harms",
            "cause": "Bully continues to monitor and mock Eva's listening choices."
          }
        ],
        "consequences": "Eva feels tricked by the app, loses trust, and stops sharing or avoids the platform entirely, reducing her social connection."
      },
      {
        "story": "Eva enables sharing, connects Facebook to add classmates, then starts a Private Session before listening to sensitive content. Hours later the session expires automatically, and her new listening is exposed to the same synced classmates, including the bully.",
        "information_leaked": "Sensitive playlists and tracks played after the Private Session auto-expired, plus timing/patterns of listening linked to her Facebook identity.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow2",
            "step_causing_harm": "step 7 - Turning on 'Share my listening activity' allows any newly added friends to see her activity."
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4 - Successful Facebook linking syncs classmates who can now see her Friend Activity."
          },
          {
            "function": 3,
            "flow_id": "flow4",
            "step_causing_harm": "step 3 - Private Session automatically ends after 6 hours, resuming sharing silently."
          }
        ],
        "leakage_source": "The music app's Facebook friend sync combined with auto-expiring Private Session and active sharing.",
        "leak_to": "Synced Facebook classmates, including the bully.",
        "harms": [
          {
            "harm": "Autonomy Harms - Lack of Control / Failure to Inform",
            "cause": "The app resumes sharing by default after Private Session ends, without a clear re-consent step."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Classmates see sensitive listening and tease Eva about it."
          },
          {
            "harm": "Relationship Harms",
            "cause": "Increased targeting by classmates linked via Facebook."
          }
        ],
        "consequences": "Eva receives mocking DMs; she withdraws from group activities and avoids music she enjoys for fear of exposure."
      },
      {
        "story": "Eva connects Facebook and her school bully gets auto-added. She tries the three-dot 'Unfollow' option on the bully's profile, but because the connection is Facebook-synced, the bully still sees her listening, which reveals school-related playlists and routines.",
        "information_leaked": "Eva's current listening, playlist names tied to school life (e.g., pep rally mixes), and timing patterns that hint at her schedule.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow3",
            "step_causing_harm": "step 4 - The Friend Activity becomes active with friends; Eva assumes visibility is controllable through simple unfollow."
          },
          {
            "function": 2,
            "flow_id": "flow1",
            "step_causing_harm": "step 4 - Successful Facebook linking syncs school peers, including the bully."
          },
          {
            "function": 4,
            "flow_id": "flow3",
            "step_causing_harm": "step 3 - Clicking 'Unfollow' on a Facebook-synced friend does not remove their visibility; they still appear in Friend Activity."
          }
        ],
        "leakage_source": "The music app's Facebook sync and Friend Activity sharing despite unfollowing a synced contact.",
        "leak_to": "The Facebook-synced bully and other synced classmates.",
        "harms": [
          {
            "harm": "Autonomy Harms - Thwarted Expectations / Failure to Inform",
            "cause": "The UI allows 'Unfollow' but does not clarify that synced contacts still receive visibility of Eva's listening."
          },
          {
            "harm": "Reputational Harms",
            "cause": "School-themed playlists reveal her school identity she tries to withhold."
          },
          {
            "harm": "Physical Harms (risk)",
            "cause": "Timing patterns of listening around school events could enable targeted in-person confrontations."
          },
          {
            "harm": "Psychological Harms - Emotional Distress",
            "cause": "Ongoing monitoring of her listening increases fear and stress."
          }
        ],
        "consequences": "Eva is taunted about her school activities, worries about being confronted after events, and reduces her use of the app and school-related playlists."
      }
    ]
  }
]