[
    {
      "basic_info": {
        "name": "Amina",
        "age": 12,
        "tech_comfort_level": "low"
      },
      "contextual_info": {
          "vulnerability_type_brief_description": "Structural and institutional exclusion - Discrimination due to refugee status",
        "privacy_awareness_level": "low",
        "information_cared_about": ["location", "immigration status", "identity documents"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - afraid to identify to receive assistance",
          "Privacy vs. Disclosure of identity - risk of stigma or denial of aid"
        ],
        "privacy_responses": [
          {
            "response": "Apathy",
            "description": "Feels surveillance is inevitable, so avoids acting or reporting."
          },
          {
            "response": "Non-use",
            "description": "Avoids official portals or apps to not expose status."
          }
        ],
        "costs_and_consequences": [
          "Missed access to legal aid, medical care, or language support",
          "Continued vulnerability without reporting abuse or needs"
        ]
      },
      "additional_privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
              "Privacy vs. Safety - reluctance to disclose refugee status to protect from harassment or threats",
              "Privacy vs. Community engagement - fear of harassment reduces participation in supportive spaces",
              "Privacy vs. Public presence - online hostility pressures refugees to retreat from digital spaces"
        ],
        "privacy_responses": [
          {
              "response": "Avoidance of disclosure",
              "description": "Chooses not to share refugee status or personal information online or with unfamiliar organizations."
          },
          {
              "response": "Self-censorship",
              "description": "Avoids posting personal stories or identifiable details online to prevent harassment or doxxing."
          },
          {
              "response": "Withdrawal from platforms",
              "description": "Stops using social media after repeated harassment tied to refugee identity."
          }
        ],
        "costs_and_consequences": [
              "Limited ability to use digital services that could provide beneficial resources",
              "Loss of emotional and social support from online communities",
              "Reduced access to information, opportunities, and advocacy networks"
          ]
      },
      "stories": [
        {
          "persona_identity": "Amina is a 12-year-old girl and a middle-school student who recently resettled as a refugee; she’s in a vulnerable group due to her refugee status. Her tech comfort is low because she shares a family phone, uses apps in a second language, and has little guidance on privacy settings.",
          "story": "Walking home in Riverton, Amina gets a neighborhood alert about a police checkpoint near Pine Street. A classmate glances at her phone and notices how close the alert says she is. Curious and worried about getting home, Amina opens the stream, reacts, and posts a question using the default profile name her school club once set for her. Neighbors reply, and the next day, when she sees police again near her courtyard at Riverwalk Apartments, she starts a quick live video to warn others. Later, scared by teasing at school and a neighbor’s remark about knowing where she lives, she tries to hide her broadcast from her profile, but the video link keeps circulating through the incident page and group shares.",
          "information_leaked": "Approximate home location and routine (alert proximity and live view of Riverwalk Apartments courtyard at 1183 Maple Ave, Riverton); full display name that includes a refugee-related label; child’s voice and face; language/accents hinting background; timestamped presence near 3rd Ave & Pine St (0.2 mi); association with police-related incidents in her immediate area.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow5",
              "step_causing_harm": [
                "start: Receive incident notification from NeighborNet that includes distance to the event and a thumbnail suggesting it's very close"
              ],
              "design_problems": [
                "Lock-screen notifications include fine-grained proximity by default, exposing location context to bystanders",
                "No child/minor-safe default that redacts distance or blurs thumbnails on shared devices",
                "No prominent, easy opt-out of sensitive notification previews"
              ]
            },
            {
              "function": 2,
              "flow_id": "flow5",
              "step_causing_harm": [
                "step 6: Close the guidelines pop-up and submit a comment using the default profile display name",
                "step 7: System posts the comment publicly, tying the message to her identity and local presence"
              ],
              "design_problems": [
                "Default identity uses the full display name carried from a school club account (includes 'Refugee'), with no obvious 'post as anonymous' default for minors",
                "No real-time warning that posting reveals name and local context to all viewers",
                "Inadequate age-sensitive privacy guardrails for public chat participation"
              ]
            },
            {
              "function": 3,
              "flow_id": "flow3",
              "step_causing_harm": [
                "step 6: Tap 'Stay Live' and begin broadcasting from home courtyard, revealing the building exterior and ambient audio"
              ],
              "design_problems": [
                "Live overlay conveys incident type and local area while video shows identifiable landmarks, effectively pinpointing residence",
                "No automatic face/voice blurring or geolocation obfuscation for child streamers",
                "Frictionless go-live flow encourages filming from sensitive locations without contextual privacy warnings"
              ]
            },
            {
              "function": 4,
              "flow_id": "flow1",
              "step_causing_harm": [
                "step 4: Tap 'Hide Video From Profile', which only removes it from the personal profile view but leaves it discoverable on the incident page and via shared links"
              ],
              "design_problems": [
                "Misleading control: 'Hide from Profile' implies privacy without clarifying continued public availability",
                "No clear pathway to full deletion or redaction of sensitive frames/metadata from incident contexts",
                "Lack of confirmation messaging about where the video remains visible"
              ]
            }
          ],
          "leakage_source": "NeighborNet’s default notification previews, public chat identity defaults, and public-by-default live streaming; continued hosting of the broadcast on the incident page despite profile hiding.",
          "leak_to": "Classmates who saw the notification on her lock screen; nearby neighbors watching the incident feed; local community members in Riverton who follow police-related alerts; people who received or reshared the incident link.",
          "harms": [
            {
              "harm": "Discrimination Harms",
              "cause": "Public comment and display name link her to refugee identity while also revealing her proximity to police-related incidents, inviting bias from neighbors or peers."
            },
            {
              "harm": "Reputational Harms",
              "cause": "Association with police incidents near her home and her visible identity in chat frames her as someone who is 'reporting on police,' fueling rumors at school and in the building."
            },
            {
              "harm": "Psychological Harms — Emotional Distress",
              "cause": "Persistent visibility of the broadcast despite 'hiding' leads to anxiety, fear of being singled out, and worry about safety around home and school."
            },
            {
              "harm": "Autonomy Harms — Lack of Control and Thwarted Expectations",
              "cause": "Ambiguous controls (hide vs. delete) and default public identity remove meaningful control over how her content and identity are shared."
            },
            {
              "harm": "Physical Harms",
              "cause": "Live video from the courtyard exposes her residence layout and routine, increasing risk of targeted harassment near the building."
            }
          ],
          "consequences": "Amina is teased at Edison Middle School and avoids walking her usual route; a neighbor makes a hostile remark implying they know her unit area; her family changes routines and limits her phone use; she withdraws from the Refugee Welcome Club and stops using the app, missing timely safety updates and local resources."
        }
      ]
    },
    {
      "basic_info": {
        "name": "Eleanor",
        "age": 72,
        "tech_comfort_level": "low"
      },
      "contextual_info": {
        "vulnerability_type_brief_description": "Intersectional identities and characteristics - Elderly individual with cognitive decline",
        "privacy_awareness_level": "low",
        "information_cared_about": ["health data", "location", "financial transactions"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Autonomy - carers may monitor devices to protect",
          "Privacy vs. Support - needs remote monitoring but fears intrusion"
        ],
        "privacy_responses": [
          {
            "response": "Third-party protections",
            "description": "Relies on caregivers to manage device access and privacy."
          },
          {
            "response": "Physical workarounds",
            "description": "Uses simple devices with limited connectivity to reduce exposure."
          }
        ],
        "costs_and_consequences": [
          "Loss of independence and personal control",
          "Potential exclusion from beneficial tech innovations"
        ]
      },
      "additional_privacy_responses_and_costs": {
          "privacy_tensions_with_short_description": [
              "Privacy vs. Safety - protective monitoring may feel invasive",
              "Privacy vs. Dependence - reliance on others for privacy controls may lead to oversharing",
              "Privacy vs. Autonomy - safety measures may undermine dignity"
          ],
          "privacy_responses": [
              {
                  "response": "Selective adoption",
                  "description": "Chooses only certain monitoring tools or disables features to reduce intrusion."
              },
              {
                  "response": "Delegated privacy control",
                  "description": "Allows trusted individuals to set and manage device and account privacy preferences."
              },
              {
                  "response": "Consent safeguards",
                  "description": "Seeks clear explanations and agreements before enabling monitoring features."
              }
          ],
          "costs_and_consequences": [
              "Reduced protection from safety-focused monitoring systems",
              "Increased risk of falling victim to scams or fraud",
              "Potential over-disclosure of personal information",
              "Loss of awareness about personal data handling",
              "Possible reduced safety if tracking features are limited or disabled",
              "Emotional distress over loss of dignity"
          ]
      },
      "stories": [
        {
          "persona_identity": "Eleanor is a 72-year-old woman and retired librarian living alone; her mild cognitive decline lowers her tech comfort because permission prompts and settings feel confusing, placing her in an elderly and cognitively vulnerable group.",
          "story": "Smelling smoke in her hallway at Maple Court Apartments, Eleanor opens the community safety app to warn neighbors and begins a live broadcast from her doorway. The stream shows the building entrance and her unit number on the door while her voice trembles as she worries aloud about forgetting if her stove is on. Minutes later, anxious about who might be watching, she goes to her profile and hides the video, assuming it is no longer visible. However, neighbors nearby can still view the broadcast through the incident page, and a building resident recognizes her apartment from the stream. Word spreads quickly, and her daughter—alerted by a neighbor—later confronts Eleanor about streaming from inside the apartment.",
          "information_leaked": "Exact location (Maple Court Apartments near 415 Maple Street, Unit 3B visible), interior of her home, that she lives alone, and health-related inference about cognitive decline based on her statements and demeanor.",
          "flow_in_app": [
            {
              "function": 3,
              "flow_id": "flow5",
              "step_causing_harm": [
                "Step 5: The broadcast goes live, displaying the user's location with the incident type while the microphone and camera capture her doorway and voice.",
                "Step 6: The system confirms a related incident nearby and publishes/boosts the stream to neighbors within range.",
                "Step 7: Viewers begin to engage, indicating the stream is discoverable and continues to be accessible."
              ],
              "design_problems": [
                "Default public broadcast with prominent location labeling and no pre-broadcast privacy check (e.g., mask exact location, blur background, or limit audience).",
                "Auto-publish/boost once criteria are met without a second consent prompt explaining who will be notified.",
                "No clear control to immediately redact location, blur video, or auto-mute health-sensitive audio during the live broadcast."
              ]
            },
            {
              "function": 4,
              "flow_id": "flow1",
              "step_causing_harm": [
                "Step 4: Selecting 'Hide Video From Profile' creates a 'hidden' state that does not remove the broadcast from incident pages or neighborhood feeds."
              ],
              "design_problems": [
                "'Hide From Profile' is misleading and fails to inform users that the video remains publicly discoverable elsewhere.",
                "No clear global 'unpublish' or takedown option, and no warning about continued availability through incident pages or shares."
              ]
            }
          ],
          "leakage_source": "NeighborNet Live+ default public broadcast and auto-location labeling, combined with the platform’s misleading 'Hide From Profile' option.",
          "leak_to": "Nearby NeighborNet users within approximately a quarter-mile, including residents of Maple Court Apartments and adjacent blocks who follow the local feed.",
          "harms": [
            {
              "harm": "Psychological Harms - Emotional distress and disturbance",
              "cause": "The app broadcasts her home and confused statements to nearby viewers, leading to embarrassment and anxiety."
            },
            {
              "harm": "Autonomy Harms - Lack of control and thwarted expectations",
              "cause": "The default public stream and ambiguous 'Hide From Profile' control prevent Eleanor from fully retracting the broadcast, undermining her intent to remove it."
            },
            {
              "harm": "Reputational Harms",
              "cause": "Neighbors associate her with confusion and potential forgetfulness after recognizing her unit from the stream."
            }
          ],
          "consequences": "Her daughter increases monitoring on Eleanor’s phone and enables stricter controls, reducing Eleanor’s independence. Eleanor feels humiliated, avoids using the app, and becomes more hesitant to seek help during future emergencies."
        }
      ]
    },
    {
      "basic_info": {
        "name": "Jamal",
        "age": 15,
        "tech_comfort_level": "high"
      },
      "contextual_info": {
        "vulnerability_type_brief_description": "Intersectional identities and characteristics - Child navigating social media",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["posts", "location tagging", "social connections"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Self-expression - wants to post but fears visibility by adults",
          "Privacy vs. Support - parental monitoring vs peer privacy"
        ],
        "privacy_responses": [
          {
            "response": "Withholding disclosure",
            "description": "Omits identifying info and avoids location tags."
          },
          {
            "response": "Controlling disclosure",
            "description": "Uses private accounts or separate pseudonymous profiles."
          }
        ],
        "costs_and_consequences": [
          "Less authentic social engagement",
          "Mental load managing multiple profiles"
        ]
      },
      "additional_privacy_responses_and_costs": {
          "privacy_tensions_with_short_description": [
              "Privacy vs. Self-expression - limits public sharing to maintain control over personal identifiers",
              "Privacy vs. Support - avoids location sharing to limit monitoring",
              "Privacy vs. Platform engagement - lack of effective tools can discourage participation"
          ],
          "privacy_responses": [
              {
                  "response": "Selective audience sharing",
                  "description": "Shares personal or sensitive content only with trusted contacts or private lists."
              },
              {
                  "response": "Account separation",
                  "description": "Maintains distinct profiles for different audiences, such as parents and peers."
              },
              {
                  "response": "Tool-based boundary regulation",
                  "description": "Uses available platform settings to manage visibility across different social circles."
              }
          ],
          "costs_and_consequences": [
              "Reduced potential for wider recognition or engagement on posts",
              "Ongoing effort to maintain multiple accounts and manage distinct audiences",
              "Possible reduced participation in online spaces due to fear of unintended exposure"
          ]
      },
      "stories": [
        {
          "persona_identity": "Jamal is a 15-year-old male high school student. As a minor navigating social media, he’s vulnerable to location-based exposure; his high tech comfort comes from running his school’s coding club chat and routinely tweaking privacy settings on his phone.",
          "story": "After school, Jamal went live to warn neighbors about a scuffle outside Lincoln High on E Walnut St and 12th Ave. The app attached his cross-street and neighborhood to the broadcast, and a local teacher recognized his voice. On the bus home, a new geofenced alert about a patrol near Cedar Park flashed on his phone screen; a coach sitting nearby noticed the banner and realized Jamal was close to that area. Jamal opened the alert, watched the nearby stream, and posted a quick safety comment that referenced the school’s east gate. Because the app showed his profile name rather than the pseudonym he prefers, classmates and adults in the neighborhood linked the comment—and his earlier live stream—to him and his routine after school.",
          "information_leaked": "Precise cross-street and neighborhood of Jamal’s live location; his voice and time-stamped presence near Lincoln High; geofenced notification revealing his proximity to Cedar Park; his profile display name tied to a location-specific comment that references his school and typical route.",
          "flow_in_app": [
            {
              "function": 3,
              "flow_id": "flow7",
              "step_causing_harm": [
                "Step 7 (active broadcast): The live stream displays 'LIVE' next to the incident type and shows Jamal’s location as 'E Walnut St & 12th Ave, 0.1 mi' while he films outside Lincoln High.",
                "Step 9 (viewers/status visible): Viewer status and reactions begin surfacing in real time, drawing more local attention to a stream that already exposes his whereabouts."
              ],
              "design_problems": [
                "Precise location is auto-attached to a minor’s live feed by default; no option to blur, delay, or generalize location (e.g., neighborhood only).",
                "No age-aware warning or consent step explaining that voice, place names, and nearby landmarks can identify the minor.",
                "Real-time engagement features amplify discoverability of the stream while the minor is still on-site."
              ]
            },
            {
              "function": 1,
              "flow_id": "flow5",
              "step_causing_harm": [
                "Start (receive incident notification): A lockscreen banner reads 'Neighborhood Patrol near Cedar Park – 0.2 mi away (LIVE)' revealing Jamal’s rough location to anyone looking at his screen."
              ],
              "design_problems": [
                "Lockscreen notifications expose distance-to-incident and nearby landmark by default, with no privacy-preserving summary mode (e.g., generic 'Alert nearby').",
                "No minor-specific default to hide sensitive location details from the lockscreen."
              ]
            },
            {
              "function": 2,
              "flow_id": "flow3",
              "step_causing_harm": [
                "Step 3 (open chat): The chat panel notes that usernames may be custom or anonymous, but Jamal is not shown which identity is currently active.",
                "Step 6 (comment posted): His comment—'It’s behind the cafeteria by the east gates—avoid that stairwell'—posts under his profile name, tying him to the school location and routine."
              ],
              "design_problems": [
                "Ambiguous identity state in chat: no clear pre-send indicator showing which display name will be used (real name vs. pseudonym vs. anonymous).",
                "No default-to-anonymous setting or age-aware nudge for minors before posting location-revealing comments.",
                "Comments are instantly public and mirrored to the reporter without a confirmation step to review identity and content sensitivity."
              ]
            }
          ],
          "leakage_source": "NeighborNet’s live location labeling, geofenced lockscreen notifications, and chat identity defaults.",
          "leak_to": "Neighbors on the app within the radius (including teachers and coaches who also use the app), classmates viewing the stream or chat, and bystanders who saw Jamal’s lockscreen banner.",
          "harms": [
            {
              "harm": "Reputational Harms",
              "cause": "The live stream and comment tie Jamal to a school scuffle and specific locations, creating a persistent association that others in the community can view and share."
            },
            {
              "harm": "Relationship Harms",
              "cause": "Adults (teacher, coach) infer Jamal’s whereabouts and activities from the app’s disclosures, straining trust and prompting disciplinary conversations."
            },
            {
              "harm": "Autonomy Harms – Thwarted Expectations and Lack of Control",
              "cause": "Location and identity are revealed by default without clear, minor-focused controls, undermining Jamal’s efforts to avoid location tagging and use pseudonyms."
            },
            {
              "harm": "Psychological Harms – Emotional Distress",
              "cause": "Being identified and linked to sensitive school incidents increases anxiety and fear of being monitored by adults and peers."
            },
            {
              "harm": "Physical Harms",
              "cause": "Real-time, precise location during the stream could enable unwanted contact by older students or strangers nearby."
            }
          ],
          "consequences": "A teacher flags the stream to the school office, Jamal’s coach confronts him about being near Cedar Park, and his parent restricts his phone use. Jamal avoids contributing to neighborhood alerts, begins taking longer routes home to avoid being recognized, and deletes recent posts—reducing his willingness to seek or share safety information when it might help."
        }
      ]
    },
    {
      "basic_info": {
        "name": "Liam",
        "age": 35,
        "tech_comfort_level": "medium"
      },
      "contextual_info": {
        "vulnerability_type_brief_description": "Intersectional identities and characteristics - Individual with chronic illness",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["medical records", "symptom logs", "treatment plans"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - sharing health data for care vs exposure",
          "Privacy vs. Disclosure of identity - risk of insurer misuse"
        ],
        "privacy_responses": [
          {
            "response": "Withholding disclosure",
            "description": "Shares only limited health info in online forums."
          },
          {
            "response": "Asking for help",
            "description": "Seeks advice from trusted patient communities discreetly."
          }
        ],
        "costs_and_consequences": [
          "Less tailored advice or misdiagnosis online",
          "Risk trusting poor-quality info"
        ]
      },
      "additional_privacy_responses_and_costs": {
          "privacy_tensions_with_short_description": [
              "Privacy vs. Disclosure of identity - limiting audience to avoid potential discrimination",
              "Privacy vs. Support - need for detailed disclosure for advice vs. risk of permanent public exposure",
              "Privacy vs. Data utility - limiting online sharing to prevent insurer access"
          ],
          "privacy_responses": [
              {
                  "response": "Selective visibility controls",
                  "description": "Uses friend lists or restricted groups to control who can see health-related posts."
              },
              {
                  "response": "Partial disclosure",
                  "description": "Omits identifiable health details while still describing symptoms or situations."
              },
              {
                  "response": "Restrictive sharing",
                  "description": "Avoids uploading detailed symptom logs or treatment histories to online platforms."
              }
          ],
          "costs_and_consequences": [
              "Reduced reach of health-related posts, potentially limiting peer support",
              "Potential for less accurate or relevant responses from community members",
              "Loss of potential benefits from aggregated health data analysis",
              "Reduced ability to track health trends across time digitally"
          ]
      },
      "stories": [
        {
          "persona_identity": "Liam is a 35-year-old man working as a library assistant in Portland who manages Crohn’s disease; he’s medium in tech comfort because he uses community and scheduling apps daily but is not confident navigating advanced privacy settings.",
          "story": "After watching a neighborhood stream about a brush fire near SE 34th Ave and Salmon St, Liam went live to warn neighbors about the smoke drifting toward his block. He mentioned on camera that he’s immunocompromised and can’t stay outside long. His stream, tagged to that intersection, remained publicly tied to the incident even after he later hid it from his profile. Later that evening, while reacting to another nearby stream, he posted a well-meaning comment explaining he’s on immunosuppressants and asking folks to check in on seniors on his street. The live video and his comment, both linked to his handle and neighborhood location, were easy for others to find through the incident page. A neighbor shared the link to a community group where a local insurance broker also participates, exposing Liam’s health condition and location without his intending it to spread.",
          "information_leaked": "Liam’s chronic illness status (Crohn’s disease), use of immunosuppressant medication, approximate home location (near SE 34th Ave & Salmon St, Portland), time of presence outdoors, and his public account handle linked to the incident.",
          "flow_in_app": [
            {
              "function": 1,
              "flow_id": "flow3",
              "step_causing_harm": [],
              "design_problems": []
            },
            {
              "function": 3,
              "flow_id": "flow7",
              "step_causing_harm": [
                "Step 7 - Broadcast goes live with location displayed as part of the active stream tied to the nearby incident.",
                "Step 9 - Stream gains public visibility via the incident page with viewer activity and reactions."
              ],
              "design_problems": [
                "Location precision is public by default with no easy option to blur/approximate or disable geotagging before going live.",
                "Broadcast is auto-attached to the incident page with broad discoverability, and the app does not clearly communicate persistence or scope of exposure."
              ]
            },
            {
              "function": 4,
              "flow_id": "flow1",
              "step_causing_harm": [
                "Step 4 - Choosing 'Hide Video From Profile' does not remove the live video from the incident page or broader discovery within the app."
              ],
              "design_problems": [
                "Ambiguous control: 'Hide Video From Profile' suggests broad removal but only hides from the user’s profile, not from incident pages or search.",
                "No warning or confirmation explaining what remains visible and where; no single-click pathway to fully delete or detach the broadcast from the incident."
              ]
            },
            {
              "function": 2,
              "flow_id": "flow7",
              "step_causing_harm": [
                "Step 7 - Liam posts a comment disclosing he is on immunosuppressants for Crohn’s.",
                "Step 8 - The comment is publicly displayed and linked to his account within the live chat on the incident."
              ],
              "design_problems": [
                "No contextual privacy nudge when comments include sensitive health terms; comments default to public visibility with persistent attachment to incidents.",
                "Identity linkage by default (handle/profile) with no anonymous or limited-audience option at comment time; no brief grace period to undo or redact sensitive comments."
              ]
            }
          ],
          "leakage_source": "NeighborNet’s default public broadcasting and comment visibility with precise geotagging and persistent attachment to incident pages, combined with Liam’s health-disclosing comment.",
          "leak_to": "Nearby residents viewing the incident page, a neighborhood group where the link was shared, and a local insurance broker who monitors community safety updates.",
          "harms": [
            {
              "harm": "Discrimination Harms",
              "cause": "Public exposure of a chronic illness and medication use via a geotagged live broadcast and a public comment enables an insurance broker to infer higher risk and adjust offerings."
            },
            {
              "harm": "Reputational Harms",
              "cause": "Neighbors can associate Liam’s identity and home area with a chronic illness due to the persistent incident-linked stream and public comment."
            },
            {
              "harm": "Psychological Harms - Emotional Distress",
              "cause": "Seeing his health status circulate beyond intended audiences produces anxiety and regret, amplified by the app’s lack of clear privacy safeguards."
            },
            {
              "harm": "Autonomy Harms - Lack of Control and Failure to Inform",
              "cause": "The app’s ambiguous 'Hide Video From Profile' control and lack of warnings about location precision and persistence thwart informed choices and meaningful control over visibility."
            },
            {
              "harm": "Autonomy Harms - Chilling Effects",
              "cause": "After unintended exposure, Liam becomes reluctant to warn neighbors or seek local support in the future."
            }
          ],
          "consequences": "The insurance broker flags Liam as higher risk, leading to a premium increase at renewal. Liam feels exposed in his neighborhood and withdraws from participating in community safety updates, losing timely support and information during future incidents."
        }
      ]
    },
    {
      "basic_info": {
        "name": "Arjun",
        "age": 28,
        "tech_comfort_level": "medium"
      },
      "contextual_info": {
        "vulnerability_type_brief_description": "Intersectional identities and characteristics - Person with physical disability",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["accessibility needs", "mobility data", "assistive device usage"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - assistive services need data access",
          "Privacy vs. Disclosure of identity - disability status may be stigmatizing"
        ],
        "privacy_responses": [
          {
            "response": "Controlling disclosure",
            "description": "Uses platforms where disability info held privately."
          },
          {
            "response": "Non-use",
            "description": "Avoids platforms that force outing of disability status."
          }
        ],
        "costs_and_consequences": [
          "Reduced access to some supportive apps",
          "Social isolation or missing communities"
        ]
      },
      "additional_privacy_responses_and_costs": {
          "privacy_tensions_with_short_description": [
              "Privacy vs. Disclosure of identity - providing accessibility info can expose disability status",
              "Privacy vs. Accessibility - accessible authentication may involve revealing impairment",
              "Privacy vs. Public participation - avoiding certain spaces to prevent unwanted exposure"
          ],
          "privacy_responses": [
              {
                  "response": "Use of privacy-centered tools",
                  "description": "Chooses assistants or platforms that explain privacy practices without requesting extra personal data."
              },
              {
                  "response": "Avoidance of certain authentication methods",
                  "description": "Chooses authentication approaches that do not require public demonstration of impairment."
              },
              {
                  "response": "Avoidance of monitored spaces",
                  "description": "Does not enter locations with camera-based systems that could capture assistive device use."
              }
          ],
          "costs_and_consequences": [
              "May limit engagement with platforms that lack accessible, privacy-respecting information features",
              "Potential difficulty accessing devices securely",
              "Increased dependency on less convenient authentication solutions",
              "Reduced access to public services or events",
              "Potential social isolation from avoiding monitored environments"
          ]
      },
      "stories": [
        {
          "persona_identity": "Arjun is a 28-year-old man who works as a customer support associate and uses a collapsible wheelchair for mobility; his identity as a person with a physical disability places him in a vulnerability group. He has medium tech comfort because he relies on transit and safety apps daily but avoids digging into advanced privacy settings.",
          "story": "One evening in Oakland, Arjun went live on the community safety app to warn neighbors about a sudden sinkhole forming along 1221 Cedar Ave after heavy rain. The short broadcast showed the street corner, his face, and his wheelchair as he described the hazard. The stream was automatically attached to the nearby incident and remained viewable as a recording. The next morning, Arjun searched the app to see how it looked publicly and found the recording labeled with the street and distance from viewers. Worried, he used the app’s option to hide the video from his profile, assuming that would remove it from public view. Later that day, a coworker mentioned seeing Arjun’s warning and recognized him by the video thumbnail showing his chair at the Cedar Ave curb, revealing his mobility impairment to colleagues without his consent.",
          "information_leaked": "Arjun’s disability status and assistive device use (wheelchair), approximate home/work neighborhood (Cedar Ave, Oakland), routine presence on that block in the evening, voice and face, and the exact street corner where he was physically located during the broadcast.",
          "flow_in_app": [
            {
              "function": 3,
              "flow_id": "flow5",
              "step_causing_harm": [
                "Step 5: Wait for 3 seconds to start broadcast — the live stream begins, capturing Arjun’s face and wheelchair while tying the stream to a precise location.",
                "Step 6: System decides there are active incidents nearby (yes) — the broadcast is linked to the incident and prepared for broad distribution.",
                "Step 7: Viewers and reactions begin appearing — the stream is effectively published and discoverable to neighbors."
              ],
              "design_problems": [
                "Default public publishing with precise geo-tagging and no easy opt-out before going live.",
                "No pre-broadcast privacy warning about identity-revealing visuals (assistive device) or location precision.",
                "No built-in blurring/redaction tools for faces/devices or location coarsening at the time of capture."
              ]
            },
            {
              "function": 1,
              "flow_id": "flow1",
              "step_causing_harm": [
                "Step 2: Tap a grey-bordered thumbnail to view stream details — the recording displays the street name/distance and a thumbnail framing Arjun and his wheelchair, making him identifiable.",
                "Step 3: Tap the video to watch the stream — the recording exposes his voice, face, device, and exact corner, persisting after the live ends."
              ],
              "design_problems": [
                "Recorded streams default to public discoverability with precise location labels.",
                "Thumbnails can feature identity-revealing frames and persist as discoverable anchors.",
                "No granular audience controls or automatic redaction for sensitive attributes in recordings."
              ]
            },
            {
              "function": 4,
              "flow_id": "flow1",
              "step_causing_harm": [
                "Step 4: Tap 'Hide Video From Profile' — Arjun believes he removed public access, but the recording remains attached to the incident and stays discoverable to others."
              ],
              "design_problems": [
                "Ambiguous control: 'Hide Video From Profile' does not clarify that the content remains public on incident pages and the map.",
                "Lack of confirmation or guidance about where the video still appears after hiding.",
                "No single, prominent control to fully unpublish or delist content from all public surfaces."
              ]
            }
          ],
          "leakage_source": "Arjun’s live broadcast combined with NeighborNet’s automatic public indexing and precise geo-tagging of recordings.",
          "leak_to": "Nearby app users in Oakland (including Arjun’s coworkers who use the app), building staff who monitor neighborhood updates, and any local residents browsing the incident feed.",
          "harms": [
            {
              "harm": "Discrimination Harms",
              "cause": "The app exposes Arjun’s assistive device and disability status alongside precise location, enabling coworkers to infer limitations and treat him differently in scheduling and evaluation."
            },
            {
              "harm": "Psychological Harms — Emotional Distress",
              "cause": "Persistent public availability of the recording after hiding from profile creates anxiety about ongoing exposure and unanticipated viewers recognizing him."
            },
            {
              "harm": "Autonomy Harms — Lack of Control and Thwarted Expectations",
              "cause": "The misleading 'Hide Video From Profile' control does not actually remove public access from incident and map views, undermining Arjun’s ability to control dissemination."
            },
            {
              "harm": "Reputational Harms",
              "cause": "The thumbnail and recording frame Arjun as the visible reporter at a specific corner, allowing others to draw conclusions about his capabilities and reliability outside of context."
            }
          ],
          "consequences": "A coworker reassigns Arjun away from tasks requiring travel, affecting his career progression; Arjun feels anxious about being recognized in his neighborhood; he reduces use of the safety app to avoid further exposure, losing timely local alerts and support he previously relied on."
        }
      ]
    },
    {
      "basic_info": {
        "name": "Maya",
        "age": 30,
        "tech_comfort_level": "high"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Intersectional identities and characteristics - Gender non-conforming individual",
        "privacy_awareness_level": "high",
        "information_cared_about": ["gender identity", "social media footprint", "dating profiles"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Disclosure of identity - outing exposes to harassment",
          "Privacy vs. Support - wants community but risks doxxing"
        ],
        "privacy_responses": [
          {
            "response": "Controlling disclosure",
            "description": "Maintains anonymous or pseudonym profiles focused on identity support."
          },
          {
          "response": "Privacy-enhancing technologies",
            "description": "Uses anonymous services and encrypted messaging."
          }
        ],
        "costs_and_consequences": [
          "Difficulty building personal connections under pseudonym",
          "Technical overhead and stress"
        ]
    },
    "additional_privacy_responses_and_costs": {
          "privacy_tensions_with_short_description": [
              "Privacy vs. Disclosure of identity - fear of being outed through online activity",
              "Privacy vs. Support - desire for connection vs. risk of exposure",
              "Privacy vs. Community visibility - activism increases risk of targeting"
          ],
          "privacy_responses": [
              {
                "response": "Limiting online disclosures",
                "description": "Carefully restricts the amount of personal or identity-related information shared online."
              },
              {
                "response": "Pseudonymous use",
                "description": "Creates and maintains anonymous or pseudonym dating profiles to seek support or connections without disclosure."
              },
              {
                "response": "Non-use of services",
                "description": "Avoids platforms perceived as risky due to potential exposure."
              },
              {
                "response": "Reliance on encrypted communication",
                "description": "Uses encrypted messaging apps and anonymous platforms to safeguard activist communication."
              }
          ],
          "costs_and_consequences": [
              "Restricted opportunities for authentic self-expression online",
              "Difficulty forming meaningful connections under pseudonym",
              "Exclusion from supportive or compatible dating communities",
              "Added technical burden of managing secure communication tools",
              "Stress from navigating constant threats of harassment"
          ]
    },
    "stories": [
      {
        "persona_identity": "Maya is a gender non-conforming barista and part-time community organizer; her work with queer mutual-aid groups places her in a vulnerable, often-targeted community. She’s highly tech-comfortable because she routinely manages encrypted chats, pseudonymous accounts, and device privacy settings for activism.",
        "story": "Late one evening, Maya opened NeighborNet to check reports near 18th St and Collingwood in San Francisco after seeing posts about a tense confrontation outside the Rainbow Community Center. She found a nearby live recap from earlier that night and watched to understand whether friends were safe. Wanting to counter hostile commentary, she posted a brief, supportive note in the chat. The app published her comment under her legal name and profile photo, which it had pulled from her verified account, and the message appeared live to everyone watching. The streamer and local viewers recognized the Center and the time; an acquaintance from her building’s association, known for transphobic remarks, saw her name in the chat and connected it to her residence. Within hours, Maya received hostile messages through the app and on other platforms, and rumors about her circulation started at work.",
        "information_leaked": "Her legal name and profile photo; public association with an LGBTQ-related incident at the Rainbow Community Center (18th St) at a specific time; inference that she was near or affiliated with that location; linkage of her NeighborNet identity to her real-world identity used for work and housing.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow3",
            "step_causing_harm": [
              "Step 4: Tap the video to watch the stream."
            ],
            "design_problems": [
              "Entering the stream implicitly opts the user into a public chat context without a clear, timely reminder about how identities are displayed in comments.",
              "No pre-chat identity confirmation or visibility control before engagement."
            ]
          },
          {
            "function": 2,
            "flow_id": "flow7",
            "step_causing_harm": [
              "Step 6: Tap input box to type your comment.",
              "Step 7: Type and submit your comment",
              "Step 8: Your comment is posted and shown in chat. It also appears on the reporter's screen."
            ],
            "design_problems": [
              "The guidance emphasizes conduct rules but not identity exposure; there is no obvious anonymous toggle or display-name selector at the point of commenting.",
              "Defaulting to legal name and profile photo increases identifiability without explicit, just-in-time consent.",
              "Comments are immediately broadcast to all viewers and mirrored on the host’s screen, amplifying exposure and making quick deletion or redaction unclear."
            ]
          }
        ],
        "leakage_source": "NeighborNet’s public chat/comment system using real-name defaults linked to her verified account.",
        "leak_to": "Nearby NeighborNet viewers including the streamer, local neighbors, and an acquaintance from her building’s association who regularly monitors neighborhood streams.",
        "harms": [
          {
            "harm": "Reputational harms",
            "cause": "Publicly linking her legal name and image to a contested community incident, enabling gossip and mischaracterization of her involvement."
          },
          {
            "harm": "Psychological harms — emotional distress",
            "cause": "Exposure in a hostile local forum led to targeted hostile messages and fear of continued harassment."
          },
          {
            "harm": "Autonomy harms — thwarted expectations and lack of control",
            "cause": "The app defaulted to real-name identity in chat without a clear, in-the-moment choice to post anonymously or under a pseudonym."
          },
          {
            "harm": "Discrimination harms",
            "cause": "Outing her identity and associations in a neighborhood space frequented by biased individuals increased the risk of biased treatment at work and in housing."
          },
          {
            "harm": "Relationship harms",
            "cause": "Neighbors and coworkers who saw the chat began spreading rumors that strained workplace and building relationships."
          }
        ],
        "consequences": "Maya received transphobic messages through the app and on social media, avoided local events for safety, and faced awkward conversations at work after a coworker referenced her comment. She experienced sleep disruption and fear about being targeted near her home, and she stopped participating in local mutual-aid streams, chilling her community engagement."
      }
     ]
    },
    {
      "basic_info": {
        "name": "Elena",
        "age": 29,
        "tech_comfort_level": "medium"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Socioeconomic disadvantage - Unemployed single parent",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["financial records", "benefit claims", "contact info"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - welfare requires sharing data",
          "Disclosure vs. Stigma - revealing unemployment brings judgment"
        ],
        "privacy_responses": [
          {
            "response": "Withholding disclosure",
            "description": "Redacts or simplifies info on public-facing forms or forums."
          },
          {
          "response": "Privacy-enhancing technologies",
            "description": "Uses alias emails, avoids linking social profiles to forms."
          }
        ],
        "costs_and_consequences": [
          "Delays in benefit processing",
          "Complex account setup and management"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [],
      "privacy_responses": [
          {
            "response": "",
            "description": ""
          }
      ],
      "costs_and_consequences": []
    },
    "stories": [
      {
        "persona_identity": "Elena is a 29-year-old woman, an unemployed former retail clerk and single mother; she’s medium-comfort with tech because she uses her phone daily for services and school communication but avoids advanced privacy settings and complex app controls.",
        "story": "Late one evening in Tacoma, Elena opens the community safety app to catch up on neighborhood issues. She watches a nearby recording about a car break-in on S 38th Street, then decides to go live from outside her Maple Court apartment complex to warn neighbors about a man testing door handles. Afterward, she comments on another live thread to ask whether the food bank down the road is still open, mentioning that she’d just finished filing her unemployment claim. The app publicly associates her viewing and live broadcast with her approximate home location and displays her real name on the comment. Neighbors, and later a local property manager who uses the app, see her presence and remarks tied to her identity and residence, which she didn’t realize would be so broadly visible.",
        "information_leaked": "Elena’s real name (default profile), approximate home location during a late-night live stream (geotagged neighborhood and street-level proximity), and employment/benefit status disclosed in a public comment; all linked to her account and viewable alongside an archived broadcast tied to her profile.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow3",
            "step_causing_harm": [
              "Step 4: Tap the video to watch the stream — her presence is surfaced to others as a viewer near the scene, linking her profile to a specific neighborhood at a specific time."
            ],
            "design_problems": [
              "Publicly visible viewer presence by default, with no opt-out or 'watch privately' mode.",
              "Viewer proximity tag derived from live GPS shown with the profile name, enabling location inference.",
              "No inline notice clarifying that watching a video will publicly expose presence/proximity."
            ]
          },
          {
            "function": 3,
            "flow_id": "flow5",
            "step_causing_harm": [
              "Step 5: Wait for 3 seconds to start broadcast — the live stream displays her location context while capturing identifiable surroundings and voice in real time.",
              "Step 7: Endpoint (go live succeeds) — the broadcast is distributed to nearby users, tying the live geotag and timing to her profile."
            ],
            "design_problems": [
              "Automatic geotagging and neighborhood labeling of the stream without a control to obscure or generalize location before going live.",
              "No pre-broadcast privacy checklist (e.g., hide name, blur background, mask audio, anonymize location).",
              "Default public distribution radius includes local residents and business accounts, broadening exposure."
            ]
          },
          {
            "function": 2,
            "flow_id": "flow7",
            "step_causing_harm": [
              "Step 7: Type and submit your comment — her unemployment/benefit status is posted under her default real-name identity.",
              "Step 8: Your comment is posted and shown in chat — the comment is publicly visible and persists with the stream history."
            ],
            "design_problems": [
              "Real name set as default comment identity despite support for anonymous/custom handles, with no salient prompt to switch.",
              "No clear warning that comments are public, persist with the incident’s archive, and are discoverable by non-neighbors (e.g., landlords).",
              "Lack of quick-delete or audience-scope controls at the moment of posting."
            ]
          }
        ],
        "leakage_source": "NeighborNet’s default settings and presentation choices (public viewer presence, automatic geotagging of live streams, real-name default in chat, persistent public archives).",
        "leak_to": "Nearby residents viewing the incident area in the app, the original host of the streams, local block association members using the app, and a local property manager browsing incidents with a business account.",
        "harms": [
          {
            "harm": "Reputational harm",
            "cause": "Public linkage of Elena’s name to late-night activity near her residence and her comment about filing unemployment, enabling stigmatizing inferences about reliability and stability."
          },
          {
            "harm": "Psychological harm — emotional distress",
            "cause": "Unexpected visibility of her location and personal circumstances in front of neighbors and local businesses without clear warnings or easy controls."
          },
          {
            "harm": "Autonomy harm — failure to inform and lack of control",
            "cause": "The app does not clearly inform that watching reveals presence/proximity, defaults to real-name identity in comments, and auto-geotags live streams without an obvious way to generalize or hide location."
          },
          {
            "harm": "Discrimination harm",
            "cause": "A landlord using the app can view her public comment about unemployment and her home-area livestream, leading to biased assumptions during screening."
          }
        ],
        "consequences": "A property manager later denies Elena’s rental application after finding her profile activity and comment, citing vague concerns about fit. Neighbors send snide messages referencing her being a single mom alone at night. Elena experiences anxiety, avoids using the app, and feels less safe reporting issues near her home."
      }
     ]
    },
    {
      "basic_info": {
        "name": "Noah",
        "age": 40,
        "tech_comfort_level": "low"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Socioeconomic disadvantage - Low literacy adult",
        "privacy_awareness_level": "low",
        "information_cared_about": ["identity", "financial data", "basic navigation data"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Accessibility - cannot understand consent forms",
          "Privacy vs. Support - wants services but unsure what gives away info"
        ],
        "privacy_responses": [
          {
            "response": "Apathy",
            "description": "Clicks through defaults or avoids use entirely."
          },
          {
          "response": "Non-use",
            "description": "Avoids apps and platforms perceived complex."
          }
        ],
        "costs_and_consequences": [
          "Exclusion from digital services or aid",
          "Misunderstanding of terms leading to unexpected exposure"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
          "Privacy vs. Accessibility - complexity of privacy notices forces bypassing them",
          "Privacy vs. Support - uncertainty about what data is shared prevents engagement with services"
      ],
      "privacy_responses": [
          {
            "response": "Click-through behavior",
            "description": "Skips over or accepts default privacy settings without reading notices."
          },
          {
            "response": "Avoidance of digital services",
            "description": "Chooses not to engage with apps or platforms that feel overwhelming due to text-heavy privacy or security requirements."
          }
      ],
      "costs_and_consequences": [
          "Inadvertent exposure of sensitive data",
          "No awareness of the scope of consent provided",
          "Exclusion from useful services and opportunities",
          "Increased vulnerability due to reliance on offline or informal alternatives"
      ]
    },
    "stories": [
      {
        "persona_identity": "Noah is a 40-year-old man who stocks shelves on the night shift at a cold-storage warehouse in South Seattle; as a low-literacy adult, dense screens and consent prompts feel confusing, so his tech comfort is low.",
        "story": "Late one evening outside his apartment on Rainier Ave S, Noah opened the community safety app to warn neighbors about a shouting match near his doorway. He went live from the incident page, and the app showed exactly where he was as he filmed his building entrance and spoke about leaving for work around 10:45 p.m. After things calmed down, he tried to make the video go away by hiding it in his profile, assuming that meant no one else could view it. The next morning a coworker mentioned seeing Noah’s video and address in the app, so Noah searched the neighborhood feed and found the recording still publicly available. Worried, he posted a comment under the video asking people not to share it and mentioning that he lived on the ground floor, unintentionally confirming the location was his. A neighbor shared the link with the landlord’s nephew, who passed it along, and soon Noah was being blamed for drawing attention to the property; he also felt unsafe knowing strangers now knew his schedule and where he slept.",
        "information_leaked": "Precise home location and building exterior (Rainier Ave S near S Willow St, approx. 0.2 miles from viewers), GPS-tagged proximity, Noah’s voice noting his nightly departure time (~10:45 p.m.), his public profile name and photo, and a follow-up comment confirming he lives on the ground floor.",
        "flow_in_app": [
          {
            "function": 3,
            "flow_id": "flow7",
            "step_causing_harm": [
              "Step 7: Wait for 3 seconds to start broadcast — the live stream begins and displays 'LIVE' with Noah’s selected incident type and location while showing the live video feed."
            ],
            "design_problems": [
              "Live streams default to showing precise location context with no plain-language option to blur or generalize location before going live.",
              "No pre-broadcast privacy summary in simple wording that explains who will see the stream, how long it persists, and how to remove it.",
              "Permission prompts are framed as functional (mic/camera) without clear, low-literacy warnings about public visibility and retention."
            ]
          },
          {
            "function": 4,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 4: Tap 'Hide Video From Profile' — Noah hides the video from his profile but it remains publicly viewable elsewhere in the app."
            ],
            "design_problems": [
              "Ambiguous terminology; 'Hide from Profile' appears to imply removal but only hides it from the user’s profile.",
              "No clear warning that the video remains discoverable in the public feed/map for others.",
              "Lack of a simple, prominent 'Delete everywhere' option or a plain-language comparison between hide vs. delete."
            ]
          },
          {
            "function": 1,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 3: Tap the video to watch the stream — any nearby user can open the recording with the location context, title, reporter name, and comments, preserving Noah’s identity-to-location link."
            ],
            "design_problems": [
              "Past live streams remain publicly accessible by default with identifying metadata (name, headshot, nearby address context).",
              "No audience controls or geofence-limiting privacy settings are surfaced by default to low-literacy users.",
              "The app’s discovery design incentivizes casual viewing of sensitive content without obfuscating reporter identity."
            ]
          },
          {
            "function": 2,
            "flow_id": "flow3",
            "step_causing_harm": [
              "Step 6: Your comment is posted and shown in chat — Noah’s public comment further confirms the location is his, linking identity to the address and routine."
            ],
            "design_problems": [
              "Comments default to public identity; no obvious 'post anonymously' or 'limit to trusted contacts' option.",
              "Guidelines emphasize civility, not privacy permanence or audience scope, and are not written for low-literacy comprehension.",
              "No prompt warning that comments can amplify location-identifying details already visible in the video."
            ]
          }
        ],
        "leakage_source": "The community safety app’s default public live streaming and retention with precise location context, combined with public profile identity and comments; secondarily, other users who share the publicly accessible recording.",
        "leak_to": "Anyone browsing the app within the Rainier Valley area, people who received related notifications, neighbors who viewed the recording, and recipients of the shared link, including the landlord’s nephew.",
        "harms": [
          {
            "harm": "Physical Harms",
            "cause": "The app publicly linked Noah’s home location and nightly schedule, increasing the risk of targeted harassment or break-ins."
          },
          {
            "harm": "Reputational Harms",
            "cause": "Public visibility of the incident and Noah’s identity led property stakeholders to view him as a source of trouble."
          },
          {
            "harm": "Psychological Harms — Emotional Distress",
            "cause": "Persistent visibility and sharing of the recording created ongoing anxiety about being watched and targeted."
          },
          {
            "harm": "Autonomy Harms — Failure to Inform, Thwarted Expectations, Lack of Control",
            "cause": "Ambiguous 'Hide from Profile' and missing plain-language cues led Noah to believe the video was removed, while it remained publicly accessible."
          },
          {
            "harm": "Economic Harms",
            "cause": "Stress and fear of retaliation disrupted Noah’s work schedule and led to expenses for added locks and temporary arrangements."
          }
        ],
        "consequences": "Noah lost sleep, missed several hours of work, purchased new locks, and faced strained relations with property management. He now avoids using the app altogether, feels unsafe at home, and remains unsure how to fully delete the recording or prevent future exposures."
      }
    ]
  },
  {
    "basic_info": {
      "name": "Rosa",
      "age": 55,
      "tech_comfort_level": "low"
    },
    "contextual_info": {
      "vulnerability_type_brief_description": "Socioeconomic disadvantage - Rural subsistence farmer",
      "privacy_awareness_level": "low",
      "information_cared_about": ["land ownership records", "income", "location"]
    },
    "privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
        "Privacy vs. Inclusion - agricultural platforms collect economic data",
        "Privacy vs. Location - geo-tracking may expose farm lands"
      ],
      "privacy_responses": [
        {
          "response": "Non-use",
          "description": "Rejects farm-management apps fearing data exposure."
        }
      ],
      "costs_and_consequences": [
        "Missed productivity tools or weather alerts",
        "Continued digital exclusion from markets"
      ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
          "Privacy vs. Location - data collection can expose land and operational details",
          "Privacy vs. Inclusion - uncertainty over data ownership and control",
          "Privacy vs. Land security - disclosure risks exploitation or land seizure"
      ],
      "privacy_responses": [
          {
            "response": "Skeptical engagement",
            "description": "Approaches digital tools with caution or avoids them due to fear of exploitation."
          },
          {
            "response": "Avoidance of data sharing",
            "description": "Chooses not to upload or share farm data on platforms due to lack of clarity on data use."
          },
          {
            "response": "Withholding sensitive details",
            "description": "Avoids sharing land ownership or income data with platforms or external actors."
          }
      ],
      "costs_and_consequences": [
          "Loss of potential benefits from data-driven farming solutions",
          "Exclusion from markets and support programs requiring digital participation",
          "Reduced access to financial or developmental programs requiring documentation of farm data",
          "Persistent mistrust in digitalization efforts"
      ]
    },
    "stories": [
      {
        "persona_identity": "Rosa is a 55-year-old woman, a rural subsistence farmer in the San Isidro Valley. She has low tech comfort because she mainly uses a basic smartphone for calls and struggles with app settings due to patchy internet and limited digital literacy.",
        "story": "After hearing about a grassfire nearby, Rosa opens NeighborNet to see if it threatens her fields. She watches a neighbor’s past stream labeled near Old Mill Road and realizes the video shows her fence line, the footpath to her irrigation shed, and the canal crossing that leads onto her land. The next morning, she notices an unfamiliar pickup idling by the Santa Ana Canal and, wanting to warn others, goes live through the app. The broadcast immediately pins her position and shows the approach to her pump house in real time. Within days, someone cuts through her fence at night and steals parts of the pump, and neighbors begin gossiping that she falsely accused a local driver.",
        "information_leaked": "Precise real-time and historical location near Old Mill Road and Santa Ana Canal; visual details of Rosa’s property boundaries and access paths; presence and model of her irrigation pump; her proximity to the incident at a specific time; inferred land value and operational routines (e.g., where equipment is stored).",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 2: Tap a grey-bordered thumbnail to view stream details (shows exact nearby location and a map, revealing Rosa’s property context).",
              "Step 3: Tap the video to watch the stream (video content and labels reveal landmarks, access routes, and assets on Rosa’s land)."
            ],
            "design_problems": [
              "Precise geotags and maps are shown without masking adjacent private property or offering an opt-out for affected non-reporting landowners.",
              "Archived streams retain identifiable landmarks with no automatic blurring of properties, faces, or sensitive infrastructure and no easy takedown pathway for bystanders."
            ]
          },
          {
            "function": 3,
            "flow_id": "flow5",
            "step_causing_harm": [
              "Step 5: Wait for 3 seconds to start broadcast (broadcast begins with Rosa’s exact location and continuous real-time exposure of her property and equipment).",
              "Step 6: System decides there are qualifying incidents nearby (auto-matching boosts Rosa’s stream to more local viewers, expanding exposure)."
            ],
            "design_problems": [
              "Default public, precise geolocation on live start with no prominent warning, no option to share approximate area, and no privacy preset for sensitive rural locations.",
              "Automatic incident matching and promotion increase reach without informing the user about audience expansion or offering a low-visibility mode."
            ]
          }
        ],
        "leakage_source": "NeighborNet Live+ auto-geotagging and promotion features via a neighbor’s earlier broadcast and Rosa’s own live stream.",
        "leak_to": "Nearby app users, opportunistic thieves monitoring local streams, and community members who receive boosted local broadcasts.",
        "harms": [
          {
            "harm": "Economic Harms",
            "cause": "The app’s geotagged video revealed the location and type of irrigation equipment, enabling targeted theft."
          },
          {
            "harm": "Physical Harms",
            "cause": "Real-time broadcasting of access routes and Rosa’s presence increased trespass risk and potential confrontation at her farm."
          },
          {
            "harm": "Reputational Harms",
            "cause": "The boosted live alert made it appear Rosa publicly singled out a local driver, fueling community gossip."
          },
          {
            "harm": "Psychological Harms — Emotional Distress",
            "cause": "Fear and anxiety after the theft and public exposure of her property."
          },
          {
            "harm": "Autonomy Harms — Failure to Inform, Lack of Control, Thwarted Expectations, Chilling Effects",
            "cause": "The app auto-published precise location and expanded audience without clear, front-loaded explanations or controls, discouraging Rosa from using digital tools she already distrusts."
          }
        ],
        "consequences": "Rosa loses critical irrigation equipment and money, becomes afraid to report future incidents, and withdraws from digital platforms that could aid her farm. Distrust from neighbors strains relationships, and she misses future safety alerts due to reduced engagement."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Leo",
        "age": 17,
        "tech_comfort_level": "high"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Socioeconomic disadvantage - Urban poor teenager",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["social ties", "financial help", "school info"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - school support apps require personal info",
          "Privacy vs. Disclosure of identity - peers might judge background"
        ],
        "privacy_responses": [
          {
            "response": "Withholding disclosure",
            "description": "Uses minimal profile info or anonymous submission."
          },
          {
            "response": "Controlling disclosure",
            "description": "Uses different accounts for school, social, and support."
          }
        ],
        "costs_and_consequences": [
          "Fragmented identity across platforms",
          "Mental effort managing clones"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
          "Privacy vs. Support - access to school apps requires sharing personal details",
          "Privacy vs. Disclosure of identity - fear of peer judgment drives careful control of visibility",
          "Privacy vs. Opportunity - online presence offers benefits but risks surveillance"
      ],
      "privacy_responses": [
          {
            "response": "Reluctant compliance",
            "description": "Shares required data for educational access despite not fully understanding risks."
          },
          {
            "response": "Audience restriction",
            "description": "Uses privacy settings or anonymous posting to limit who can view sensitive content."
          },
          {
            "response": "Self-censorship",
            "description": "Avoids posting about sensitive topics like finances or school struggles to prevent stigma or monitoring."
          }
      ],
      "costs_and_consequences": [
          "Unaware of long-term implications of student data collection",
          "Emotional and cognitive effort in maintaining multiple accounts",
          "Fragmented identity across platforms",
          "Loss of authentic expression",
          "Missed opportunities for support due to withholding information"
      ]
    },
    "stories": [
      {
        "persona_identity": "Leo is a 17-year-old male high school student who occasionally does gig delivery shifts; as an urban poor teen, he’s in a vulnerable socioeconomic group and is highly tech-comfortable because he has learned to stretch low-cost phones and navigate multiple apps to manage school, work, and safety.",
        "story": "One evening, Leo streamed a short live alert about a loud confrontation outside his apartment building on Essex Avenue to warn neighbors. Afterward, worried about being identified, he hid the recording in his profile and assumed it was no longer visible. The next day he discovered the recording still showed up on the neighborhood map, complete with his voice and the building’s entrance in frame. A classmate from Franklin High recognized his hoodie and shared the clip in a group chat, framing him as a snitch. Leo felt blindsided—he believed he’d reduced visibility but the app continued surfacing the video to nearby users.",
        "information_leaked": "Approximate home location and building entrance on Essex Avenue; time and date of Leo’s presence there; Leo’s first name (default account display), voice, and Franklin High hoodie visible in the video; neighborhood radius exposure through local notifications and map indexing; persistent availability of the recording despite being hidden from the profile.",
        "flow_in_app": [
          {
            "function": 3,
            "flow_id": "flow3",
            "step_causing_harm": [
              "Step 6: Tap 'Stay Live'.",
              "Step 7: System confirms related incident within 0.25 miles and active within the last 20 minutes.",
              "Step 8: Live stream continues with viewers and reactions."
            ],
            "design_problems": [
              "Step 6: Ambiguous consent—no clear warning about public discoverability, retention, or precise geotagging after choosing to stay live; no quick privacy toggles (blur/voice masking).",
              "Step 7: Auto-attachment of real-time location context without granular control or a privacy check just before publishing.",
              "Step 8: Default public indexing and auto-archiving of the live video with no post-stream prompt to limit visibility or strip identifiers."
            ]
          },
          {
            "function": 4,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 4: Tap 'Hide Video From Profile'."
            ],
            "design_problems": [
              "Misleading scope—'Hide from profile' suggests broader privacy, but the video remains discoverable on the neighborhood map and in feeds; no clarification that hiding does not unlist or de-index the recording."
            ]
          },
          {
            "function": 1,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 2: Tap a grey-bordered thumbnail to view stream details.",
              "Step 3: Tap the video to watch the stream."
            ],
            "design_problems": [
              "Step 2: Map detail page exposes reporter display name, distance, and location context even for recordings hidden from profile; hidden status isn’t enforced across surfaces.",
              "Step 3: Playback reveals voice, visuals (school hoodie, building entrance), and enables sharing, with no post-hoc masking or audience restriction."
            ]
          }
        ],
        "leakage_source": "The community safety app’s default public indexing, location labeling, and continued surfacing of recordings hidden only from the user’s profile.",
        "leak_to": "Nearby app users including classmates at Franklin High, building residents along Essex Avenue, and anyone receiving a shared link within the notification radius.",
        "harms": [
          {
            "harm": "Reputational Harm",
            "cause": "The app publicly indexes the live alert with identifying context (voice, school hoodie, location) and continues surfacing it on the neighborhood map even after the user hides it from their profile."
          },
          {
            "harm": "Psychological Harm (Emotional Distress)",
            "cause": "Unexpected continued exposure triggers anxiety and fear of retaliation when classmates circulate the recording labeling Leo as a snitch."
          },
          {
            "harm": "Autonomy Harm (Thwarted Expectations; Lack of Control; Failure to Inform)",
            "cause": "The interface implies hiding reduces visibility, but the recording remains discoverable; the app failed to clearly inform about indexing scope and offered no effective control to unlist or de-identify."
          },
          {
            "harm": "Relationship Harm",
            "cause": "Circulation of the clip strains Leo’s peer relationships and neighbor trust, as the app’s surfacing creates the impression he publicly reported them."
          },
          {
            "harm": "Physical Harm (Risk of Retaliation)",
            "cause": "Precise location context and building imagery increase the chance of targeted harassment near Leo’s home."
          }
        ],
        "consequences": "Leo is mocked in school group chats, avoids his usual route home, and stops participating in neighborhood safety posts. He deletes comments, changes accounts, and spends extra time managing privacy settings, but the damage to his reputation and sense of safety lingers."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Layla",
        "age": 19,
        "tech_comfort_level": "medium"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Socioeconomic disadvantage - Housing-insecure youth",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["location", "shelter history", "service usage"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - shelter services require registration",
          "Privacy vs. Disclosure of identity - fears data used against housing status"
        ],
        "privacy_responses": [
          {
            "response": "Withholding disclosure",
            "description": "Shares only essential info when asked."
          },
          {
            "response": "Asking for help",
            "description": "Inquires privately from known support organizations."
          }
        ],
        "costs_and_consequences": [
          "Reduced access to certain support if incomplete",
          "Risk of trusting unreliable guidance"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
          "Privacy vs. Support - data disclosure required for access to shelter or services",
          "Privacy vs. Location safety - phones provide support access but risk exposure of movement or shelter locations",
          "Privacy vs. Digital continuity - erasing digital traces protects privacy but disrupts records"
      ],
      "privacy_responses": [
          {
            "response": "Minimal disclosure",
            "description": "Shares only what is absolutely necessary during intake processes to reduce risk."
          },
          {
            "response": "Limiting phone use",
            "description": "Restricts use of apps or services perceived as risky in order to protect sensitive data."
          },
          {
            "response": "Data deletion and wiping",
            "description": "Actively removes sensitive information from devices to prevent exposure."
          }
      ],
      "costs_and_consequences": [
          "Incomplete disclosures may restrict access to critical resources",
          "Persistent mistrust of service providers",
          "Reduced access to safety-enhancing features and communication tools",
          "Isolation from potential support networks",
          "Loss of valuable records or communication history",
          "Additional stress from needing constant digital hygiene practices"
      ]
    },
    "stories": [
      {
        "persona_identity": "Layla is a 19-year-old woman working part‑time at a café; she’s housing‑insecure and rotates between a youth shelter and friends’ couches. She’s medium in tech comfort because she uses her phone daily for shifts, transit, and school Wi‑Fi, but avoids complex settings and rarely changes app defaults.",
        "story": "One evening in Oakland, Layla used a community safety app to warn neighbors about a man shouting outside the East Bay Safe Haven youth shelter on Pine Avenue. Her alert went live with the location attached, and nearby users quickly began watching. A few blocks away, classmates and others she knows received it in their feeds and could replay the video afterward. The next day she saw her own recording still easy to find on the app’s map, even though she had tried to hide it from her profile. Worried about who might see it, she posted a comment on another active neighborhood stream asking people not to share the clip, which displayed her account name alongside the shelter area. Word got back to someone she’d been avoiding, who now knew where she was spending nights. Afraid of being recognized or followed, she stopped returning to that shelter for a week. The stress of changing routes to work and finding a different place to sleep wore her down, and she felt ashamed that classmates might infer she was staying in a shelter.",
        "information_leaked": "Layla’s real-time and precise location near East Bay Safe Haven (2147 Pine Ave, Oakland), the fact that she is at/near a youth shelter suggesting housing insecurity and service usage, her account handle and profile photo, her voice/appearance, and the time window she frequents the area (evenings).",
        "flow_in_app": [
          {
            "function": 3,
            "flow_id": "flow3",
            "step_causing_harm": [
              "Step 6: Active live broadcast shows the selected incident type and the user’s location while recording.",
              "Step 8: The broadcast is live and discoverable, with comments starting to appear and viewers engaging."
            ],
            "design_problems": [
              "Precise geotag is publicly displayed during a live alert near a sensitive location (shelter).",
              "Default to public, location-attached streaming with no ‘sensitive-site’ masking, delay, or geofence for shelters."
            ]
          },
          {
            "function": 1,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 2: Stream details page exposes the street location and distance for the recorded alert.",
              "Step 3: Playing the recording continues to show location, title, and reporter identity, making the shelter-adjacent clip easily discoverable."
            ],
            "design_problems": [
              "Past live videos remain indexed by place, making sensitive recordings easy to re-find after the live ends.",
              "No option to redact or fuzz exact address/landmarks on replays; discoverability persists via map thumbnails."
            ]
          },
          {
            "function": 4,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 4: Selecting ‘Hide Video From Profile’ only removes it from the user’s profile view, not from public discovery elsewhere in the app."
            ],
            "design_problems": [
              "Misleading control scope—‘Hide’ implies broader privacy but only affects the profile page.",
              "No clear warning that the video remains viewable on the map/news for others; no easy path to full removal from public indexing."
            ]
          },
          {
            "function": 2,
            "flow_id": "flow3",
            "step_causing_harm": [
              "Step 6: Comment posts publicly in the live chat under her non-anonymous handle and is visible alongside location-tagged content."
            ],
            "design_problems": [
              "Comments default to non-anonymous identity without a prominent per-comment anonymity toggle for sensitive contexts.",
              "Comments persist with the broadcast, increasing linkability to the user when the topic involves a shelter."
            ]
          }
        ],
        "leakage_source": "The community safety app’s public geotagging of the live alert, persistent place-based indexing of the replay, and non-anonymous default for chat/comments.",
        "leak_to": "Nearby app users and followers in Oakland (including classmates, acquaintances, shelter-adjacent community members, and a person Layla was avoiding) who browse local streams and replays.",
        "harms": [
          {
            "harm": "Physical harms (risk of stalking or unwanted contact)",
            "cause": "Live and replayed content reveal Layla’s presence near the shelter with precise location, enabling someone to find or wait for her."
          },
          {
            "harm": "Reputational harms (stigma associated with shelter use)",
            "cause": "Replay and comments expose proximity to a youth shelter, allowing peers to infer housing insecurity."
          },
          {
            "harm": "Psychological harms (anxiety and emotional distress)",
            "cause": "Ongoing discoverability and identity-linked comments create fear of being recognized and tracked."
          },
          {
            "harm": "Autonomy harms (thwarted expectations, lack of control, chilling effects)",
            "cause": "‘Hide’ control only removes the video from her profile while it remains publicly accessible, undermining her ability to manage exposure and discouraging future help-seeking or safety reporting."
          }
        ],
        "consequences": "Layla avoids returning to the shelter for a week, changes her commute to evade recognition, experiences sleep disruption and anxiety, and stops using the app’s safety features—reducing her access to real-time neighborhood alerts and increasing personal risk."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Samir",
        "age": 33,
        "tech_comfort_level": "low"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Internal and experiential factors - Survivor of domestic violence",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["location", "communications", "support usage"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - contacting services may alert abuser",
        "Privacy vs. Autonomy - needs to hide usage from partner",
        "Privacy vs. Safety - surveillance forces reliance on insecure or temporary devices"
        ],
        "privacy_responses": [
          {
            "response": "Physical workarounds",
            "description": "Uses hidden browser history, private mode, or borrowed device."
          },
          {
          "response": "Non-use",
            "description": "Avoids apps that could leave trace."
        },
        {
          "response": "Use of borrowed devices",
          "description": "Communicates through public or borrowed devices to prevent abuser detection."
          }
        ],
        "costs_and_consequences": [
          "Harder to seek help quickly",
        "Isolation and continued risk",
        "Inconsistent and less reliable access to digital resources",
        "Added stress from secrecy and fear of being discovered"
      ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
        "Privacy vs. Support - surveillance deters safe communication with services",
        "Privacy vs. Autonomy - requires trusted outsiders to secure devices",
        "Privacy vs. Safety - surveillance forces reliance on insecure or temporary devices"
      ],
      "privacy_responses": [
        {
          "response": "Abandoning device use",
          "description": "Stops or minimizes use of personal devices suspected of being monitored."
        },
        {
          "response": "Seeking professional support",
          "description": "Relies on clinicians or advocates for secure device setup and monitoring checks."
        },
        {
          "response": "Use of borrowed devices",
          "description": "Communicates through public or borrowed devices to prevent abuser detection."
        }
      ],
      "costs_and_consequences": [
          "Reduced ability to access timely help",
          "Heightened isolation due to limited communication",
          "Dependency on external assistance to maintain digital safety",
          "Possible delays in regaining safe communication",
          "Inconsistent and less reliable access to digital resources",
          "Added stress from secrecy and fear of being discovered"
      ]
    },
    "stories": [
      {
        "persona_identity": "Samir is a 33-year-old man, a night-shift grocery stocker and part-time rideshare driver. As a survivor of domestic violence, he’s vulnerable to location exposure, and his low tech comfort comes from relying on borrowed phones and avoiding complex settings to stay hidden.",
        "story": "Waiting outside the Riverview Family Support Center on Riverview Ave in Brookdale, Samir used NeighborNet to check nearby activity. A nearby incident alert drew him into watching a clip, and when he saw someone suspicious circling the block, he decided to go live to warn neighbors. The app broadcast his block-level location along with his display name and voice to everyone following incidents nearby, including his ex who monitors the area feed. After the stream, Samir tried to hide it from his profile, believing it was concealed, but the video remained reachable from the incident page. His ex and others continued to access it and learn his proximity to the support center.",
        "information_leaked": "Samir’s block-level location near Riverview Ave and 5th St at a specific time; his use of a community safety app; his live broadcast content (voice/face), display name ('Samir R.'), and implicit indication that he’s engaging with a support center; persistent availability of the broadcast via the incident feed despite hiding it from his profile; automatic notifications to nearby subscribers about his live stream.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow5",
            "step_causing_harm": [
              "Start: Receive incident notification from NeighborNet showing title, short description, location (e.g., 'Riverview Ave, 0.2 mi'), and a video indicator on the lock screen."
            ],
            "design_problems": [
              "Lock-screen previews reveal precise nearby locations and live-media hints by default.",
              "No safety mode to suppress sensitive content or anonymize location in notifications.",
              "Defaults do not honor high-risk users’ need to hide usage from people nearby."
            ]
          },
          {
            "function": 3,
            "flow_id": "flow5",
            "step_causing_harm": [
              "Step 5: Wait for 3 seconds to start broadcast — the stream goes live and publicly attaches Samir’s current location and incident type to a neighborhood feed.",
              "Step 6: System determines there are related incidents within 0.25 miles in the last 20 minutes — the app promotes the stream to nearby subscribers.",
              "Step 7: Viewers and reactions appear — confirms distribution of his live location, voice, and display name to the local audience."
            ],
            "design_problems": [
              "Street-level location and timestamp are displayed during live without default masking or delay.",
              "Public-by-default audience with auto-push to nearby subscribers; no granular audience controls or private mode at publish time.",
              "User identity (name/avatar/voice) surfaced without an easy 'anonymous broadcaster' option.",
              "No prominent pre-broadcast safety warning in this path; inconsistent with other flows that present stronger preflight guidance."
            ]
          },
          {
            "function": 4,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 4: Tap 'Hide Video From Profile' — Samir believes the stream is concealed, but it remains accessible via the incident page and search."
            ],
            "design_problems": [
              "Misleading control scope — 'Hide From Profile' does not clarify that the video remains public elsewhere.",
              "No one-tap emergency purge; deletion is separate and higher friction.",
              "No feedback on where the content still appears (incident page, news feed, external shares/notifications)."
            ]
          }
        ],
        "leakage_source": "NeighborNet’s default lock-screen notifications and public live-broadcast model, combined with Samir’s inadvertent disclosure by going live under these defaults.",
        "leak_to": "Nearby NeighborNet subscribers in Brookdale, Samir’s abusive ex-partner who monitors local feeds, and other community members browsing the incident page.",
        "harms": [
          {
            "harm": "Physical harm (heightened risk of being located)",
            "cause": "The live stream publicly tied Samir’s identity and real-time location to a neighborhood feed and pushed alerts to people nearby."
          },
          {
            "harm": "Psychological harm (emotional distress and fear)",
            "cause": "Ongoing availability of the stream despite hiding it from his profile, plus real-time exposure of his proximity to a support center."
          },
          {
            "harm": "Autonomy harm (lack of control, failure to inform, thwarted expectations)",
            "cause": "The app did not clearly warn about public-by-default exposure or the limited scope of 'Hide From Profile,' undermining Samir’s ability to manage visibility."
          },
          {
            "harm": "Relationship harm (compromised trust with support services)",
            "cause": "The broadcast linked him to the support center, undermining the confidentiality he expected while seeking help."
          }
        ],
        "consequences": "Samir’s ex arrived near the block after seeing the stream and sent threatening messages. Shelter staff moved Samir to a different location; he left early, missed two work shifts, and stopped using his phone for several days. The incident increased his isolation and stress, and he now avoids the app entirely despite needing timely safety information."
      }
    ]
  },
  {
    "basic_info": {
      "name": "Joy",
      "age": 38,
      "tech_comfort_level": "medium"
    },
    "contextual_info": {
      "vulnerability_type_brief_description": "Internal and experiential factors - Formerly incarcerated individual",
      "privacy_awareness_level": "moderate",
      "information_cared_about": ["criminal record", "rehabilitation history", "job applications"]
    },
    "privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
        "Privacy vs. Support - reentry services require sharing records",
        "Privacy vs. Disclosure of identity - fear stigma by employers"
      ],
      "privacy_responses": [
        {
          "response": "Controlling disclosure",
          "description": "Sets up separate contact information for job-search and activism."
        },
        {
          "response": "Privacy lies",
          "description": "Minimizes detail about conviction when possible."
        }
      ],
      "costs_and_consequences": [
        "Legal risk if false info discovered",
        "Emotional burden of managing identity"
      ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
          "Privacy vs. Disclosure of identity - fear of ongoing monitoring after release",
          "Privacy vs. Support - digital engagement needed for reentry but feared for exposure",
          "Privacy vs. Employment - digital applications risk exposing incarceration history"
      ],
      "privacy_responses": [
          {
            "response": "Self-censorship",
            "description": "Avoids sensitive details in communication due to fear of monitoring or later repercussions."
          },
          {
            "response": "Multiple identities",
            "description": "Creates distinct online accounts to separate personal life from reentry support or job search."
          },
          {
            "response": "Reluctance to apply online",
            "description": "Avoids digital job applications to prevent automatic rejection or stigma."
          }
      ],
      "costs_and_consequences": [
          "Emotional strain from suppressing authentic communication",
          "Fear of lasting surveillance undermines trust in digital tools",
          "Managing fragmented digital identities requires ongoing effort",
          "Limited openness can reduce opportunities for authentic social or professional connections",
          "Missed access to employment opportunities",
          "Continued economic vulnerability due to reluctance to use digital reentry systems"
      ]
    },
    "stories": [
      {
        "persona_identity": "Joy is a 38-year-old woman who works morning shifts as a cafe cashier while applying for warehouse jobs; as a formerly incarcerated person reentering the workforce, she’s vulnerable to stigma. She’s medium tech-comfort: she uses her phone daily for maps and job posts but often misses or misunderstands granular privacy settings.",
        "story": "On Tuesday evening around 7:45 p.m. in Chicago’s North Center, Joy opened the NeighborNet app to check what was happening nearby before her early shift. She watched a recent community stream about a string of car break-ins around 2100 W Belmont Ave. The next morning, when she spotted someone tugging on door handles outside her transitional housing at 2024 W Belmont Ave, she used the app to go live so neighbors would lock their cars. The broadcast labeled her exact block and tied it to her profile name as viewers tuned in. Later, while watching a neighbor’s follow-up stream two blocks away at Roscoe St and Damen Ave, she posted a supportive comment that mentioned she was heading back to Mapleview Transitional Housing so people would understand why she was cautioning them to avoid the area. After realizing her name and comment revealed where she lived and her reentry status, she tried to hide the broadcast from her profile. The video disappeared from her profile but remained attached to the incident page, where locals—including a recruiter from RiverWorks Logistics who had planned to interview her—could still see the stream and her comment.",
        "information_leaked": "Precise street-level location of Joy’s transitional housing (near 2024 W Belmont Ave), linkage of her real name/profile to that location, her association with Mapleview Transitional Housing (revealing reentry status), the time window she is in that area (morning commute), and her broadcast/comment history connected to the incident.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow1",
            "step_causing_harm": [
              "None directly in this function; Joy only watched a past stream to understand neighborhood risk."
            ],
            "design_problems": [
              "None at this stage; the harm emerges in later functions when she broadcasts and comments."
            ]
          },
          {
            "function": 3,
            "flow_id": "flow5",
            "step_causing_harm": [
              "Step 5: Wait for 3 seconds to start broadcast — the live begins, automatically attaching a precise geotag to Joy’s profile and stream.",
              "Step 7: System confirms related incidents within 0.25 miles (yes) and surfaces her live to nearby users, amplifying the geotagged broadcast."
            ],
            "design_problems": [
              "Street-level geotagging is on by default with no clear pre-broadcast toggle to hide/blur location.",
              "Real-name or profile-identifier is prominently tied to the live, with no clear alias mode for sensitive broadcasts.",
              "No upfront privacy warning explaining that location and identity will be pushed to nearby users in real time."
            ]
          },
          {
            "function": 2,
            "flow_id": "flow3",
            "step_causing_harm": [
              "Step 5: Type and submit your comment — Joy mentions she’s returning to Mapleview Transitional Housing, revealing reentry status and routine.",
              "Step 6: Your comment is posted and shown in chat — the message is publicly tied to her profile and propagated to viewers."
            ],
            "design_problems": [
              "Chat is public and persistent by default with no conspicuous reminder about permanence or audience scope before posting.",
              "Default identity display (name/handle link to profile) lacks an easy, in-context option to anonymize or limit audience for sensitive comments.",
              "No immediate, obvious option to edit or retract a comment after posting."
            ]
          },
          {
            "function": 4,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 4: Tap 'Hide Video From Profile' — the video is hidden only from Joy’s profile but remains accessible on the incident page and via shares, creating a false sense of removal."
            ],
            "design_problems": [
              "Ambiguous control scope: 'Hide Video From Profile' does not clearly state it won’t remove the video from incident pages or public indexes.",
              "No inline confirmation explaining where the content still remains visible or how to fully remove it platform-wide."
            ]
          }
        ],
        "leakage_source": "NeighborNet’s default live stream geotagging and public chat tied to user profiles, plus limited-scope 'Hide from profile' controls that leave content public on incident pages.",
        "leak_to": "Nearby NeighborNet users within the alert radius, including a RiverWorks Logistics recruiter who checks the app before interviews, local neighbors, and Joy’s building manager who follows the incident feed.",
        "harms": [
          {
            "harm": "Reputational harm",
            "cause": "The live stream and public comment linked Joy by name to a transitional housing facility, signaling a reentry status to viewers."
          },
          {
            "harm": "Economic harm",
            "cause": "A recruiter seeing the broadcast and comment infers her incarceration history and quietly deprioritizes her application."
          },
          {
            "harm": "Psychological harm (emotional distress)",
            "cause": "Unexpected exposure of sensitive life context and home location triggers anxiety and shame."
          },
          {
            "harm": "Autonomy harms (thwarted expectations, lack of control, chilling effects)",
            "cause": "Ambiguous controls and default public geotagging undermine Joy’s expectation of control; she becomes hesitant to use the app to protect her neighborhood."
          },
          {
            "harm": "Discrimination harms",
            "cause": "Inferred criminal history from reentry association enables biased treatment by potential employers and neighbors."
          },
          {
            "harm": "Relationship harms",
            "cause": "Neighbors and a building manager form negative assumptions about Joy’s past, straining community relations."
          }
        ],
        "consequences": "Joy’s interview is postponed without explanation, and she later receives a rejection email. She avoids using the app, walks an extra 15 minutes to bypass the block around her housing, and stops engaging in neighborhood safety conversations. The stress erodes her confidence during other job applications and heightens fear that her past is permanently exposed."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Ben",
        "age": 27,
        "tech_comfort_level": "medium"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Internal and experiential factors - Person with severe anxiety",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["mental health data", "support group usage", "location"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - mental health apps track usage",
          "Privacy vs. Disclosure of identity - stigma about anxiety"
        ],
        "privacy_responses": [
          {
            "response": "Withholding disclosure",
            "description": "Avoids linking real identity to mental health apps."
          },
          {
          "response": "Privacy-enhancing technologies",
          "description": "Uses anonymous accounts or privacy-respecting platforms."
          }
        ],
        "costs_and_consequences": [
          "Less personalized recommendations",
          "Difficult to maintain continuity in support"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
          "Privacy vs. Support - monitoring features undermine sense of safety",
          "Privacy vs. Disclosure of identity - anonymity helps manage anxiety but limits openness",
          "Privacy vs. Mental well-being - breaches amplify anxiety symptoms"
      ],
      "privacy_responses": [
        {
          "response": "Avoidance of apps",
          "description": "Chooses not to use certain mental health apps that track too much personal data."
        },
        {
          "response": "Anonymous communication",
          "description": "Engages in support groups or online spaces using anonymous or text-only interactions to manage anxiety."
        },
        {
          "response": "Heightened caution",
          "description": "Becomes more cautious about where and how personal information is shared online after exposure to breaches."
        }
      ],
      "costs_and_consequences": [
          "Missed opportunities for supportive digital interventions",
          "Increased anxiety from perception of being surveilled",
          "Restricted ability to form deeper or more personal online connections",
          "Reinforcement of avoidance behaviors tied to anxiety",
          "Chronic stress from fear of potential misuse of data",
          "Reduced engagement with digital platforms due to breach concerns"
      ]
    },
    "stories": [
      {
        "persona_identity": "Ben is a 27-year-old man who works part-time as a barista and volunteers at a peer-support nonprofit; he lives with severe anxiety and prefers low-friction tech, making him moderately tech-comfortable but wary of digging into complex privacy settings that spike his stress.",
        "story": "After leaving his Tuesday evening anxiety support group at Hopewell Counseling Center on 1421 Cypress Ave in Oakland around 7:18 pm, Ben hears a loud scrape from a minor car collision by the curb. Wanting to help, he opens NeighborNet and starts a live alert so nearby drivers can avoid the blocked lane. The stream automatically labels the location with the counseling center’s name and pushes it to neighbors. Later that night, a coworker browsing the app watches the recording, recognizes Ben by his voice and jacket, and notices the clinic name on the stream. Word spreads at work that Ben attends an anxiety clinic, and the story becomes a source of gossip.",
        "information_leaked": "Precise geolocation and named place of broadcast (Hopewell Counseling Center, 1421 Cypress Ave, Oakland), timestamped presence (7:18 pm on a Tuesday), video capturing Ben’s voice and appearance, and the implied fact that he attends an anxiety support group at that clinic.",
        "flow_in_app": [
          {
            "function": 3,
            "flow_id": "flow7",
            "step_causing_harm": [
              "Step 7: The active NeighborNet Live+ broadcast displays a 'LIVE' status with the user’s location, exposing the exact named venue (Hopewell Counseling Center).",
              "Step 6: Selecting an incident type proceeds directly to a public broadcast without any privacy toggle, causing default public exposure of sensitive location.",
              "Steps 4–5: Permission prompts for mic/camera do not inform that the exact place name (a mental health clinic) and precise coordinates will be publicly attached to the stream."
            ],
            "design_problems": [
              "Reverse geocoding to a named sensitive POI is shown by default; no masking/fuzzing of mental health facilities.",
              "No pre-broadcast privacy control (e.g., blur location, hide venue name, limit audience) in the incident selection step.",
              "Permission prompts focus on device access but fail to disclose that sensitive location labels will be shown and archived."
            ]
          },
          {
            "function": 1,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 1: The app makes the stream widely discoverable on the neighborhood map within 24 hours, increasing unintended audience reach.",
              "Step 2: A viewer opens the recording’s details page, which includes the specific location and distance metadata tied to the counseling center.",
              "Step 3: Watching the video exposes Ben’s voice/appearance alongside the labeled clinic location, enabling viewers to infer his support group attendance."
            ],
            "design_problems": [
              "Default public discoverability of broadcasts via map thumbnails without sensitivity filtering.",
              "Location and distance metadata remain attached to past recordings; no automatic redaction for sensitive venues.",
              "Video player overlays the reporter’s contextual location information, reinforcing the sensitive association."
            ]
          }
        ],
        "leakage_source": "NeighborNet’s automatic geotagging and public distribution of the live broadcast, including named sensitive place labeling and persistent location metadata on the recording.",
        "leak_to": "Nearby NeighborNet users within the coverage radius, including Ben’s coworker at The Daily Bean cafe and local neighbors who browse the app’s map and recordings.",
        "harms": [
          {
            "harm": "Reputational harm",
            "cause": "The app publicly labels a mental health clinic as the broadcast location, enabling viewers to infer Ben’s anxiety treatment and spread stigmatizing gossip."
          },
          {
            "harm": "Psychological harm — emotional distress",
            "cause": "Unexpected exposure of sensitive health-related location triggers heightened anxiety and panic due to loss of privacy."
          },
          {
            "harm": "Autonomy harm — thwarted expectations and lack of control",
            "cause": "The app fails to inform or let Ben suppress sensitive venue labeling before going live, undermining his ability to control what is shared."
          },
          {
            "harm": "Discrimination harm",
            "cause": "Coworkers and a manager learn of his anxiety support group and adjust his shifts under the pretext of ‘reducing stress,’ impacting his work opportunities."
          }
        ],
        "consequences": "Ben’s manager reduces his customer-facing shifts, cutting his income; coworkers gossip, straining workplace relationships; Ben skips future in-person support group sessions and avoids the app, increasing isolation and worsening anxiety symptoms due to fear of further exposure."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Alice",
        "age": 68,
        "tech_comfort_level": "low"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Internal and experiential factors - Socially isolated senior",
        "privacy_awareness_level": "low",
      "information_cared_about": ["contact list", "location check-ins", "health alerts"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - family wants tracking for safety",
          "Privacy vs. Autonomy - resists location-sharing"
        ],
        "privacy_responses": [
          {
          "response": "Third-party protections",
            "description": "Family sets up monitoring apps on her behalf."
          },
          {
            "response": "Apathy",
            "description": "Does not engage with settings or privacy features."
          }
        ],
        "costs_and_consequences": [
          "Loss of independence",
        "Potential over-monitoring with limited consent"
      ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
          "Privacy vs. Autonomy - reliance on others reduces independence",
          "Privacy vs. Safety - older adults deprioritize privacy for perceived safety",
          "Privacy vs. Support - monitoring helps detect loneliness but compromises personal space"
      ],
      "privacy_responses": [
          {
            "response": "Delegated control",
            "description": "Relies on family or caregivers to configure monitoring and privacy settings."
          },
          {
            "response": "Apathy toward privacy",
            "description": "Chooses not to engage with privacy settings or protections, seeing them as unnecessary."
          },
          {
            "response": "Conditional acceptance of monitoring",
            "description": "Agrees to passive monitoring only when framed as supportive, despite discomfort with constant observation."
          }
      ],
      "costs_and_consequences": [
          "Loss of independence in decision-making",
          "Potential exposure to monitoring without informed consent",
          "Increased exposure to potential misuse of personal data",
          "Weaker control over how personal information is shared",
          "Loss of sense of privacy in the home",
          "Potential misinterpretation of personal behaviors leading to unnecessary interventions"
      ]
    },
    "stories": [
      {
        "persona_identity": "Alice is a 68-year-old woman, a retired librarian living alone, and a socially isolated senior. Her tech comfort is low because her family configured her phone and apps for her, so she rarely changes settings or reads prompts.",
        "story": "On a windy evening in Tacoma near South 12th Street and Yakima Avenue, Alice uses the community safety app to warn neighbors about a loud disturbance outside. Her live stream automatically tags the neighborhood and is visible to anyone nearby on the app. Later, she notices her own clip featured in the app’s news area and taps into it. While watching, she responds to a viewer asking if she’s safe, posting that she’s alone in her apartment above the bakery and will be home that night. The next morning, worried about the attention, she tries to hide the video from her profile and assumes that removed it. But neighbors still bring up the post, and a stranger leaves a flyer at her door referencing the disturbance. She realizes the clip and her comment are still viewable through the app’s incident pages, not just her profile.",
        "information_leaked": "Street-level location near S 12th St and Yakima Ave; that Alice lives alone; approximate home location (“apartment above the bakery”); time-of-day when she is home; voice and appearance; her persistent broadcast history linked to her profile identity.",
        "flow_in_app": [
          {
            "function": 3,
            "flow_id": "flow3",
            "step_causing_harm": [
              "Step 6: Tap 'Stay Live'—the stream continues with location and incident type visible in real time, making Alice’s presence and vicinity public.",
              "Step 8: Comment bubble and viewer status appear—confirms active audience and increases exposure while the stream remains geotagged."
            ],
            "design_problems": [
              "Default public, street-level geotagging during live broadcasts.",
              "No prominent option to blur or generalize location before going live.",
              "Audience scope and persistence of the broadcast are not clearly communicated."
            ]
          },
          {
            "function": 1,
            "flow_id": "flow3",
            "step_causing_harm": [
              "Step 3: Opening the news item—details display location/distance, reinforcing a persistent, searchable link between the clip and Alice’s neighborhood.",
              "Step 4: Playing the stream—exposes her voice/appearance and confirms she was physically present near that location at a specific time."
            ],
            "design_problems": [
              "Recorded live videos remain easily discoverable in News with location context.",
              "Lack of visibility controls or clear expiration for geotagged recordings."
            ]
          },
          {
            "function": 2,
            "flow_id": "flow3",
            "step_causing_harm": [
              "Step 5: Type and submit comment—Alice posts that she is alone in her apartment above the bakery, adding specific residency status.",
              "Step 6: Comment posted and shown in chat—her message is attached to the incident clip and viewable by the audience."
            ],
            "design_problems": [
              "Chat defaults to public identity and persists alongside the video.",
              "No contextual warning that comments can reveal sensitive personal circumstances (e.g., living alone) linked to location."
            ]
          },
          {
            "function": 4,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 4: Tap 'Hide Video From Profile'—Alice believes this removes public access, but the clip remains accessible via incident and news surfaces."
            ],
            "design_problems": [
              "Ambiguous control scope: 'Hide From Profile' does not explain that the video remains public elsewhere.",
              "No confirmation dialog clarifying residual discoverability outside the profile."
            ]
          }
        ],
        "leakage_source": "The app’s default public geotagging and indexing of live streams and comments; Alice’s own comment in chat due to unclear audience and persistence.",
        "leak_to": "Local app users within and beyond her immediate block, opportunistic strangers scanning the app’s News/Map, and any viewers who re-share or screen-record the clip.",
        "harms": [
          {
            "harm": "Physical harms",
            "cause": "Real-time and persistent geotagging plus her public comment that she lives alone increases risk of targeted approach at her residence."
          },
          {
            "harm": "Psychological harms — Emotional distress",
            "cause": "Ongoing visibility of the clip and comments after she thought she hid it causes anxiety about who knows where she lives and whether they will show up."
          },
          {
            "harm": "Autonomy harms — Thwarted expectations and Lack of control",
            "cause": "The ‘Hide From Profile’ control does not remove public access from incident/news pages, undermining her intention to make the content private."
          },
          {
            "harm": "Reputational harms",
            "cause": "Neighbors and strangers can associate her identity with ‘living alone’ and ‘vulnerable at night,’ affecting how she is perceived in the community."
          }
        ],
        "consequences": "A stranger leaves a flyer referencing the disturbance at Alice’s door, making her feel unsafe; she loses sleep and becomes reluctant to go out at night. Her family increases monitoring on her devices to ‘keep her safe,’ reducing her sense of independence. Meanwhile, the clip continues to circulate in the app’s incident pages despite being hidden from her profile."
      }
      ]
    },
    {
      "basic_info": {
        "name": "David",
        "age": 31,
        "tech_comfort_level": "medium"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Internal and experiential factors - Individual with history of addiction",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["support group attendance", "treatment history", "peer network"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - support groups want attendance logs",
          "Privacy vs. Disclosure of identity - fear stigma in community"
        ],
        "privacy_responses": [
          {
            "response": "Privacy lies",
            "description": "Gives ambiguous details or pseudonymous attendance."
          },
          {
            "response": "Controlling disclosure",
            "description": "Keeps separate email/accounts for recovery chats."
          }
        ],
        "costs_and_consequences": [
          "Potential breach of trust if deception revealed",
          "Labor managing multiple identities"
        ]
    },
    "additional_privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Treatment Access - telehealth sites requiring disclosure risk exposing sensitive data",
          "Privacy vs. Stigma - fear of information leakage to employers or insurers"
        ],
        "privacy_responses": [
          {
          "response": "Selective platform use",
          "description": "Chooses telehealth services with stronger privacy policies or avoids those known for third-party tracking."
          },
          {
          "response": "Limiting disclosure online",
          "description": "Minimizes details shared on telehealth platforms to reduce risk of exposure."
          }
        ],
        "costs_and_consequences": [
          "Restricted access to potentially helpful telehealth resources",
          "Increased mental burden from evaluating privacy policies",
          "Persistent fear of data misuse leading to delayed or avoided treatment"
      ]
    },
    "stories": [
      {
        "persona_identity": "David is a 31-year-old man working as a line cook at a neighborhood café; he’s in recovery from opioid addiction and attends evening support groups. He has medium tech comfort because he uses community and navigation apps daily but rarely changes default privacy settings.",
        "story": "On a Tuesday night after his recovery meeting at St. Mark’s Church on Maple Avenue, David opens the NeighborNet app and watches a recent clip about a suspicious car outside the church. Seeing a live update on the same thread, he posts a helpful comment that mentions he just left the NA group and urges neighbors to call the non-emergency line. A few minutes later, he starts a live broadcast from the sidewalk to capture the car’s plate for neighbors. Nearby users, including a coworker who follows neighborhood alerts, see his name, face, and precise location tied to the church at the time of the NA meeting. The next day, gossip circulates at work about his recovery, and David skips his next meeting out of embarrassment.",
        "information_leaked": "David’s attendance at an NA meeting at St. Mark’s Church on Maple Avenue (time-stamped to a Tuesday evening), his identity (profile photo and display name), his precise location during the broadcast, and his association with the recovery peer network via his public comment.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow1",
            "step_causing_harm": [],
            "design_problems": []
          },
          {
            "function": 2,
            "flow_id": "flow3",
            "step_causing_harm": [
              "Step 5: Type and submit your comment — David writes that he just left the NA group at St. Mark’s Church.",
              "Step 6: Your comment is posted and shown in chat — the message appears publicly under his profile photo and username, attached to a hyperlocal incident thread."
            ],
            "design_problems": [
              "Default public chat with no prominent warning that comments are visible to all local viewers and persist with the incident.",
              "Profile icon and display name are shown by default; no quick 'post anonymously' toggle in chat.",
              "Guidelines emphasize civility but do not caution against revealing sensitive health or support-group information."
            ]
          },
          {
            "function": 3,
            "flow_id": "flow7",
            "step_causing_harm": [
              "Step 7: Wait for 3 seconds to start broadcast — the live stream publishes with David’s identity tied to a precise street-level location.",
              "Step 9: While live, viewer status and reactions appear — the broadcast is immediately visible to nearby users, cementing his presence at the meeting location and time."
            ],
            "design_problems": [
              "Location and identity are displayed together by default during broadcasts with no option to blur or generalize location.",
              "Publishing visibility defaults to nearby viewers; there is no pre-broadcast privacy check or audience selector.",
              "The broadcast remains tied to the same incident thread where his earlier sensitive comment sits, increasing linkability."
            ]
          }
        ],
        "leakage_source": "NeighborNet’s default identity and location overlays during public chat and live broadcast; David’s comment posted without clear visibility controls.",
        "leak_to": "Neighbors within 0.25 miles who follow the incident thread, including a coworker who uses the app for local alerts.",
        "harms": [
          {
            "harm": "Reputational harms",
            "cause": "Public linkage of David’s name and face to NA attendance at a specific time/place via the app’s default identity display and open chat."
          },
          {
            "harm": "Psychological harms — emotional distress",
            "cause": "Unexpected exposure of sensitive recovery information to coworkers and neighbors, amplified by hyperlocal visibility."
          },
          {
            "harm": "Autonomy harms — lack of control and failure to inform",
            "cause": "The app provides no clear, timely controls to post anonymously or blur location, and offers limited warnings about the public, persistent nature of comments and live streams."
          },
          {
            "harm": "Relationship harms",
            "cause": "Coworker gossip triggered by the broadcast undermines David’s trust and comfort in attending local support meetings."
          },
          {
            "harm": "Discrimination harms",
            "cause": "Workplace stigma becomes more likely once recovery status is observable through the app’s public incident thread."
          }
        ],
        "consequences": "A coworker recognizes David in the broadcast and discusses his recovery status at work; David feels embarrassed, is quietly taken off some front-of-house shifts, and skips his next support meeting, increasing stress and relapse risk."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Kiran",
        "age": 34,
        "tech_comfort_level": "medium"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Structural and institutional exclusion - Disenfranchised ethnic minority",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["ethnic identity", "public records", "education history"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Disclosure of identity - registry data may be discriminatory",
          "Privacy vs. Support - identity needed for benefits but risky"
        ],
        "privacy_responses": [
          {
            "response": "Withholding disclosure",
            "description": "Uses partial identity when signing up for services."
          },
          {
            "response": "Privacy lies",
            "description": "Provides ambiguity around ethnic background."
          }
        ],
        "costs_and_consequences": [
          "Denied or delayed access to services",
          "Risk of detection or misrepresentation"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
        "Privacy vs. Disclosure of ethnic identity - disclosing can invite discrimination",
        "Privacy vs. Access to support - withholding identity may block benefits"
      ],
      "privacy_responses": [
        {
          "response": "Withholding or altering disclosure",
          "description": "Participants avoided or modified details about their ethnic identity to minimize risks of discrimination while using online services."
        },
        {
          "response": "Strategic ambiguity",
          "description": "Some individuals employed vagueness or partial disclosure as a tactic to protect themselves from profiling while still attempting to access services."
        }
      ],
      "costs_and_consequences": [
          "Restricted or delayed access to essential services due to incomplete disclosure",
          "Increased stress and fear of discriminatory treatment if disclosure occurs",
          "Risk of being flagged for misrepresentation when providing ambiguous or false information"
      ]
    },
    "stories": [
      {
        "persona_identity": "Kiran is a 34-year-old man working as a substitute middle-school teacher and a member of a disenfranchised ethnic minority; he’s moderately tech-comfortable because he uses community and school apps daily but rarely customizes advanced privacy settings.",
        "story": "While at school, Kiran’s phone lit up with a safety app alert about police activity near the Al Noor Cultural Center, a place tied to his community. A student and a colleague glanced at the notification as it popped up. Curious and concerned, Kiran opened the stream and later posted a brief question in chat about whether the street was safe to pass. The app displayed his full name and photo next to the comment, and the host read his name aloud. That evening, trying to help neighbors, Kiran went live from the scene; the app pinned his exact neighborhood and the video framed his school ID lanyard, revealing where he works. Panicked, he hid the video from his profile, but the broadcast kept appearing on the incident page and through shared links, leaving his identity and affiliations exposed despite his attempt to minimize visibility.",
        "information_leaked": "Full legal name and profile photo, proximity to and interest in an incident at the Al Noor Cultural Center, precise neighborhood location during a live broadcast, employment affiliation visible via school ID lanyard, and persistent broadcast/comment history linked to his account.",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow5",
            "step_causing_harm": [
              "Step 1: Receive incident notification from NeighborNet."
            ],
            "design_problems": [
              "Lock-screen notification shows detailed incident title and venue by default, revealing sensitive community affiliations.",
              "No sensitive-topic redaction or privacy-preserving preview for workplace contexts.",
              "No clear, easy-to-find notification privacy controls at the moment of receipt."
            ]
          },
          {
            "function": 2,
            "flow_id": "flow7",
            "step_causing_harm": [
              "Step 7: Type and submit your comment.",
              "Step 8: Your comment is posted and shown in chat. It also appears on the reporter's screen."
            ],
            "design_problems": [
              "Default display uses real name and headshot pulled from the user profile, overriding prior ambiguous username choices.",
              "No inline toggle to post anonymously at the moment of commenting; guidance appears but identity choice is not foregrounded.",
              "Amplification to the reporter’s on-screen feed increases exposure beyond the chat audience."
            ]
          },
          {
            "function": 3,
            "flow_id": "flow7",
            "step_causing_harm": [
              "Step 7: Wait for 3 seconds to start broadcast (the live overlay includes the incident type and the user's location; the camera feed can expose workplace identifiers).",
              "Step 8: System determines related incidents exist (Yes), triggering distribution and notifications."
            ],
            "design_problems": [
              "Precise location labeling on the live overlay reveals the user’s neighborhood in real time.",
              "No automatic face/object blurring or warning about visible workplace IDs before the stream starts.",
              "Auto-notification to nearby users increases reach without giving the streamer granular audience controls."
            ]
          },
          {
            "function": 4,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 4: Tap 'Hide Video From Profile'."
            ],
            "design_problems": [
              "‘Hide from profile’ implies removal but does not explain the video remains visible on the incident page and via share links.",
              "Lacks confirmation copy clarifying scope (profile vs. global discoverability) and offers no one-click purge or de-index option.",
              "No cache invalidation or retroactive anonymization for thumbnails and on-host screens."
            ]
          }
        ],
        "leakage_source": "The community safety app’s notification previews, default real-name comment display, precise location overlays and auto-distribution in live mode, and an ambiguous ‘Hide from profile’ control that doesn’t remove public access.",
        "leak_to": "Coworkers and students who saw the lock-screen alert, the live stream host and local viewers who saw Kiran’s name and comment, and neighbors and school parents who received or accessed the live stream and its shared links.",
        "harms": [
          {
            "harm": "Discrimination harms",
            "cause": "The app’s detailed alert and real-name chat associated Kiran with a culturally specific venue, enabling biased judgments by colleagues or parents."
          },
          {
            "harm": "Reputational harms",
            "cause": "Real-name attribution in chat and on the host’s screen linked Kiran publicly to a sensitive incident, risking rumors about his conduct or affiliations."
          },
          {
            "harm": "Psychological harms — emotional distress",
            "cause": "Persistent exposure despite hiding the video created anxiety and loss of safety, especially after his workplace was implicitly revealed."
          },
          {
            "harm": "Autonomy harms — lack of control and thwarted expectations",
            "cause": "The ‘hide’ action did not remove the video from public incident pages or shared links, undermining Kiran’s expectation of control over visibility."
          },
          {
            "harm": "Economic harms",
            "cause": "Public linkage of his identity, ethnicity, and workplace during a sensitive event could jeopardize substitute assignments if administrators or parents react negatively."
          },
          {
            "harm": "Relationship harms",
            "cause": "Coworkers’ and students’ exposure to the alert and the public stream strained professional relationships and trust."
          }
        ],
        "consequences": "A colleague raised concerns with the school office, and parents circulated the clip in a neighborhood chat. Kiran was informally warned to avoid ‘public controversy,’ leading to fewer substitute opportunities, heightened stress, and self-censorship in community support activities."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Jose",
        "age": 26,
        "tech_comfort_level": "high"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Intersectional identities and characteristics - Migrant laborer",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["immigration status", "location tracking", "work history"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - some platforms require status disclosure",
        "Privacy vs. Autonomy - surveillance via location-based check-ins"
        ],
        "privacy_responses": [
          {
            "response": "Controlling disclosure",
            "description": "Uses separate phone or SIM to minimize linking."
          },
          {
            "response": "Privacy lies",
            "description": "Provides generic information in employer-platforms."
          }
        ],
        "costs_and_consequences": [
          "Less reliable communication with official services",
          "Risk of sanctions if status exposed"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
          "Privacy vs. Employment Security - disclosure of immigration status as a condition of work",
          "Privacy vs. Autonomy - constant monitoring by smart devices limits freedom",
          "Privacy vs. Support Access - platforms require sensitive disclosures for services"
      ],
      "privacy_responses": [
        {
          "response": "Minimizing disclosure",
          "description": "Withholds or downplays sensitive details like immigration documents unless strictly required."
        },
        {
          "response": "Strategic avoidance",
          "description": "Alters behavior or avoids certain areas of the home to reduce exposure to monitoring devices."
        },
        {
          "response": "Use of pseudonyms",
          "description": "Creates alternate accounts or uses different names to safeguard identity while accessing services."
        }
      ],
      "costs_and_consequences": [
        "Fear of job loss if disclosure is resisted",
        "Persistent anxiety about exposure of immigration status",
        "Loss of personal autonomy in living spaces",
        "Emotional stress from continuous monitoring",
        "Difficulty in accessing official services with pseudonymous accounts",
        "Risk of being denied support if information is inconsistent"
      ]
    },
    "stories": [
      {
        "persona_identity": "Jose (he/him) is a 26-year-old construction day-laborer and migrant worker; his immigration status makes him vulnerable to job and status-related reprisals. He’s highly tech-comfortable because he juggles dual SIMs, pseudonymous accounts, and app settings to limit tracking.",
        "story": "After smelling gas on a jobsite near 1427 Willow Ave in Eastmont, Jose quickly went live on NeighborNet to warn nearby residents. The stream clearly showed his reflective vest with his employer’s logo and his voice as he pointed to the fenced site entrance. When the shift ended, worried about being identified by management, he hid the broadcast from his profile. The next morning he checked the app’s neighborhood map and discovered the recording still visible to the public as a recent clip. A site manager had already seen it and messaged that Jose had violated company media policies, threatening to cut his hours.",
        "information_leaked": "Real-time and recorded location near 1427 Willow Ave; timestamp of presence; visual identity (face, vest with employer logo); voice; association with a specific incident type near his workplace; link to his pseudonymous NeighborNet account; movement pattern implied by time and place.",
        "flow_in_app": [
          {
            "function": 3,
            "flow_id": "flow5",
            "step_causing_harm": [
              "Step 5: Wait for 3 seconds to start broadcast — the stream begins and reveals Jose’s live location and identity on-camera.",
              "Step 6: System decides there are nearby incidents — the live broadcast is distributed to local viewers.",
              "Step 7: Stream remains active with viewer status/comments — the content is archived and remains discoverable after the broadcast."
            ],
            "design_problems": [
              "Public-by-default live streams include precise location context and incident tagging without a pre-publish privacy warning.",
              "Implicit archiving: going live automatically stores a replay accessible to others, not clearly disclosed upfront.",
              "Identity surface area: on-stream overlays and camera defaults make de-anonymization easy (location + visuals + voice)."
            ]
          },
          {
            "function": 4,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 4: Tap 'Hide Video From Profile' — Jose believes this removes public access, but it only hides it from his profile."
            ],
            "design_problems": [
              "Ambiguous control: 'Hide Video From Profile' suggests broad concealment but only affects profile visibility.",
              "Lack of notice: no confirmation or explanation that the video remains on the public map/news archive and is still searchable."
            ]
          },
          {
            "function": 1,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 1: Map displays recent streams — the app continues surfacing Jose’s recording as a nearby clip.",
              "Step 2: Tap a grey-bordered thumbnail — reveals incident details with location context and association to Jose’s account.",
              "Step 3: Tap the video to watch — anyone can replay Jose’s stream despite it being hidden from his profile."
            ],
            "design_problems": [
              "Public replay persists for at least 24 hours (or more) regardless of profile hiding, contradicting user expectations.",
              "Cross-surface exposure: map/news views ignore a user’s profile-level hide setting.",
              "No ‘unlist’ or time-bound depublication option; shares and indexing continue to surface the clip."
            ]
          }
        ],
        "leakage_source": "NeighborNet’s public map/archive and recommendation system, which retains and distributes the replay despite profile hiding.",
        "leak_to": "The site manager at Reyna Construction, nearby NeighborNet users in Eastmont, local labor brokers who monitor neighborhood feeds, and anyone browsing the area’s past streams.",
        "harms": [
          {
            "harm": "Economic Harms",
            "cause": "The archived public replay links Jose to the jobsite and a policy-violating broadcast, enabling his manager to threaten reduced hours."
          },
          {
            "harm": "Autonomy Harms — Lack of Control and Thwarted Expectations",
            "cause": "The ‘Hide Video From Profile’ control does not remove the video from public discovery, undermining Jose’s attempt to limit exposure."
          },
          {
            "harm": "Psychological Harms — Emotional Distress",
            "cause": "Persistent visibility of the replay triggers anxiety about employer retaliation and potential status-related scrutiny."
          },
          {
            "harm": "Discrimination Harms",
            "cause": "The video’s location, voice, and employer branding allow targeting of a migrant laborer for discipline or biased treatment."
          }
        ],
        "consequences": "Jose’s hours are cut for “unauthorized media,” costing him income; he stops using the app to report hazards, feels heightened anxiety about being tracked near worksites, and alters his routines to avoid future visibility, making him less likely to warn the community in emergencies."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Linda",
        "age": 22,
        "tech_comfort_level": "low"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Socioeconomic disadvantage - High school dropout",
        "privacy_awareness_level": "low",
      "information_cared_about": ["educational history", "job-search data", "identity"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
          "Privacy vs. Support - job portals require identity",
          "Disclosure vs. Stigma - dropout status may limit opportunities"
        ],
        "privacy_responses": [
          {
            "response": "Apathy",
            "description": "Does not complete profiles or avoids platforms."
          }
        ],
        "costs_and_consequences": [
          "Limited access to job listings",
          "Economic exclusion"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [],
      "privacy_responses": [
        {
          "response": "",
          "description": ""
        }
      ],
      "costs_and_consequences": []
    },
    "stories": [
      {
        "persona_identity": "Linda is a 22-year-old woman working part-time as a cashier at a discount store; as a high school dropout facing socioeconomic disadvantage, she’s vulnerable, and her low tech comfort comes from sharing an older phone and avoiding settings she doesn’t understand.",
        "story": "On a slow afternoon, Linda opened the community safety app to check a nearby traffic incident that might delay a job fair interview at the Riverside Community Center. She watched a local stream about a collision near Pine Avenue and, feeling rushed, typed a question in the chat asking if buses were running since she needed to get to her interview and hadn’t finished her GED yet. The app published her message with her real name and approximate location attached to the stream. Later, a hiring manager reviewing neighborhood updates recognized her name and saw the comment, forming a negative impression about her education and reliability. Linda never heard back about the position and felt humiliated when a neighbor mentioned her post.",
        "information_leaked": "Full legal name as displayed by the app; approximate location and distance label tied to the incident (e.g., “0.3 mi · Pine Ave”); educational status (has not completed GED); job-search detail (attending a local job fair interview at Riverside Community Center).",
        "flow_in_app": [
          {
            "function": 1,
            "flow_id": "flow3",
            "step_causing_harm": [
              "Step 3: News card expands to a detail view with location/distance and an open chat attached to the incident.",
              "Step 4: Watching the stream where featured comments show user names, normalizing identity-forward chat without clarifying persistence."
            ],
            "design_problems": [
              "No clear, timely warning that comments are public, persistent, and linked to the incident’s location context.",
              "Identity display norms (names visible on featured comments) are shown without offering quick anonymity or nickname options."
            ]
          },
          {
            "function": 2,
            "flow_id": "flow3",
            "step_causing_harm": [
              "Step 4: Input box invites commenting but only shows a civility guideline; it does not state that real names and location context will be shown or archived.",
              "Step 6: Comment is posted and mirrored to the reporter’s screen, attaching Linda’s real name and proximity to the incident."
            ],
            "design_problems": [
              "Defaults to real-name identity with no prominent toggle to post anonymously or under a nickname.",
              "Lack of an inline privacy preview (e.g., how the name and location will appear) before sending.",
              "Mirroring comments to the reporter’s screen expands the audience beyond local viewers without explicit consent.",
              "No immediate, simple option to retract or edit the comment once posted."
            ]
          }
        ],
        "leakage_source": "The app’s default real-name and location stamping of comments combined with Linda’s comment content; the reporter’s mirrored chat overlay.",
        "leak_to": "Local viewers of the stream, including neighbors and the hiring manager for the Riverside Community Center’s job fair; the reporter’s broader audience if the stream recording is reviewed.",
        "harms": [
          {
            "harm": "Discrimination harms",
            "cause": "The app publicly links her education status and job-search efforts to her real name and location, enabling a hiring manager to screen her out."
          },
          {
            "harm": "Reputational harms",
            "cause": "Her incomplete GED and job-seeking anxiety are exposed to neighbors and the reporter’s audience, shaping negative perceptions."
          },
          {
            "harm": "Psychological harms - Emotional distress",
            "cause": "Seeing her personal situation discussed and possibly judged by locals causes shame and anxiety."
          },
          {
            "harm": "Autonomy harms - Failure to Inform and Lack of Control",
            "cause": "The app fails to clearly inform that comments are public, persistent, and identity- and location-linked, and it provides no easy way to post anonymously or retract."
          },
          {
            "harm": "Economic harms",
            "cause": "The hiring manager uses the leaked information to deprioritize her application, reducing her access to work."
          }
        ],
        "consequences": "Linda does not receive an interview follow-up and loses income opportunities. She becomes embarrassed in her neighborhood, avoids using the app, and withdraws from other online tools that could help her find work, compounding her economic exclusion."
      }
    ]
    },
    {
      "basic_info": {
        "name": "Eva",
        "age": 16,
        "tech_comfort_level": "high"
      },
      "contextual_info": {
      "vulnerability_type_brief_description": "Internal and experiential factors - Teen facing online bullying",
        "privacy_awareness_level": "moderate",
        "information_cared_about": ["social posts", "school identity", "online friends"]
      },
      "privacy_responses_and_costs": {
        "privacy_tensions_with_short_description": [
        "Privacy vs. Self-expression - wants to post but fears harassing responses",
        "Privacy vs. Support - needs help but doesn't want bully to notice"
        ],
        "privacy_responses": [
          {
            "response": "Withholding disclosure",
            "description": "Removes identifying details, avoids naming school."
          },
          {
          "response": "Non-use",
            "description": "Stops using platforms where bullying occurs."
          }
        ],
        "costs_and_consequences": [
          "Silenced voice online",
          "Less social connection"
        ]
    },
    "additional_privacy_responses_and_costs": {
      "privacy_tensions_with_short_description": [
        "Privacy vs. Self-expression - revealing personal details increases bullying risk",
        "Privacy vs. Social support - avoiding disclosure reduces chances of connection and assistance"
      ],
      "privacy_responses": [
        {
          "response": "Withholding disclosure",
          "description": "Victims restrict or remove personal information such as school identity, hobbies, or photos to prevent being targeted."
        },
        {
          "response": "Non-use / Platform withdrawal",
          "description": "Teens stop using certain online platforms where bullying is frequent, even if it limits their social and expressive space."
        }
      ],
      "costs_and_consequences": [
        "Loss of opportunities for self-expression due to reduced sharing of personal details",
        "Weakened social connections from avoiding or leaving online spaces",
        "Ongoing fear and stress related to potential targeting if disclosure occurs"
      ]
    },
    "stories": [
      {
        "persona_identity": "Eva is a 16-year-old girl and high school sophomore who helps run her school club’s social media, which makes her highly tech-comfortable; she’s also a teen facing online bullying, leaving her vulnerable to targeted harassment.",
        "story": "After volleyball practice at 5:18 p.m., outside Riverton High’s North Gate on Pinecrest Ave, Eva used NeighborNet Live+ to warn about a gray panel van idling near the drop-off lane. The stream attached her name and precise location to the post while a bright school sign and her team hoodie were visible on camera. Classmates within a few blocks, including a bully who tracks neighborhood alerts, were notified and watched. Feeling exposed that night, Eva hid the video from her profile, assuming it wouldn’t be public anymore. The next morning, while checking neighborhood updates, she found the recording still surfaced in the app’s news feed with her name and the school location attached. She tried to post a brief request in the thread to take it down because she’s a minor, but the app blocked her message. Later, a clip of the stream circulated in a student group chat, mocking her and pointing out her usual practice schedule and route.",
        "information_leaked": "Precise GPS-tagged location at Riverton High (Pinecrest Ave) and time window; on-camera school identifier (signage, hoodie); Eva’s account name and profile photo; voice and face; inferred routine (after-practice timing, route); persistent recording discoverable via the app’s news feed even after hiding from profile.",
        "flow_in_app": [
          {
            "function": 3,
            "flow_id": "flow5",
            "step_causing_harm": [
              "Step 5: Broadcast starts after countdown; the stream goes live with location and reporter identity attached.",
              "Step 7: Stream remains active with viewers and reactions, notifying nearby users and exposing Eva’s presence at the school in real time."
            ],
            "design_problems": [
              "Auto-attaches precise location and reporter identity to a public live stream by default.",
              "No minor-safe or anonymity toggle prior to going live; no warning about school identifiers on camera.",
              "Default audience is broad local neighbors with push notifications, enabling rapid, targeted exposure."
            ]
          },
          {
            "function": 4,
            "flow_id": "flow1",
            "step_causing_harm": [
              "Step 4: Hide Video From Profile"
            ],
            "design_problems": [
              "Misleading control: hiding only removes it from the user’s profile but keeps it publicly discoverable via incident/news feeds.",
              "No clear disclosure of visibility scope after hiding; no option to unlist or fully delist the recording."
            ]
          },
          {
            "function": 1,
            "flow_id": "flow3",
            "step_causing_harm": [
              "Step 2: News shows moving video items from the last 24 hours, surfacing Eva’s ‘hidden’ recording with her identity and location.",
              "Step 4: Playing the recording continues exposure and encourages resharing."
            ],
            "design_problems": [
              "News/feed ranking continues to promote recordings that were ‘hidden from profile’.",
              "Identity and location labels remain attached on the playback page; no obfuscation for minors or school zones.",
              "No privacy scoping indicator showing who can currently see the recording."
            ]
          },
          {
            "function": 2,
            "flow_id": "flow2",
            "step_causing_harm": [
              "Step 4: System flags her removal request as violating guidelines.",
              "Step 5: Comment is removed and not posted, preventing her from signaling a takedown need."
            ],
            "design_problems": [
              "Overbroad moderation removes benign removal/takedown requests by minors.",
              "No inline reporting or takedown control for the original poster on the recording page.",
              "Lack of a trusted channel for minors to request delisting without broadcasting additional identity details."
            ]
          }
        ],
        "leakage_source": "NeighborNet’s auto-location tagging, public live-stream notifications, and continued surfacing of recordings in the News feed despite ‘Hide From Profile’.",
        "leak_to": "Nearby subscribers within ~0.25 miles (including classmates), the bully monitoring local alerts, and students who receive the clip via school group chats and social accounts.",
        "harms": [
          {
            "harm": "Reputational Harms",
            "cause": "The app displays her name and school context on a widely visible local stream and preserves the recording in the News feed, enabling classmates to label and mock her."
          },
          {
            "harm": "Psychological Harms — Emotional Distress",
            "cause": "Persistent visibility and redistribution of the clip exacerbate anxiety and fear of renewed bullying."
          },
          {
            "harm": "Autonomy Harms — Lack of Control, Thwarted Expectations, Chilling Effects",
            "cause": "‘Hide From Profile’ doesn’t delist the video; the app blocks her takedown request, undermining control and discouraging future self-expression or help-seeking."
          },
          {
            "harm": "Physical Harms (risk)",
            "cause": "Precise time-and-place tagging near her school reveals her routine, increasing stalker or confrontation risks."
          },
          {
            "harm": "Relationship Harms",
            "cause": "Circulation of the clip in student chats strains peer relationships and trust."
          }
        ],
        "consequences": "A bully shares the recording in student group chats, prompting ridicule tied to her school identity and practice routine. Eva avoids after-school activities for a week, alters her route home, and withdraws from online spaces where she previously connected with friends. She stops using NeighborNet entirely, losing a potential safety tool and feeling silenced."
      }
    ]
  }
]