[
  {
    "user_flow_title": "Starting private listening via Private Session",
    "flows": [
      {
        "flow_id": "flow1",
        "steps": [
          {
            "start": "Launch the Music application on a desktop computer",
            "interface": "Home page"
          },
          {
            "step": 1,
            "action": "Click on the profile picture or username in the top-right corner of the screen.",
            "interface": "A drop-down menu appears below the user profile picture in the top-right corner of the screen. There are seven options in the drop-down menu, listed from top to bottom: Account, Profile, Upgrade to Premium, Support, Private Session, Settings, and Log out."
          },
          {
            "step": 2,
            "action": "Click 'Private Session'.",
            "interface": "The drop-down menu disappears, and a blue padlock icon appears on the Top App Bar."
          },
          {
            "endpoint": true,
            "interface": "The drop-down menu disappears, and a blue padlock icon appears on the Top App Bar.",
            "true_reasoning": "The blue padlock icon indicates that the Private Session has successfully started."
          }
        ]
      },
      {
        "flow_id": "flow2",
        "steps": [
          {
            "start": "Launch the Music application on a desktop computer",
            "interface": "Home page"
          },
          {
            "step": 1,
            "action": "Click on the profile picture or username in the top-right corner of the screen.",
            "interface": "A drop-down menu appears below the user profile picture in the top-right corner of the screen. There are seven options on the drop-down menu, from top to down are Account, Profile, Upgrade to Premium, Support, Private Session, Settings, and Log out."
          },
          {
            "step": 2,
            "action": "Click 'Settings'.",
            "interface": "Settings page with several sub-sections. The sub-sections are: Account, Language, Explicit Content, Autoplay, Audio Quality, Your Library, Display, Zoom Level, Social, Playback, Startup and window behavior, Storage, and ProxySettings."
          },
          {
            "step": 3,
            "action": "Scroll down and find the 'Social' section.",
            "interface": "Settings page — under the 'Social' section, there are one 'connection' button and five toggle buttons. The first button shows 'Connect with Facebook' with the description 'Connect with Facebook to see what your friends are playing.' The five toggle buttons in order are: (1) 'Publish my new playlists on my profile' (default: on), (2) 'Start a private session' (default: off), (3) 'Share my listening activity' (default: on), (4) 'Show my recently played artists on my public profile' (default: on), and (5) 'Show my followers and following lists on my public profile' (default: on). In addition, there is a question mark icon next to the 'Start a private session' setting."
          },
          {
            "step": 4,
            "action": "Hover over the question mark icon.",
            "interface": "A tooltip box appears with the message: 'Temporarily hide your activity from your followers. Private sessions will automatically end after 6 hours, or when you restart the app.'"
          },
          {
            "step": 5,
            "action": "Switch the 'Start a private session' toggle button to turn it on.",
            "interface": "A blue padlock icon appears on the Top App Bar."
          },
          {
            "endpoint": true,
            "interface": "A blue padlock icon appears on the Top App Bar.",
            "true_reasoning": "The blue padlock icon indicates that the Private Session has successfully started."
          }
        ]
      }
    ]
  }
]
